-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Jul 09, 2025 at 03:20 PM
-- Server version: 5.6.51
-- PHP Version: 8.1.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `eabyana_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `assign_roles`
--

CREATE TABLE `assign_roles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `assign_roles`
--

INSERT INTO `assign_roles` (`id`, `role_id`, `permission_id`, `created_at`, `updated_at`) VALUES
(9, 1, 1, NULL, NULL),
(19, 1, 2, NULL, NULL),
(20, 1, 3, NULL, NULL),
(24, 12, 4, NULL, NULL),
(25, 12, 2, NULL, NULL),
(26, 12, 3, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `canals`
--

CREATE TABLE `canals` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `canal_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `village_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `c_type` varchar(70) COLLATE utf8mb4_unicode_ci NOT NULL,
  `div_id` bigint(20) UNSIGNED DEFAULT NULL,
  `no_outlet` int(11) DEFAULT NULL,
  `no_outlet_ls` int(11) DEFAULT NULL,
  `no_outlet_rs` int(11) DEFAULT NULL,
  `total_no_cca` float(10,2) DEFAULT NULL,
  `total_no_discharge_cusic` float(10,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `canals`
--

INSERT INTO `canals` (`id`, `canal_name`, `village_id`, `created_at`, `updated_at`, `c_type`, `div_id`, `no_outlet`, `no_outlet_ls`, `no_outlet_rs`, `total_no_cca`, `total_no_discharge_cusic`) VALUES
(1, 'Lower Swat', NULL, '2025-07-01 01:40:36', '2025-07-01 01:40:36', 'flow', 1, 8, 0, 8, 2495.00, 1436.00),
(2, 'Arbi LIS Scheme', NULL, '2025-07-03 05:01:57', '2025-07-03 05:01:57', 'LIS', 1, 1, 1, 0, 250.00, 2.14),
(3, 'Kandar LIS Scheme', NULL, '2025-07-03 23:58:11', '2025-07-03 23:58:11', 'LIS', 1, 12, 8, 4, 3863.00, 34.80),
(4, 'Old Mayar LIS Scheme', NULL, '2025-07-04 00:12:45', '2025-07-04 00:12:45', 'LIS', 1, 14, 8, 6, 745.00, 6.71),
(5, 'New Mayar LIS Scheme', NULL, '2025-07-04 00:18:12', '2025-07-04 00:18:12', 'LIS', 1, 7, 4, 3, 1365.00, 12.29);

-- --------------------------------------------------------

--
-- Table structure for table `canal_branch`
--

CREATE TABLE `canal_branch` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `branch_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `canal_id` bigint(20) UNSIGNED DEFAULT NULL,
  `div_id` bigint(20) UNSIGNED DEFAULT NULL,
  `minor_id` bigint(20) UNSIGNED DEFAULT NULL,
  `distrib_id` bigint(20) UNSIGNED DEFAULT NULL,
  `no_outlet` int(11) DEFAULT NULL,
  `no_outlet_ls` int(11) DEFAULT NULL,
  `no_outlet_rs` int(11) DEFAULT NULL,
  `total_no_cca` float(10,2) DEFAULT NULL,
  `total_no_discharge_cusic` float(10,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `canal_branch`
--

INSERT INTO `canal_branch` (`id`, `branch_name`, `canal_id`, `div_id`, `minor_id`, `distrib_id`, `no_outlet`, `no_outlet_ls`, `no_outlet_rs`, `total_no_cca`, `total_no_discharge_cusic`, `created_at`, `updated_at`) VALUES
(1, 'Bara Banda Minor Branch', 1, 1, 2, 4, 4, 3, 0, 779.00, 15.00, '2025-07-03 07:27:46', '2025-07-03 07:27:46'),
(2, 'Kodinaka Minor 1/Kalpani', 1, 1, 3, 8, 16, 6, 9, 3364.00, 45.00, '2025-07-03 07:29:40', '2025-07-03 07:29:40'),
(3, 'Taus Minor 2/Kalpani', 1, 1, 3, 8, 12, 6, 5, 2269.00, 42.00, '2025-07-03 07:33:07', '2025-07-03 07:33:07');

-- --------------------------------------------------------

--
-- Table structure for table `cropprices`
--

CREATE TABLE `cropprices` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `final_crop` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `crop_type` enum('Cash Crop','Non-Cash Crop') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'Cash Crop'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `cropprices`
--

INSERT INTO `cropprices` (`id`, `created_at`, `updated_at`, `final_crop`, `crop_type`) VALUES
(1, '2024-12-26 00:32:58', '2025-06-23 04:05:36', 'Maize (مکئی)', 'Non-Cash Crop'),
(2, '2024-12-26 00:33:23', '2025-06-23 04:06:30', 'Rice (چاول)', 'Non-Cash Crop'),
(4, '2025-06-23 03:55:48', '2025-06-23 03:55:48', 'Wheat (گندم)', 'Non-Cash Crop'),
(5, '2025-06-30 21:04:46', '2025-06-30 21:05:31', 'Shaftal (شفتل)', 'Non-Cash Crop'),
(6, '2025-06-30 21:13:47', '2025-06-30 21:13:47', 'Toom (لہسن)', 'Non-Cash Crop'),
(7, '2025-06-30 21:14:25', '2025-06-30 21:14:25', 'Sabzi (سبزی)', 'Non-Cash Crop'),
(8, '2025-06-30 21:15:13', '2025-06-30 21:15:13', 'Darakhtaan (درختان)', 'Non-Cash Crop'),
(9, '2025-06-30 21:15:55', '2025-06-30 21:15:55', 'Ghopi (گھوپی)', 'Non-Cash Crop'),
(10, '2025-06-30 21:17:08', '2025-06-30 21:17:08', 'Baghicha (باغیچہ)', 'Non-Cash Crop'),
(11, '2025-06-30 21:19:23', '2025-07-05 21:48:52', 'Mud Grass (مڈ گراس)', 'Non-Cash Crop'),
(12, '2025-06-30 21:20:26', '2025-06-30 21:20:26', 'Joi (جوئی)', 'Non-Cash Crop'),
(13, '2025-06-30 21:21:04', '2025-06-30 21:21:04', 'Chukandar (چقندر)', 'Non-Cash Crop'),
(14, '2025-07-01 18:23:28', '2025-07-01 18:23:28', 'چمن پھلواڑی', 'Non-Cash Crop'),
(15, '2025-07-01 18:24:20', '2025-07-01 18:24:20', 'چمن پھلواڑی', 'Non-Cash Crop'),
(16, '2025-07-03 23:20:07', '2025-07-03 23:20:07', 'Sarshaf (سرشَف)', 'Cash Crop'),
(17, '2025-07-05 21:47:55', '2025-07-05 21:47:55', 'Chari (چری)', 'Non-Cash Crop'),
(18, '2025-07-05 23:19:48', '2025-07-05 23:19:48', 'Jinjin جنجن', 'Non-Cash Crop'),
(19, '2025-07-07 15:00:50', '2025-07-07 15:00:50', 'Sun Flower (سورج مکھی)', 'Cash Crop'),
(20, '2025-07-07 15:00:59', '2025-07-07 15:00:59', 'Tobacco Virginia (ورجینیا تمباکو)', 'Cash Crop'),
(21, '2025-07-07 15:01:18', '2025-07-07 15:01:18', 'Shaljam (شلجم)', 'Non-Cash Crop');

-- --------------------------------------------------------

--
-- Table structure for table `crops`
--

CREATE TABLE `crops` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `crop_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `crops`
--

INSERT INTO `crops` (`id`, `crop_name`, `created_at`, `updated_at`) VALUES
(1, 'Rabi', '2024-12-23 04:45:23', '2024-12-23 04:45:23'),
(2, 'Kharif', '2024-12-23 04:45:23', '2024-12-23 04:45:23');

-- --------------------------------------------------------

--
-- Table structure for table `cropsurveys`
--

CREATE TABLE `cropsurveys` (
  `crop_survey_id` bigint(20) UNSIGNED NOT NULL,
  `khasra_number` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tenant_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `registration_date` date NOT NULL,
  `cultivators_info` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `snowing_date` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `land_assessment_marla` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `land_assessment_kanal` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `previous_crop` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` date DEFAULT NULL,
  `width` varchar(150) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `length` varchar(150) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `area_marla` int(11) DEFAULT NULL,
  `area_kanal` int(11) DEFAULT NULL,
  `double_crop_marla` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `double_crop_kanal` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `identifable_area_marla` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `identifable_area_kanal` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `irrigated_area_marla` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `irrigated_area_kanal` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `land_quality` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `irrigator_khata_number` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `village_id` bigint(20) UNSIGNED NOT NULL,
  `irrigator_id` bigint(20) UNSIGNED NOT NULL,
  `canal_id` bigint(20) UNSIGNED NOT NULL,
  `minor_id` bigint(20) DEFAULT NULL,
  `distri_id` bigint(20) DEFAULT NULL,
  `branch_id` bigint(20) DEFAULT NULL,
  `crop_id` bigint(20) UNSIGNED NOT NULL,
  `outlet_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `session_date` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `finalcrop_id` bigint(20) UNSIGNED DEFAULT NULL,
  `crop_price` varchar(150) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `is_billed` tinyint(3) UNSIGNED NOT NULL DEFAULT '0',
  `review` text COLLATE utf8mb4_unicode_ci,
  `status` tinyint(3) UNSIGNED NOT NULL DEFAULT '1',
  `patwari_user_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `cropsurveys`
--

INSERT INTO `cropsurveys` (`crop_survey_id`, `khasra_number`, `tenant_name`, `registration_date`, `cultivators_info`, `snowing_date`, `land_assessment_marla`, `land_assessment_kanal`, `previous_crop`, `date`, `width`, `length`, `area_marla`, `area_kanal`, `double_crop_marla`, `double_crop_kanal`, `identifable_area_marla`, `identifable_area_kanal`, `irrigated_area_marla`, `irrigated_area_kanal`, `land_quality`, `irrigator_khata_number`, `village_id`, `irrigator_id`, `canal_id`, `minor_id`, `distri_id`, `branch_id`, `crop_id`, `outlet_id`, `created_at`, `updated_at`, `session_date`, `finalcrop_id`, `crop_price`, `is_billed`, `review`, `status`, `patwari_user_id`) VALUES
(1, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 52', '2024-12-02', '0', '03', 'Baghicha (باغیچہ)', '2025-02-03', '6', '10', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 12:27:22', '2025-07-03 23:34:34', '2024-25', 10, '50', 1, 'b', 3, 0),
(5, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 52', '2024-12-02', '06', '06', 'چمن پھلواڑی', '2025-02-03', '10', '12', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 12:51:23', '2025-07-03 23:34:34', '2024-25', 14, '50', 1, 'b', 3, 0),
(6, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 53-A', '2024-12-02', '0', '01', 'چمن پھلواڑی', '2025-02-03', '3', '10', 10, 1, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 12:56:39', '2025-07-03 23:34:34', '2024-25', 14, '50', 1, 'g', 3, 0),
(7, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 53-B', '2024-12-02', '0', '01', 'چمن پھلواڑی', '2025-02-03', '04', '05', 0, 1, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 12:58:19', '2025-07-03 23:34:34', '2024-25', 14, '50', 1, 'b', 3, 0),
(8, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'Officer Mess', '2024-12-02', '09', '09', 'چمن پھلواڑی', '2025-02-03', '12', '15', 0, 9, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:00:54', '2025-07-04 00:45:49', '2024-25', 14, '50', 1, 'b', 3, 0),
(9, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 27', '2024-12-02', '0', '06', 'Baghicha (باغیچہ)', '2025-02-03', '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:03:39', '2025-07-03 23:34:34', '2024-25', 10, '50', 1, 'b', 3, 0),
(10, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 27', '2024-02-02', '0', '06', 'چمن پھلواڑی', '2025-02-03', '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:05:43', '2025-07-03 23:34:34', '2024-25', 14, '50', 1, 'b', 3, 0),
(11, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 29', '2024-12-02', '0', '04', 'چمن پھلواڑی', '2025-02-03', '05', '16', 0, 4, '04', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:09:42', '2025-07-03 23:34:34', '2024-25', 14, '50', 1, 'b', 3, 0),
(12, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 29', '2024-12-02', '08', '08', 'Baghicha (باغیچہ)', '2025-02-03', '8', '20', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:11:40', '2025-07-04 00:49:14', '2024-25', 10, '50', 1, 'b', 3, 0),
(13, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 41', '2024-12-02', '0', '06', 'چمن پھلواڑی', '2025-02-03', '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:14:27', '2025-07-03 23:34:34', '2024-25', 14, '50', 1, 'b', 3, 0),
(14, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 42', '2024-12-02', '06', '06', 'چمن پھلواڑی', '2025-02-03', '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:16:13', '2025-07-03 23:34:34', '2024-25', 14, '50', 1, 'b', 3, 0),
(15, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 43', '2024-12-02', '0', '03', 'Baghicha (باغیچہ)', '2025-02-03', '5', '012', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:18:25', '2025-07-03 23:34:34', '2024-25', 10, '50', 1, 'b', 3, 0),
(16, '146/147', 'Admin Officer PAF risalpur', '2024-12-02', 'House No 43', '2024-12-02', '05', '05', 'چمن پھلواڑی', '2025-02-03', '10', '10', 0, 5, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, NULL, NULL, NULL, 1, 11, '2025-07-03 13:20:08', '2025-07-04 00:46:22', '2024-25', 14, '50', 1, 'b', 3, 0),
(17, '153-157', 'mushtaq', '2025-03-12', 'mushtaq', '2025-02-02', '0', '0', 'Darakhtaan (درختان)', NULL, '20', '9', 0, 9, '0', '0', '0', '0', '0', '0', 'N/A', '1', 19, 195, 1, 3, NULL, NULL, 1, 96, '2025-07-03 23:57:29', '2025-07-03 23:57:29', '2024-25', 8, '50', 0, 'Survey Added', 0, 0),
(18, '1471', 'A', '2025-10-10', 'Abdur', '2025-07-04', '0', '0', 'Shaftal (شفتل)', NULL, '5', '14', 10, 3, '0', '0', '0', '0', '0', '0', 'N/A', '1', 14, 14, 1, 3, 8, 2, 1, 37, '2025-07-04 00:13:19', '2025-07-04 00:13:19', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(19, '1-2', 'Rasool Shah Bacha', '2025-07-04', 'Rasool Shah Bacha', '2025-07-04', '0', '0', 'Darakhtaan (درختان)', NULL, '1', '20', 0, 1, '0', '0', '0', '0', '0', '0', 'N/A', '1', 56, 284, 1, 3, NULL, NULL, 1, 14, '2025-07-04 00:38:35', '2025-07-04 00:47:17', '2024-25', 8, '50', 1, 'g', 3, 0),
(20, '2', 'Rasool Shah Bacha', '2025-07-04', 'Rasool Shah Bacha', '2025-07-04', '0', '0', 'Wheat (گندم)', NULL, '10', '16', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '1', 56, 284, 1, 3, NULL, NULL, 1, 14, '2025-07-04 00:42:59', '2025-07-04 00:47:17', '2024-25', 4, '50', 1, 'v', 3, 0),
(21, '146/147', 'Admin Officer PAF Risalpur', '2024-12-02', 'Admin Officer PAF Risalpur', '2025-07-04', '4', '0', 'چمن پھلواڑی', '2025-02-03', '1', '4', 4, 0, '0', '0', '0', '0', '0', '0', 'N/A', '1', 5, 92, 1, 2, 6, NULL, 1, 11, '2025-07-04 00:55:22', '2025-07-04 00:55:22', '2024-25', 14, '50', 1, 'Survey Added', 3, 0),
(22, '14-18', 'Murad s/o Juma GUl', '2025-07-04', 'Murad s/o Juma GUl', '2025-07-04', '0', '0', 'Wheat (گندم)', NULL, '12', '10', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '1', 53, 286, 1, 3, NULL, NULL, 1, 98, '2025-07-04 01:10:56', '2025-07-04 01:34:09', '2024-25', 4, '50', 1, 'b', 3, 0),
(23, '14-18', 'Murad s/o Juma GUl', '2025-07-04', 'Murad s/o Juma GUl', '2025-07-04', '0', '0', 'Shaftal (شفتل)', NULL, '10', '8', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '1', 53, 286, 1, 3, NULL, NULL, 1, 98, '2025-07-04 01:16:11', '2025-07-04 01:34:09', '2024-25', 5, '50', 1, 'b', 3, 0),
(24, '14-18', 'Murad s/o Juma GUl', '2025-07-04', 'Murad s/o Juma GUl', '2025-07-04', '0', '0', 'Shaftal (شفتل)', NULL, '10', '8', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '1', 53, 286, 1, 3, NULL, NULL, 1, 98, '2025-07-04 01:16:12', '2025-07-04 01:34:09', '2024-25', 5, '50', 1, 'n', 3, 0),
(25, '1418', 'Murad s/o Juma GUl', '2025-07-04', 'Murad s/o Juma GUl', '2025-07-04', '0', '0', 'Shaftal (شفتل)', NULL, '015', '8', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '1', 53, 286, 1, 3, NULL, NULL, 1, 98, '2025-07-04 01:28:04', '2025-07-04 01:34:09', '2024-25', 5, '50', 1, 'b', 3, 0),
(26, '181/297', 'Malak Akhaz', '2025-07-04', 'Malak Akhaz', '2024-10-05', '400', '20', 'Wheat (گندم)', '2025-03-03', '20', '20', 0, 20, '0', '0', '400', '20', '400', '20', 'N/A', '3', 41, 287, 1, 3, 8, 3, 1, 15, '2025-07-04 01:54:04', '2025-07-04 02:38:04', '2024-25', 4, '50', 1, 'b', 3, 0),
(27, '12', 'government degree college mardan', '2025-07-04', 'government degree college mardan', '2025-07-04', '0', '0', 'چمن پھلواڑی', NULL, '20', '16', 0, 16, '0', '0', '0', '0', '0', '0', 'N/A', '1', 21, 288, 1, NULL, NULL, NULL, 1, 68, '2025-07-04 02:00:04', '2025-07-04 02:06:02', '2024-25', 14, '50', 1, 'b', 3, 0),
(28, '181/297', 'Malak Akhaz', '2025-07-04', 'Malak Akhaz', '2024-11-02', '700', '35', 'Baghicha (باغیچہ)', '2025-03-14', '20', '35', 0, 35, '0', '0', '700', '35', '700', '35', 'N/A', '3', 41, 287, 1, 3, 8, 3, 1, 15, '2025-07-04 02:09:39', '2025-07-04 02:38:04', '2024-25', 10, '50', 1, 'v', 3, 0),
(29, '181/297', 'Malak Akhaz', '2025-07-04', 'Malak Akhaz', '2024-10-05', '40', '2', 'Shaftal (شفتل)', '2025-03-14', '5', '8', 0, 2, '0', '0', '0', '0', '40', '2', 'N/A', '3', 41, 287, 1, 3, 8, 3, 1, 15, '2025-07-04 02:13:37', '2025-07-04 02:38:04', '2024-25', 5, '50', 1, 'v', 3, 0),
(30, '181/297', 'Malak Akhaz', '2025-07-04', 'Malak Akhaz', '2024-11-07', '260', '13', 'Wheat (گندم)', '2025-03-14', '13', '20', 0, 13, '0', '0', '0', '0', '0', '0', 'N/A', '3', 41, 287, 1, 3, 8, 3, 1, 15, '2025-07-04 02:16:39', '2025-07-04 02:38:04', '2024-25', 4, '50', 1, 'v', 3, 0),
(31, '181/297', 'Malak Akhaz', '2025-07-04', 'Malak Akhaz', '2024-11-02', '60', '3', 'Wheat (گندم)', '2025-03-14', '4', '15', 0, 3, '0', '0', '0', '0', '0', '3', 'N/A', '3', 41, 287, 1, 3, 8, 3, 1, 15, '2025-07-04 02:31:14', '2025-07-04 02:38:04', '2024-25', 4, '50', 1, 'b', 3, 0),
(32, '542-538-548', 'Izhar Ali khan', '2025-07-04', 'Izhar Ali Khan', '2025-07-04', '0', '0', 'Shaftal (شفتل)', NULL, '4', '15', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '1', 58, 289, 1, 3, 8, NULL, 1, 21, '2025-07-04 02:35:53', '2025-07-04 02:35:53', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(33, '538', 'Izhar Ali Khan', '2025-07-04', 'Izhar Ali Khan', '2025-07-04', '0', '0', 'Wheat (گندم)', '2025-06-18', '10', '43', 10, 21, '0', '0', '0', '0', '0', '0', 'N/A', '1', 58, 289, 1, 3, 8, NULL, 1, 21, '2025-07-04 02:47:01', '2025-07-04 02:47:01', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(34, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-05-14', '0', '0', 'Wheat (گندم)', NULL, '023', '020', 0, 23, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:00:56', '2025-07-04 05:03:24', '2024-25', 4, '50', 1, 'g', 3, 0),
(35, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Shaftal (شفتل)', NULL, '08', '10', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:04:58', '2025-07-04 05:03:24', '2024-25', 5, '50', 1, 'b', 3, 0),
(36, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Joi (جوئی)', NULL, '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:10:09', '2025-07-04 05:03:24', '2024-25', 12, '50', 1, 'g', 3, 0),
(37, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Joi (جوئی)', NULL, '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:10:09', '2025-07-04 05:03:24', '2024-25', 12, '50', 1, 'g', 3, 0),
(38, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Joi (جوئی)', NULL, '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:10:10', '2025-07-04 05:03:24', '2024-25', 12, '50', 1, 'g', 3, 0),
(39, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Joi (جوئی)', NULL, '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:10:16', '2025-07-04 05:03:24', '2024-25', 12, '50', 1, 'g', 3, 0),
(40, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Joi (جوئی)', NULL, '010', '012', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:10:17', '2025-07-04 05:03:24', '2024-25', 12, '50', 1, 'g', 3, 0),
(41, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Darakhtaan (درختان)', NULL, '0', '0', 0, 0, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:23:20', '2025-07-04 05:03:24', '2024-25', 8, '50', 1, 'g', 3, 0),
(42, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Wheat (گندم)', NULL, '08', '0208', 4, 83, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:29:08', '2025-07-04 05:03:24', '2024-25', 4, '50', 1, 'g', 3, 0),
(43, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Sarshaf (سرشَف)', NULL, '010', '016', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:43:49', '2025-07-04 05:03:24', '2024-25', 16, '75', 1, 'g', 3, 0),
(44, '1948-1963', 'Sabz Ali', '2025-07-04', 'Sabz Ali', '2025-07-04', '0', '0', 'Sarshaf (سرشَف)', NULL, '010', '016', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '2', 22, 293, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:43:50', '2025-07-04 05:00:58', '2024-25', 16, '75', 0, 'g', 2, 0),
(45, '1964-1965', 'muhammad azam', '2025-07-04', 'muhammad azam', '2025-07-04', '0', '0', 'Shaftal (شفتل)', NULL, '05', '012', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '8', 22, 294, 1, 3, 7, NULL, 1, 60, '2025-07-04 04:48:39', '2025-07-04 04:57:39', '2024-25', 5, '50', 0, 'Forwarded by Patwari', 1, 0),
(46, '1148', 'Abdul wakeel', '2025-01-01', 'Abdul wakeel', '2025-07-04', '10', '3', 'Mart Grass (مارٹ گھاس)', '2025-03-16', '7', '10', 10, 3, '0', '0', '0', '0', '0', '0', 'N/A', '1', 47, 307, 1, 2, NULL, NULL, 1, 164, '2025-07-04 05:35:17', '2025-07-04 05:35:17', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(47, '1964-1965', 'Aman Ullah', '2025-07-04', 'Aman Ullah', '2025-07-04', '2', '2', 'Wheat (گندم)', '2025-05-02', '4', '20', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '1', 22, 194, 1, 3, 7, NULL, 1, 60, '2025-07-04 05:36:52', '2025-07-04 05:40:57', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(48, '1964-1965', 'Aman Ullah', '2025-07-04', 'Aman Ullah', '2025-07-04', '0', '2', 'Shaftal (شفتل)', '2025-05-02', '04', '020', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '1', 22, 194, 1, 3, 7, NULL, 1, 60, '2025-07-04 05:37:10', '2025-07-04 05:37:10', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(49, '1966', 'janzeb khan', '2025-07-04', 'janzeb khan', '2025-07-04', '0', '0', 'Wheat (گندم)', NULL, '016', '020', 0, 16, '0', '0', '0', '0', '0', '0', 'N/A', '5', 22, 309, 1, 3, 7, NULL, 1, 60, '2025-07-04 05:52:59', '2025-07-04 05:52:59', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(50, '31/34', 'Mir afzal', '2025-07-04', 'Mir afzal', '2024-10-21', '40', '2', 'Wheat (گندم)', '2025-02-06', '5', '8', 0, 2, '0', '0', '0', '0', '0', '2', 'N/A', '164', 60, 295, 1, 2, NULL, NULL, 1, 181, '2025-07-04 06:14:16', '2025-07-04 06:16:58', '2024-25', 4, '50', 1, '1', 3, 0),
(51, '373', 'بخار خان', '2024-12-18', 'نواب ولد پھلیل', '2024-12-18', '0', '10', 'Maize (مکئی)', '2024-02-14', '10', '20', 0, 10, '0', '0', '0', '0', '0', '0', 'N/A', '40', 6, 367, 1, 2, NULL, NULL, 1, 10, '2025-07-05 03:16:13', '2025-07-05 03:16:13', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(52, '1966', 'wazeer muhammad', '2025-07-05', 'wazeer muhammad', '2025-07-05', '0', '0', 'Shaftal (شفتل)', '2025-05-02', '04', '015', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '6', 22, 413, 1, 3, 7, NULL, 1, 60, '2025-07-05 03:58:33', '2025-07-05 03:58:33', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(54, '1966', 'ameer muhammad', '2025-07-05', 'ameer muhammad', '2025-07-05', '0', '0', 'Wheat (گندم)', '2025-05-02', '010', '018', 0, 9, '0', '0', '0', '0', '0', '0', 'N/A', '7', 22, 416, 1, 3, 7, NULL, 1, 60, '2025-07-05 05:42:53', '2025-07-05 05:42:53', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(55, '1966', 'ameer muhammad', '2025-07-05', 'ameer muhammad', '2025-07-05', '0', '0', 'Shaftal (شفتل)', '2025-05-02', '09', '010', 10, 4, '0', '0', '0', '0', '0', '0', 'N/A', '7', 22, 416, 1, 3, 7, NULL, 1, 60, '2025-07-05 05:45:30', '2025-07-05 05:45:30', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(56, '1967', 'Aman Ullah', '2025-05-02', 'Aman Ullah', '2025-05-02', '0', '0', 'Wheat (گندم)', '2025-05-02', '010', '044', 0, 22, '0', '0', '0', '0', '0', '0', 'N/A', '1', 22, 194, 1, 3, 7, NULL, 1, 60, '2025-07-05 06:01:40', '2025-07-05 06:01:40', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(57, '1967', 'Aman Ullah', '2025-05-02', 'Aman Ullah', '2025-05-02', '0', '0', 'Joi (جوئی)', '2025-05-02', '010', '020', 0, 10, '0', '0', '0', '0', '0', '0', 'N/A', '1', 22, 194, 1, 3, 7, NULL, 1, 60, '2025-07-05 06:06:06', '2025-07-05 06:06:06', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(58, '1967', 'Aman Ullah', '2025-05-02', 'Aman Ullah', '2025-05-02', '0', '0', 'Sarshaf (سرشَف)', '2025-05-02', '010', '016', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '1', 22, 194, 1, 3, 7, NULL, 1, 60, '2025-07-05 06:08:15', '2025-07-05 06:08:15', '2024-25', 16, '75', 0, 'Survey Added', 0, 0),
(59, '1261/1 - 1263', 'Muhammad Ali Khan', '2024-01-06', 'Muhammad Ali Khan', '2024-10-05', '2', '2', 'Chari (چری)', '2025-02-07', '05', '08', 0, 2, '0', '0', '0', '0', '0', '0', 'N/A', '1', 4, 2, 1, 2, 4, 1, 1, 9, '2025-07-05 10:51:28', '2025-07-06 02:57:50', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(60, '1261/1 - 1263', 'Muhammad Ali Khan', '2024-01-06', 'Muhammad Ali Khan', '2024-11-04', '0', '034', 'Maize (مکئی)', '2025-02-07', '08', '085', 0, 34, '0', '0', '0', '0', '0', '0', 'N/A', '1', 4, 2, 1, 2, 4, 1, 1, 9, '2025-07-05 10:54:39', '2025-07-05 10:54:39', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(61, '1264,1265', 'Sher Ali Khan', '2024-01-06', 'Mir Bahadar', '2024-01-06', '02', '02', 'Chari (چری)', '2025-02-07', '5', '08', 0, 2, '0', '0', '0', '0', '0', '0', 'N/A', '2', 4, 3, 1, 2, 4, 1, 1, 9, '2025-07-06 02:29:17', '2025-07-06 02:59:42', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(62, '1264,1265', 'Sher Ali Khan', '2024-01-06', 'Mir Bahadar', '2024-11-05', '0', '022', 'Maize (مکئی)', '2025-02-07', '08', '055', 0, 22, '0', '0', '0', '0', '0', '0', 'N/A', '2', 4, 3, 1, 2, 4, 1, 1, 9, '2025-07-06 02:32:30', '2025-07-06 02:32:30', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(63, '1264,1265', 'Sher Ali Khan', '2024-01-06', 'Sher Bahadar', '2024-11-05', '0', '04', 'Maize (مکئی)', '2025-02-07', '08', '010', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '2', 4, 3, 1, 2, 4, 1, 1, 9, '2025-07-06 02:34:41', '2025-07-06 02:34:41', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(64, '1266,1266/1', 'Mushraff Khan', '2024-01-06', 'Fazal Rahman', '2024-10-10', '0', '02', 'Maize (مکئی)', '2025-02-07', '08', '070', 0, 28, '0', '0', '0', '0', '0', '0', 'N/A', '3', 4, 4, 1, 2, 4, 1, 1, 9, '2025-07-06 02:40:41', '2025-07-06 02:40:41', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(65, '1266,1266/1', 'Mushraff Khan', '2024-01-06', 'Mushraff Khan', '2024-10-05', '0', '02', 'Chari (چری)', '2025-02-07', '08', '010', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '3', 4, 4, 1, 2, 4, 1, 1, 9, '2025-07-06 03:02:39', '2025-07-06 03:02:39', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(66, '1276', 'Aurangzeb', '2024-01-06', 'Zarin S/O Shamroz', '2024-11-10', '0', '08', 'Maize (مکئی)', '2025-02-07', '05', '032', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '5', 4, 6, 1, 2, 4, 1, 1, 9, '2025-07-06 03:08:03', '2025-07-06 03:08:03', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(67, '1268', 'Aurangzeb', '2024-01-06', 'Zarin S/O Shamroz', '2024-10-10', '0', '02', 'Chari (چری)', '2025-02-07', '05', '08', 0, 2, '0', '0', '0', '0', '0', '0', 'N/A', '5', 4, 6, 1, 2, 4, 1, 1, 9, '2025-07-06 03:10:30', '2025-07-06 03:10:30', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(68, '1273', 'Aurangzeb', '2024-01-06', 'Zarin S/O Shamroz', '2024-10-10', '0', '03', 'Chari (چری)', NULL, '04', '015', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '5', 4, 6, 1, 2, 4, 1, 1, 9, '2025-07-06 03:12:34', '2025-07-06 03:12:34', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(69, '1273', 'Aurangzeb', '2024-01-06', 'Zarin S/O Shamroz', '2024-11-10', '0', '07', 'Maize (مکئی)', '2025-02-07', '04', '035', 0, 7, '0', '0', '0', '0', '0', '0', 'N/A', '5', 4, 6, 1, 2, 4, 1, 1, 9, '2025-07-06 03:14:33', '2025-07-06 03:14:33', '2024-25', 1, '50', 0, 'Survey Added', 0, 0),
(70, '1268', 'Amjid Ali', '2024-01-06', 'Amjid Ali', '2024-11-05', '0', '03', 'Chari (چری)', '2025-02-07', '05', '012', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '7', 4, 9, 1, 2, 4, 1, 1, 9, '2025-07-06 04:12:22', '2025-07-06 04:12:22', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(71, '1268', 'Gohar Ali', '2024-01-06', 'Gohar Ali', '2024-11-05', '0', '03', 'Chari (چری)', '2025-02-07', '05', '012', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '6', 4, 8, 1, 2, 4, 1, 1, 9, '2025-07-06 04:19:33', '2025-07-06 04:19:33', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(72, '1268', 'Almas', '2024-01-06', 'Almas', '2024-11-05', '0', '03', 'Chari (چری)', '2025-02-07', '05', '012', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '8', 4, 10, 1, 2, 4, 1, 1, 9, '2025-07-06 04:22:28', '2025-07-06 04:22:28', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(73, '1268', 'Inayat Ur Rahman', '2024-01-06', 'Inayat Ur Rahman', '2024-11-05', '0', '03', 'Jinjin جنجن', '2025-02-07', '05', '012', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '9', 4, 11, 1, 2, 4, 1, 1, 9, '2025-07-06 04:26:40', '2025-07-06 04:26:40', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(74, '1268', 'Inayat Ur Rahman', '2024-01-06', 'Inayat Ur Rahman', '2024-11-05', '0', '03', 'Jinjin جنجن', '2025-02-07', '05', '012', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '9', 4, 11, 1, 2, 4, 1, 1, 9, '2025-07-06 04:28:36', '2025-07-06 04:28:36', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(75, '1268', 'Musmat Mushtari Hasmat ali', '2024-01-06', 'Hasmat ali', '2024-11-05', '0', '03', 'Jinjin جنجن', '2025-02-07', '05', '012', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '11', 4, 13, 1, 2, 4, 1, 1, 9, '2025-07-06 04:31:12', '2025-07-06 04:31:12', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(76, '1268', 'Shah Nazar', '2024-01-06', 'Shah Nazar', '2024-11-05', '0', '09', 'Chari (چری)', '2025-02-07', '05', '036', 0, 9, '0', '0', '0', '0', '0', '0', 'N/A', '12', 4, 94, 1, 2, 4, 1, 1, 9, '2025-07-06 04:38:00', '2025-07-06 04:38:00', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(77, '342', 'عمر', '2024-12-18', 'عمر', '2024-11-05', '0', '03', 'Jinjin جنجن', '2025-02-13', '06', '010', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '۱', 6, 318, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:06:47', '2025-07-06 05:06:47', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(78, '343', 'امین خان', '2024-12-18', 'امین خان', '2024-10-05', '0', '02', 'Jinjin جنجن', '2025-02-13', '40', '010', 0, 20, '0', '0', '0', '0', '0', '0', 'N/A', '2', 6, 319, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:11:38', '2025-07-06 05:11:38', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(79, '343', 'Janus', '2024-12-18', 'Janus', '2024-11-05', '0', '3', 'Jinjin جنجن', '2025-02-13', '6', '10', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '3', 6, 320, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:14:34', '2025-07-06 05:14:34', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(80, '343', 'Tilawat', '2024-12-18', 'Tilawat', '2024-10-05', '010', '01', 'Jinjin جنجن', '2025-02-13', '3', '10', 10, 1, '0', '0', '0', '0', '0', '0', 'N/A', '4', 6, 322, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:17:26', '2025-07-06 05:17:26', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(81, '343', 'Ubaid Khan', '2024-12-18', 'Ubaid Khan', '2024-11-05', '0', '1', 'Jinjin جنجن', '2025-02-13', '2', '10', 0, 1, '0', '0', '0', '0', '0', '0', 'N/A', '5', 6, 324, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:19:48', '2025-07-06 05:19:48', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(82, '340', 'Saleem', '2024-12-18', 'Saleem', '2024-10-05', '0', '01', 'Jinjin جنجن', '2025-02-13', '2', '10', 0, 1, '0', '0', '0', '0', '0', '0', 'N/A', '6', 6, 325, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:22:26', '2025-07-06 05:22:26', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(83, '340', 'Saleem', '2024-12-18', 'Saleem', '2024-11-05', '0', '4', 'Jinjin جنجن', '2025-02-13', '8', '10', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '6', 6, 325, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:26:16', '2025-07-06 05:26:16', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(84, '340', 'Safdar', '2024-12-18', 'Safdar', '2024-11-05', '0', '3', 'Jinjin جنجن', '2025-02-13', '4', '10', 0, 2, '0', '0', '0', '0', '0', '0', 'N/A', '8', 6, 328, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:28:58', '2025-07-06 05:28:58', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(85, '340', 'Hunar', '2024-12-18', 'Hunar', '2024-10-05', '0', '2', 'Jinjin جنجن', '2025-02-13', '4', '10', 0, 2, '0', '0', '0', '0', '0', '0', 'N/A', '9', 6, 329, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:31:04', '2025-07-06 05:31:04', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(86, '340', 'Hunar', '2024-12-18', 'Hunar', '2024-11-05', '0', '018', 'Maize (مکئی)', '2025-02-13', '10', '36', 0, 18, '0', '0', '0', '0', '0', '0', 'N/A', '9', 6, 329, 1, 2, 4, NULL, 1, 10, '2025-07-06 05:32:56', '2025-07-06 05:32:56', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(87, '1-10', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '10', '35', 'Chari (چری)', '2025-02-20', '10', '071', 10, 35, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 08:40:55', '2025-07-06 08:40:55', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(88, '1-10', 'Manager Military Farm Nowshera', '2024-12-31', 'Manager Military Farm Nowshera', '2024-10-10', '10', '106', 'Chari (چری)', '2025-02-20', '10', '213', 10, 106, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 08:44:55', '2025-07-06 08:44:55', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(89, '1-10', 'Manager Military Farm Nowshera', '2024-12-31', 'Manager Military Farm Nowshera', '2024-10-10', '10', '62', 'Chari (چری)', '2025-02-20', '10', '125', 10, 62, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 08:48:04', '2025-07-06 08:48:04', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(90, '1-10', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '0', '56', 'Chari (چری)', '2024-02-20', '20', '56', 0, 56, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 08:50:31', '2025-07-06 08:50:31', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(91, '1-10', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '010', '095', 'Chari (چری)', '2025-02-20', '10', '191', 10, 95, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 08:56:28', '2025-07-06 08:56:28', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(92, '1-10', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '10', '87', 'Chari (چری)', '2025-02-20', '10', '175', 10, 87, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 09:00:20', '2025-07-06 09:00:20', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(93, '1-10', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '0', '39', 'Chari (چری)', '2025-02-20', '5', '156', 0, 39, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 09:03:18', '2025-07-06 09:03:18', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(94, '1-10', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '0', '090', 'Chari (چری)', '2025-02-20', '20', '90', 0, 90, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 09:05:25', '2025-07-06 09:05:25', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(95, '1-10', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '010', '076', 'Chari (چری)', '2025-02-20', '10', '153', 10, 76, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 09:07:12', '2025-07-06 09:07:12', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(96, '20,24', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-12', '10', '56', 'Chari (چری)', '2025-02-20', '10', '113', 10, 56, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 09:12:42', '2025-07-06 09:12:42', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(97, '25', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '10', '134', 'Chari (چری)', '2025-02-21', '10', '269', 10, 134, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 09:16:11', '2025-07-06 09:16:11', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(98, '25', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-20', '10', '134', 'Chari (چری)', '2025-02-21', '10', '269', 10, 134, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 09:18:54', '2025-07-06 09:18:54', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(99, '26', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-10', '10', '117', 'Chari (چری)', '2025-02-21', '10', '235', 10, 117, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 09:20:57', '2025-07-06 09:20:57', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(100, '46-49', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-20', '0', '96', 'Chari (چری)', '2025-02-21', '10', '192', 0, 96, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:00:23', '2025-07-06 10:00:23', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(101, '46-49', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-15', '10', '128', 'Chari (چری)', '2025-02-21', '10', '257', 10, 128, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:03:29', '2025-07-06 10:03:29', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(102, '46-49', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-15', '0', '150', 'Chari (چری)', '2025-02-21', '50', '60', 0, 150, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:05:54', '2025-07-06 10:05:54', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(103, '53,99', 'Manager Military Farm Nowshera', '2024-12-03', 'Manager Military Farm Nowshera', '2024-10-15', '10', '112', 'Chari (چری)', '2025-02-21', '20', '112.5', 10, 112, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:09:05', '2025-07-06 10:09:05', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(104, '53,99', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-12-04', '0', '6', 'Darakhtaan (درختان)', '2025-02-21', '10', '12', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:11:46', '2025-07-06 10:11:46', '2024-25', 8, '50', 0, 'Survey Added', 0, 0),
(105, '53,99', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-10-15', '10', '74', 'Chari (چری)', '2025-02-21', '10', '149', 10, 74, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:14:47', '2025-07-06 10:14:47', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(106, '53,99', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-10-10', '0', '121', 'Maize (مکئی)', '2025-02-21', '10', '242', 0, 121, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:17:31', '2025-07-06 10:17:31', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(107, '53,99', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-10-02', '10', '57', 'Maize (مکئی)', '2025-02-21', '10', '115', 10, 57, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:19:54', '2025-07-06 10:19:54', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(108, '53,99', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-10-15', '10', '30', 'Maize (مکئی)', '2025-02-21', '20', '30.5', 10, 30, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:22:55', '2025-07-06 10:26:17', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(109, '53,99', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-10-20', '0', '142', 'Maize (مکئی)', '2024-02-21', '20', '142', 0, 142, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:29:51', '2025-07-06 10:29:51', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(110, '53,99', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-12-04', '0', '5', 'Darakhtaan (درختان)', '2025-02-21', '5', '20', 0, 5, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:31:44', '2025-07-06 10:31:44', '2024-25', 8, '50', 0, 'Survey Added', 0, 0),
(111, '34', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-10-15', '0', '222', 'Chari (چری)', '2025-02-21', '40', '111', 0, 222, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:33:53', '2025-07-06 10:33:53', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(112, '32', 'Manager Military Farm Nowshera', '2024-12-04', 'Manager Military Farm Nowshera', '2024-10-15', '0', '69', 'Maize (مکئی)', '2025-02-21', '20', '69', 0, 69, '0', '0', '0', '0', '0', '0', 'N/A', '1', 8, 91, 1, 2, 6, NULL, 1, 12, '2025-07-06 10:35:26', '2025-07-06 10:35:26', '2024-25', 12, '50', 0, 'Survey Added', 0, 0),
(113, '1970', 'janzeb khan', '2025-05-02', 'janzeb khan', '2025-05-02', '0', '0', 'Darakhtaan (درختان)', '2025-05-02', '010', '044', 0, 22, '0', '0', '0', '0', '0', '0', 'N/A', '5', 22, 309, 1, 3, 7, NULL, 1, 60, '2025-07-07 08:03:43', '2025-07-07 08:03:43', '2024-25', 8, '50', 0, 'Survey Added', 0, 0),
(114, '1970', 'janzeb khan', '2025-05-02', 'janzeb khan', '2025-05-02', '0', '0', 'Wheat (گندم)', NULL, '015', '040', 0, 30, '0', '0', '0', '0', '0', '0', 'N/A', '5', 22, 309, 1, 3, 7, NULL, 1, 60, '2025-07-07 08:06:04', '2025-07-07 08:06:04', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(115, '1970', 'janzeb khan', '2025-05-02', 'janzeb khan', '2025-05-02', '0', '0', 'Wheat (گندم)', NULL, '014', '025', 10, 17, '0', '0', '0', '0', '0', '0', 'N/A', '5', 22, 309, 1, 3, 7, NULL, 1, 60, '2025-07-07 08:07:54', '2025-07-07 08:07:54', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(116, '1970', 'janzeb khan', '2025-05-02', 'janzeb khan', '2025-05-02', '0', '0', 'Shaftal (شفتل)', NULL, '010', '022', 0, 11, '0', '0', '0', '0', '0', '0', 'N/A', '5', 22, 309, 1, 3, 7, NULL, 1, 60, '2025-07-07 08:10:04', '2025-07-07 08:10:04', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(117, '1970', 'shahid khan', '2025-05-02', 'shahid khan', '2025-05-02', '0', '0', 'Wheat (گندم)', '2025-05-02', '026', '020', 0, 26, '0', '0', '0', '0', '0', '0', 'N/A', '8', 22, 694, 1, 3, 7, NULL, 1, 60, '2025-07-07 09:10:06', '2025-07-07 09:10:06', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(118, '1970', 'shahid khan', '2025-05-02', 'shahid khan', '2025-05-02', '0', '0', 'Shaftal (شفتل)', '2025-05-02', '013', '020', 0, 13, '0', '0', '0', '0', '0', '0', 'N/A', '8', 22, 694, 1, 3, 7, NULL, 1, 60, '2025-07-07 09:11:52', '2025-07-07 09:11:52', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(119, '1973', 'ALI AFSAR', '2025-05-02', 'ALI AFSAR', '2025-05-02', '0', '0', 'Shaftal (شفتل)', '2025-05-02', '03', '010', 10, 1, '0', '0', '0', '0', '0', '0', 'N/A', '9', 22, 712, 1, 3, 7, NULL, 1, 60, '2025-07-07 09:28:22', '2025-07-07 09:28:22', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(120, '1973', 'israrudin', '2025-05-02', 'israrudin', '2025-05-02', '0', '0', 'Wheat (گندم)', '2025-05-02', '10', '18', 0, 9, '0', '0', '0', '0', '0', '0', 'N/A', '11', 22, 714, 1, 3, 7, NULL, 1, 60, '2025-07-07 09:46:23', '2025-07-07 09:46:23', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(121, '340', 'Muzafar', '2024-12-18', 'Muzafar', '2024-10-10', '0', '1', 'Chari (چری)', '2025-02-13', '2', '10', 0, 1, '0', '0', '0', '0', '0', '0', 'N/A', '10', 6, 330, 1, 2, 4, NULL, 1, 10, '2025-07-08 01:54:03', '2025-07-08 01:54:03', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(122, '340', 'Amir Zada', '2024-12-18', 'Amir Zada', '2024-11-10', '0', '4', 'Maize (مکئی)', '2025-02-13', '8', '10', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '11', 6, 332, 1, 2, 4, NULL, 1, 10, '2025-07-08 01:56:01', '2025-07-08 01:56:01', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(123, '339', 'Irfan', '2024-12-18', 'Amir Zada S/O Wahid Gul', '2024-11-15', '13', '13', 'Maize (مکئی)', '2025-02-13', '5', '52', 0, 13, '0', '0', '0', '0', '0', '0', 'N/A', '12', 6, 334, 1, 2, 4, NULL, 1, 10, '2025-07-08 01:59:37', '2025-07-08 02:15:30', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(124, '349', 'Amir Zada', '2024-12-18', 'Amir Zada', '2024-11-10', '0', '4', 'Maize (مکئی)', '2025-02-13', '8', '10', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '11', 6, 332, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:03:34', '2025-07-08 02:03:34', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(125, '350', 'Amir Zada', '2024-12-18', 'Amir Zada', '2024-11-10', '0', '08', 'Maize (مکئی)', '2025-02-13', '10', '16', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '11', 6, 332, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:05:10', '2025-07-08 02:05:10', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(126, '14', 'Amir Zada', '2024-12-18', 'Amir Zada', '2024-11-10', '010', '4', 'Maize (مکئی)', '2025-02-13', '5', '18', 10, 4, '0', '0', '0', '0', '0', '0', 'N/A', '11', 6, 332, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:07:45', '2025-07-08 02:07:45', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(127, '18', 'Amir Zada', '2024-12-18', 'Amir Zada', '2024-11-10', '0', '6', 'Maize (مکئی)', '2025-02-13', '10', '12', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '11', 6, 332, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:09:18', '2025-07-08 02:09:18', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(128, '339', 'kamran', '2024-12-18', 'kamran', '2024-11-10', '0', '4', 'Maize (مکئی)', '2025-02-13', '8', '10', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '13', 6, 335, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:12:43', '2025-07-08 02:12:43', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(129, '374', 'ؓبشر خان', '2024-12-18', 'دیان خان', '2024-11-10', '0', '6', 'Maize (مکئی)', '2025-02-13', '10', '12', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '14', 6, 339, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:18:34', '2025-07-08 02:18:34', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(130, '374', 'Ibrar', '2024-12-18', 'Gul Akbar', '2024-11-05', '0', '8', 'Maize (مکئی)', '2025-02-13', '5', '32', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '15', 6, 341, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:20:56', '2025-07-08 02:20:56', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(131, '332', 'Imran S/o Khiyal Gul', '2024-12-18', 'Imran', '2024-11-15', '0', '18', 'Maize (مکئی)', '2025-02-13', '10', '36', 0, 18, '0', '0', '0', '0', '0', '0', 'N/A', '16', 6, 342, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:24:27', '2025-07-08 02:24:27', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(132, '346,347', 'Said Hassan Shah', '2024-12-18', 'Said Hassan Shah', '2024-10-05', '10', '3', 'Chari (چری)', '2025-02-13', '7', '10', 10, 3, '0', '0', '0', '0', '0', '0', 'N/A', '18', 6, 345, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:30:45', '2025-07-08 02:30:45', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(133, '346,347', 'Said Hassan Shah', '2024-12-18', 'Said Hassan Shah', '2024-11-05', '10', '3', 'Maize (مکئی)', '2025-02-13', '7', '10', 10, 3, '0', '0', '0', '0', '0', '0', 'N/A', '18', 6, 345, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:32:10', '2025-07-08 02:32:10', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(134, '346,347', 'Sabz Ali', '2024-12-18', 'zahid gul', '2024-10-12', '0', '1', 'Chari (چری)', '2025-02-13', '2', '10', 0, 1, '0', '0', '0', '0', '0', '0', 'N/A', '19', 6, 346, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:37:18', '2025-07-08 02:37:18', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(135, '346,347', 'Sabz Ali', '2024-12-18', 'zahid gul', '2024-11-10', '0', '4', 'Maize (مکئی)', '2025-02-13', '8', '10', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '19', 6, 346, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:38:54', '2025-07-08 02:38:54', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(136, '346,347', 'Mategh Ullah', '2024-12-18', 'zahir shah', '2024-11-10', '0', '10', 'Maize (مکئی)', '2025-02-13', '10', '20', 0, 10, '0', '0', '0', '0', '0', '0', 'N/A', '20', 6, 347, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:41:11', '2025-07-08 02:41:11', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(137, '346,347', 'Hayat Ullah', '2024-12-18', 'Hasham Khan', '2024-10-15', '0', '2', 'Chari (چری)', '2025-02-13', '4', '10', 0, 2, '0', '0', '0', '0', '0', '0', 'N/A', '21', 6, 348, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:44:21', '2025-07-08 02:44:21', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(138, '351,352', 'Hayat Ullah', '2024-12-18', 'Aman Gul', '2024-11-15', '0', '16', 'Maize (مکئی)', '2025-02-13', '8', '40', 0, 16, '0', '0', '0', '0', '0', '0', 'N/A', '21', 6, 348, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:47:11', '2025-07-08 02:47:11', '2024-25', 4, '50', 0, 'Survey Added', 0, 0),
(139, '351,352 ,355,357', 'Hayat Ullah', '2024-12-18', 'aman Gul', '2024-10-10', '0', '5', 'Chari (چری)', '2025-02-13', '10', '10', 0, 5, '0', '0', '0', '0', '0', '0', 'N/A', '21', 6, 348, 1, 2, 4, NULL, 1, 10, '2025-07-08 02:50:35', '2025-07-08 02:50:35', '2024-25', 5, '50', 0, 'Survey Added', 0, 0),
(142, '1084/1085', 'Fazal Rahman', '2025-01-01', 'Fazal Rahman', '2024-11-16', '0', '10', 'Wheat (گندم)', '2025-02-17', '10', '20', 0, 10, '0', '0', '0', '0', '0', '0', 'N/A', '1', 13, 160, 1, 1, NULL, NULL, 1, 240, '2025-07-09 00:36:26', '2025-07-09 00:36:26', '2024-25', 4, '50', 0, 'Survey Added', 0, 10),
(143, '1084/1085', 'Fazal Rahman', '2025-01-01', 'Fazal Rahman', '2024-11-16', '10', '2', 'Darakhtaan (درختان)', '2025-02-17', '5', '10', 10, 2, '0', '0', '0', '0', '0', '0', 'N/A', '1', 13, 160, 1, 1, NULL, NULL, 1, 240, '2025-07-09 00:39:02', '2025-07-09 00:39:02', '2024-25', 8, '50', 0, 'Survey Added', 0, 10),
(145, '1084/1085', 'Noor Rahman', '2025-01-01', 'Noor Rahman', '2024-11-16', '10', '2', 'Darakhtaan (درختان)', '2025-02-17', '5', '10', 10, 2, '0', '0', '0', '0', '0', '0', 'N/A', '2', 13, 161, 1, 1, NULL, NULL, 1, 240, '2025-07-09 00:42:00', '2025-07-09 00:42:00', '2024-25', 8, '50', 0, 'Survey Added', 0, 10),
(146, '1084/1085', 'Noor Rahman', '2025-01-01', 'Noor Rahman', '2024-11-16', '0', '4', 'Darakhtaan (درختان)', '2025-02-17', '5', '16', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '2', 13, 161, 1, 1, NULL, NULL, 1, 240, '2025-07-09 00:46:51', '2025-07-09 00:46:51', '2024-25', 8, '50', 0, 'Survey Added', 0, 10),
(147, '1084/1085', 'Noor Rahman', '2025-01-01', 'Noor Rahman', '2024-11-16', '12', '12', 'Wheat (گندم)', '2025-02-17', '12', '20', 0, 12, '0', '0', '0', '0', '0', '0', 'N/A', '2', 13, 161, 1, 1, NULL, NULL, 1, 240, '2025-07-09 00:50:51', '2025-07-09 02:15:43', '2024-25', 4, '50', 0, 'Survey Added', 0, 10),
(148, '1080', 'Khan Ghalib', '2025-01-01', 'Khan Ghalib', '2024-11-17', '0', '3', 'Wheat (گندم)', '2025-02-17', '6', '10', 0, 3, '0', '0', '0', '0', '0', '0', 'N/A', '3', 13, 1109, 1, 1, NULL, NULL, 1, 240, '2025-07-09 01:05:28', '2025-07-09 01:05:28', '2024-25', 4, '50', 0, 'Survey Added', 0, 10),
(149, '1080', 'Khan Ghalib', '2025-01-01', 'Khan Ghalib', '2024-10-18', '0', '2', 'Shaftal (شفتل)', '2025-02-17', '4', '10', 0, 2, '0', '0', '0', '0', '0', '0', 'N/A', '3', 13, 1109, 1, 1, NULL, NULL, 1, 240, '2025-07-09 01:07:59', '2025-07-09 01:07:59', '2024-25', 5, '50', 0, 'Survey Added', 0, 10),
(150, '1084/1085', 'Noor Rahman', '2025-01-01', 'Noor Rahman', '2025-11-16', '12', '12', 'Wheat (گندم)', '2025-02-17', '12', '20', 0, 12, '0', '0', '0', '0', '0', '0', 'N/A', '2', 13, 161, 1, 1, NULL, NULL, 1, 240, '2025-07-09 02:29:31', '2025-07-09 02:29:31', '2024-25', 4, '50', 0, 'Survey Added', 0, 10),
(151, '1087', 'Sirtaj Wagera', '2025-01-01', 'Sirtaj Wagera', '2024-11-10', '1.10', '1.10', 'Shaftal (شفتل)', NULL, '3', '10', 10, 1, '0', '0', '0', '0', '0', '0', 'N/A', '4', 13, 162, 1, 1, NULL, NULL, 1, 240, '2025-07-09 02:36:19', '2025-07-09 02:36:19', '2024-25', 5, '50', 0, 'Survey Added', 0, 10),
(152, '1087', 'Sirtaj Wagera', '2025-01-01', 'Sirtaj Wagera', '2024-10-16', '6', '6', 'Wheat (گندم)', NULL, '10', '12', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '4', 13, 162, 1, 1, NULL, NULL, 1, 240, '2025-07-09 02:48:05', '2025-07-09 02:48:05', '2024-25', 4, '50', 0, 'Survey Added', 0, 10),
(153, '1087', 'Khalid', '2025-01-01', 'siar,farhad  S\\O Rasool Khan', '2024-10-10', '1.10', '1.10', 'Shaftal (شفتل)', NULL, '3', '10', 10, 1, '0', '0', '0', '0', '0', '0', 'N/A', '5', 13, 163, 1, 1, NULL, NULL, 1, 240, '2025-07-09 02:55:14', '2025-07-09 02:55:14', '2024-25', 5, '50', 0, 'Survey Added', 0, 10),
(154, '1087', 'Siar\\Farhad S\\O Rasool Khan', '2025-01-01', 'Khalid', '2024-10-10', '1.10', '1.10', 'Darakhtaan (درختان)', NULL, '3', '10', 10, 1, '0', '0', '0', '0', '0', '0', 'N/A', '5', 13, 163, 1, 1, NULL, NULL, 1, 240, '2025-07-09 02:59:32', '2025-07-09 02:59:32', '2024-25', 8, '50', 0, 'Survey Added', 0, 10),
(155, '1087', 'Mirzaman  S\\O Saodgar', '2025-01-01', 'Khalid Khan', '2024-09-10', '17', '17', 'Joi (جوئی)', NULL, '17', '20', 0, 17, '0', '0', '0', '0', '0', '0', 'N/A', '6', 13, 164, 1, 1, NULL, NULL, 1, 240, '2025-07-09 03:05:05', '2025-07-09 03:05:05', '2024-25', 12, '50', 0, 'Survey Added', 0, 10),
(156, '1087', 'Khalid Khan', '2025-01-01', 'Mirzaman S\\O  Saodagar', '2024-09-10', '12', '12', 'Joi (جوئی)', NULL, '12', '20', 0, 12, '0', '0', '0', '0', '0', '0', 'N/A', '6', 13, 164, 1, 1, NULL, NULL, 1, 240, '2025-07-09 03:09:21', '2025-07-09 03:09:21', '2024-25', 12, '50', 0, 'Survey Added', 0, 10),
(157, '1718', 'Shakoor', '2025-01-02', 'Shakoor', '2024-11-10', '0', '12', 'Maize (مکئی)', '2025-04-06', '15', '16', 0, 12, '0', '0', '0', '0', '0', '0', 'N/A', '66', 21, 1176, 1, 3, NULL, NULL, 1, 84, '2025-07-09 03:33:29', '2025-07-09 03:50:20', '2024-25', 4, '50', 1, 'R', 3, 12),
(158, '1718', 'Shakoor', '2025-01-02', 'Shakoor', '2024-11-10', '0', '10', 'Chari (چری)', '2025-04-06', '8', '25', 0, 10, '0', '0', '0', '0', '0', '0', 'N/A', '66', 21, 1176, 1, 3, NULL, NULL, 1, 84, '2025-07-09 03:38:40', '2025-07-09 03:50:20', '2024-25', 5, '50', 1, 'R', 3, 12),
(159, '1718', 'Shakoor', '2025-01-02', 'Fairoz', '2024-11-10', '0', '10', 'Maize (مکئی)', '2025-04-06', '8', '25', 0, 10, '0', '0', '0', '0', '0', '0', 'N/A', '66', 21, 1176, 1, 3, NULL, NULL, 1, 84, '2025-07-09 03:40:50', '2025-07-09 03:50:20', '2024-25', 4, '50', 1, 'R', 3, 12),
(160, '1718', 'Shakoor', '2025-01-02', 'Fairoz', '2024-11-10', '0', '8', 'Chari (چری)', '2025-04-06', '10', '16', 0, 8, '0', '0', '0', '0', '0', '0', 'N/A', '66', 21, 1176, 1, 3, NULL, NULL, 1, 84, '2025-07-09 03:42:44', '2025-07-09 03:50:20', '2024-25', 5, '50', 1, 'R', 3, 12),
(161, '1089,1097', 'Wisal', '2025-01-01', 'Wisal', '2024-10-10', '015.10', '15.10', 'Wheat (گندم)', NULL, '10', '31', 10, 15, '0', '0', '0', '0', '0', '0', 'N/A', '7', 13, 165, 1, 1, NULL, NULL, 1, 240, '2025-07-09 04:20:01', '2025-07-09 04:20:01', '2024-25', 4, '50', 0, 'Survey Added', 0, 10),
(162, '1093,1093\\1', 'Wisal', '2025-01-01', 'Wisal', '2024-09-10', '6', '6', 'Joi (جوئی)', NULL, '6', '20', 0, 6, '0', '0', '0', '0', '0', '0', 'N/A', '7', 13, 165, 1, 1, NULL, NULL, 1, 240, '2025-07-09 04:22:37', '2025-07-09 04:22:37', '2024-25', 12, '50', 0, 'Survey Added', 0, 10),
(163, '1093,1093\\1', 'Malik Aman', '2025-01-01', 'Malik Aman', '2024-08-08', '4', '4', 'Toom (لہسن)', '2025-02-17', '8', '10', 0, 4, '0', '0', '0', '0', '0', '0', 'N/A', '8', 13, 166, 1, 1, NULL, NULL, 1, 240, '2025-07-09 04:28:28', '2025-07-09 04:28:28', '2024-25', 6, '50', 0, 'Survey Added', 0, 10),
(164, '1093,1093\\1', 'Malik Aman', '2025-01-01', 'Malik Aman', '2024-11-17', '0', '0', 'Wheat (گندم)', NULL, '10', '43', 10, 21, '0', '0', '0', '0', '0', '0', 'N/A', '8', 13, 166, 1, 1, NULL, NULL, 1, 240, '2025-07-09 04:32:52', '2025-07-09 04:32:52', '2024-25', 4, '50', 0, 'Survey Added', 0, 10),
(165, '1093,1093\\1', 'Malik Aman', '2025-01-01', 'Malik Aman', '2024-10-10', '1.10', '1.10', 'Darakhtaan (درختان)', NULL, '2', '15', 10, 1, '0', '0', '0', '0', '0', '0', 'N/A', '8', 13, 166, 1, 1, NULL, NULL, 1, 240, '2025-07-09 04:35:44', '2025-07-09 04:35:44', '2024-25', 8, '50', 0, 'Survey Added', 0, 10),
(166, '1096,1097', 'Fazal Wahid', '2025-01-01', 'Fazal Wahid', '2025-09-16', '9', '9', 'Sabzi (سبزی)', '2025-02-17', '12', '15', 0, 9, '0', '0', '0', '0', '0', '0', 'N/A', '9', 13, 167, 1, 1, NULL, NULL, 1, 240, '2025-07-09 04:43:30', '2025-07-09 04:43:30', '2024-25', 7, '50', 0, 'Survey Added', 0, 10);

-- --------------------------------------------------------

--
-- Table structure for table `distributaries`
--

CREATE TABLE `distributaries` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `canal_id` bigint(20) UNSIGNED DEFAULT NULL,
  `div_id` bigint(20) UNSIGNED DEFAULT NULL,
  `minor_id` bigint(20) UNSIGNED DEFAULT NULL,
  `no_outlet` int(11) DEFAULT NULL,
  `no_outlet_ls` int(11) DEFAULT NULL,
  `no_outlet_rs` int(11) DEFAULT NULL,
  `total_no_cca` float(10,2) DEFAULT NULL,
  `total_no_discharge_cusic` float(10,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `distributaries`
--

INSERT INTO `distributaries` (`id`, `name`, `canal_id`, `div_id`, `minor_id`, `no_outlet`, `no_outlet_ls`, `no_outlet_rs`, `total_no_cca`, `total_no_discharge_cusic`, `created_at`, `updated_at`) VALUES
(1, 'Koragh Branch', 1, 1, 2, 35, 15, 20, 7202.00, 94.00, '2025-07-03 01:57:18', '2025-07-03 01:57:18'),
(2, 'Shiekh Yousaf', 1, 1, 2, 13, 4, 8, 2102.00, 32.00, '2025-07-03 01:58:19', '2025-07-03 01:58:19'),
(3, 'Maho Dehri Minor', 1, 1, 2, 10, 4, 5, 1772.00, 28.00, '2025-07-03 01:59:47', '2025-07-03 01:59:47'),
(4, 'Rashakai Minor', 1, 1, 2, 24, 20, 3, 4158.00, 67.00, '2025-07-03 02:00:49', '2025-07-03 02:00:49'),
(5, 'Turlandi Minor', 1, 1, 2, 10, 3, 6, 1879.00, 28.00, '2025-07-03 02:01:59', '2025-07-03 02:01:59'),
(6, 'Nowshera Minor', 1, 1, 2, 3, 0, 3, 2235.00, 26.00, '2025-07-03 02:03:54', '2025-07-03 02:03:54'),
(7, '1/9 Guide Minor', 1, 1, 3, 11, 6, 4, 2957.00, 35.00, '2025-07-03 02:05:51', '2025-07-03 02:05:51'),
(8, 'Kalpani Distry (Minor)', 1, 1, 3, 23, 2, 21, 4417.00, 158.00, '2025-07-03 02:07:50', '2025-07-03 02:07:50'),
(9, 'Power House Minor', 1, 1, 3, 4, 1, 2, 2100.00, 17.00, '2025-07-03 02:13:58', '2025-07-03 02:13:58'),
(10, '2/9 Hoti Minor', 1, 1, 3, 16, 8, 7, 2067.00, 35.00, '2025-07-03 02:15:20', '2025-07-03 02:15:20'),
(11, '3/9 Toru Minor', 1, 1, 3, 11, 3, 7, 1479.00, 25.00, '2025-07-03 02:16:21', '2025-07-03 02:16:21'),
(12, 'Kandar Minor 1', 3, 1, 4, 8, 8, 0, 2316.00, 20.86, '2025-07-04 00:08:06', '2025-07-04 00:08:06'),
(13, 'Murdara Minor PH 2', 3, 1, 4, 4, 0, 4, 497.00, 4.47, '2025-07-04 00:10:01', '2025-07-04 00:10:01');

-- --------------------------------------------------------

--
-- Table structure for table `districts`
--

CREATE TABLE `districts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `div_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `districts`
--

INSERT INTO `districts` (`id`, `name`, `created_at`, `updated_at`, `div_id`) VALUES
(1, 'Nowshera', '2025-07-01 01:33:20', '2025-07-01 01:33:20', 1),
(2, 'Mardan', '2025-07-01 01:35:07', '2025-07-01 01:35:07', 1),
(3, 'Charsadda', '2025-07-03 02:11:53', '2025-07-03 02:11:53', 1);

-- --------------------------------------------------------

--
-- Table structure for table `divisions`
--

CREATE TABLE `divisions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `divsion_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `divisions`
--

INSERT INTO `divisions` (`id`, `divsion_name`, `created_at`, `updated_at`) VALUES
(1, 'Mardan Irrigation Division', '2025-07-01 01:32:52', '2025-07-01 01:32:52'),
(2, 'peshawar', '2025-07-02 01:11:47', '2025-07-02 01:11:47');

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `farmers`
--

CREATE TABLE `farmers` (
  `farmer_id` bigint(20) UNSIGNED NOT NULL,
  `serial_number` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `registration_date` date NOT NULL,
  `assessment_number` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `patwari_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `owner_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tenant_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `cultivators_info` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `marla` int(11) DEFAULT NULL,
  `kanal` int(11) DEFAULT NULL,
  `previous_crop` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `snowing_date` date NOT NULL,
  `village_id` bigint(20) UNSIGNED NOT NULL,
  `division_id` bigint(20) UNSIGNED NOT NULL,
  `tehsil_id` bigint(20) UNSIGNED NOT NULL,
  `district_id` bigint(20) UNSIGNED NOT NULL,
  `canal_id` bigint(20) UNSIGNED NOT NULL,
  `crop_id` bigint(20) UNSIGNED NOT NULL,
  `outlet_id` bigint(20) UNSIGNED NOT NULL,
  `water_outlet` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `plat_boundary_number` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `farmers`
--

INSERT INTO `farmers` (`farmer_id`, `serial_number`, `registration_date`, `assessment_number`, `patwari_name`, `owner_name`, `tenant_name`, `cultivators_info`, `marla`, `kanal`, `previous_crop`, `snowing_date`, `village_id`, `division_id`, `tehsil_id`, `district_id`, `canal_id`, `crop_id`, `outlet_id`, `water_outlet`, `plat_boundary_number`, `created_at`, `updated_at`) VALUES
(1, '6', '2024-11-01', '7', 'abbas', 'abbas', 'hh', 'mahnoor', 0, 8, 'u', '2024-11-01', 1, 6, 8, 8, 8, 5, 4, 'h', '', '2024-10-31 22:27:22', '2024-10-31 22:27:22');

-- --------------------------------------------------------

--
-- Table structure for table `halqa`
--

CREATE TABLE `halqa` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `halqa_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tehsil_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `halqa`
--

INSERT INTO `halqa` (`id`, `halqa_name`, `tehsil_id`, `created_at`, `updated_at`) VALUES
(1, 'rashkai', 1, '2025-07-01 01:33:57', '2025-07-01 01:33:57'),
(2, 'Sheikh Yousaf', 2, '2025-07-01 01:35:50', '2025-07-01 01:35:50'),
(3, 'Narai NO 7', 3, '2025-07-01 03:58:26', '2025-07-01 03:58:26'),
(4, 'Hoti Par', 2, '2025-07-01 04:00:54', '2025-07-01 04:00:54'),
(5, 'Seri Bahlol', 3, '2025-07-01 04:09:59', '2025-07-01 04:09:59'),
(6, 'Cantt Mardan', 2, '2025-07-03 00:52:16', '2025-07-03 00:52:16'),
(7, 'Gujar Garhi', 2, '2025-07-03 01:01:03', '2025-07-03 01:01:03'),
(8, 'bakyana', 2, '2025-07-03 01:08:11', '2025-07-03 01:08:11'),
(9, 'banda chail', 1, '2025-07-03 01:15:51', '2025-07-03 01:15:51'),
(10, 'chack Mardan', 2, '2025-07-03 01:21:12', '2025-07-03 01:21:12'),
(11, 'char banda', 2, '2025-07-03 01:26:33', '2025-07-03 01:26:33'),
(12, 'chail', 3, '2025-07-03 01:30:50', '2025-07-03 01:30:50'),
(13, 'Alladad khael', 2, '2025-07-03 01:35:44', '2025-07-03 01:35:44'),
(14, 'Ghala dher', 2, '2025-07-03 01:40:35', '2025-07-03 01:40:35'),
(15, 'kandar scheme', 1, '2025-07-03 01:48:37', '2025-07-03 01:48:37'),
(16, 'bagheiram', 2, '2025-07-03 01:50:42', '2025-07-03 01:50:42'),
(17, 'khazana deheri', 2, '2025-07-03 01:55:55', '2025-07-03 01:55:55'),
(18, 'Ferozpur', 2, '2025-07-03 02:00:34', '2025-07-03 02:00:34'),
(19, 'shah baig', 3, '2025-07-03 02:02:13', '2025-07-03 02:02:13'),
(20, 'Narai no 8', 3, '2025-07-03 02:04:21', '2025-07-03 02:04:21'),
(21, 'Managa', 2, '2025-07-03 02:06:38', '2025-07-03 02:06:38'),
(22, 'chmatar derri', 2, '2025-07-03 02:08:30', '2025-07-03 02:08:30'),
(23, 'Haryanah', 5, '2025-07-03 02:13:25', '2025-07-03 02:13:25'),
(24, 'hoti no 9', 2, '2025-07-03 02:17:10', '2025-07-03 02:17:10');

-- --------------------------------------------------------

--
-- Table structure for table `irrigators`
--

CREATE TABLE `irrigators` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `village_id` bigint(20) UNSIGNED DEFAULT NULL,
  `div_id` bigint(20) UNSIGNED DEFAULT NULL,
  `canal_id` int(11) DEFAULT NULL,
  `irrigator_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `irrigator_khata_number` int(11) NOT NULL,
  `irrigator_f_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `irrigator_mobile_number` varchar(150) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `cnic` varchar(150) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `irrigators`
--

INSERT INTO `irrigators` (`id`, `village_id`, `div_id`, `canal_id`, `irrigator_name`, `irrigator_khata_number`, `irrigator_f_name`, `irrigator_mobile_number`, `created_at`, `updated_at`, `cnic`) VALUES
(1, 10, 1, 1, 'Director Sugarcane Institute of Mardan', 1, 'DSIM', NULL, '2025-07-01 02:11:41', '2025-07-01 02:11:41', NULL),
(2, 4, 1, 1, 'Muhammad Ali Khan', 1, 'Bacha Sab', '03331234', '2025-07-01 02:19:08', '2025-07-01 02:19:08', '1730189401'),
(3, 4, 1, 1, 'Sher Ali Khan', 2, 'Khan', '03331234', '2025-07-01 02:20:06', '2025-07-01 02:20:06', '17301894'),
(4, 4, 1, 1, 'Mushraff Khan', 3, 'Fazal Rehman', '03331234', '2025-07-01 02:20:37', '2025-07-01 02:20:37', '173018'),
(5, 4, 1, 1, 'Fazal Akber', 4, 'Fazal', '03331234', '2025-07-01 02:21:26', '2025-07-01 02:21:26', '17301-21819'),
(6, 4, 1, 1, 'Aurangzeb', 5, 'Zareem', '03331234', '2025-07-01 02:22:35', '2025-07-01 02:22:35', '17301-218'),
(7, 10, 1, 1, 'Manager Military Farm', 2, 'MMF', NULL, '2025-07-01 02:22:47', '2025-07-01 02:22:47', NULL),
(8, 4, 1, 1, 'Gohar Ali', 6, 'Gulam Haider', '000', '2025-07-01 03:48:54', '2025-07-02 02:03:37', '0000'),
(9, 4, 1, 1, 'Amjid Ali', 7, 'Gulam Haider', '000', '2025-07-01 03:50:55', '2025-07-01 03:50:55', '000000'),
(10, 4, 1, 1, 'Almas', 8, 'Ghulam Haider', NULL, '2025-07-01 03:53:18', '2025-07-01 03:53:18', NULL),
(11, 4, 1, 1, 'Inayat Ur Rahman', 9, 'Ghulam haider', NULL, '2025-07-01 03:53:53', '2025-07-01 03:53:53', NULL),
(12, 4, 1, 1, 'Hashmat Ali', 10, 'Ghulam Haider', '000', '2025-07-01 03:54:28', '2025-07-01 08:05:36', NULL),
(13, 4, 1, 1, 'Musmat Mushtari Hasmat ali', 11, 'Ghulam Haider', NULL, '2025-07-01 03:55:30', '2025-07-01 03:55:30', NULL),
(14, 14, 1, 1, 'عبد الرحمن', 1, 'ali akbar', '۔', '2025-07-01 04:28:38', '2025-07-05 01:48:02', NULL),
(16, 11, 1, 1, 'Haleem Shah', 1, 'Faqeer Shah', NULL, '2025-07-01 04:41:20', '2025-07-01 04:41:20', NULL),
(17, 11, 1, 1, 'Badshah', 2, 'Ameer Muhammad', NULL, '2025-07-01 04:42:18', '2025-07-01 04:42:18', NULL),
(18, 11, 1, 1, 'Noor Hassan', 3, 'Noor DIN', NULL, '2025-07-01 04:42:46', '2025-07-01 04:42:46', NULL),
(19, 11, 1, 1, 'Syed Karam Shah', 4, 'Said Akbar', '-', '2025-07-01 04:44:18', '2025-07-08 03:55:08', NULL),
(20, 12, 1, 1, 'nisar', 1, 'Noor dali', NULL, '2025-07-01 04:52:49', '2025-07-01 04:52:49', NULL),
(21, 12, 1, 1, 'Taj Muhammad', 2, 'Hazrat Jan', NULL, '2025-07-01 04:53:38', '2025-07-01 04:53:38', NULL),
(22, 13, 1, 1, 'saad Ullah', 124, 'Umar KHan', NULL, '2025-07-01 05:07:28', '2025-07-01 05:07:28', NULL),
(23, 13, 1, 1, 'Javed', 126, 'Amir Muhammad', NULL, '2025-07-01 17:37:49', '2025-07-01 17:37:49', NULL),
(24, 13, 1, 1, 'Idrees', 127, 'Amir Muhammad', NULL, '2025-07-01 17:40:08', '2025-07-01 17:40:08', NULL),
(25, 13, 1, 1, 'Sohail', 128, 'Umer Khan', NULL, '2025-07-01 17:41:02', '2025-07-01 17:41:02', NULL),
(26, 13, 1, 1, 'Inayat Ullah', 129, 'Muhammad Jan', NULL, '2025-07-01 17:41:41', '2025-07-01 17:41:41', NULL),
(27, 13, 1, 1, 'Anwar', 130, 'Umer Khan', NULL, '2025-07-01 17:42:31', '2025-07-01 17:42:31', NULL),
(29, 13, 1, 1, 'Shah Jihan', 131, 'Sher Bahadur', NULL, '2025-07-01 18:57:25', '2025-07-01 18:57:25', NULL),
(30, 13, 1, 1, 'Sher Muhammad', 133, 'Umara Khan', NULL, '2025-07-01 18:58:17', '2025-07-01 18:58:17', NULL),
(32, 13, 1, 1, 'Hashim Khan', 132, 'Hasan Jan', NULL, '2025-07-01 19:02:41', '2025-07-01 19:02:41', NULL),
(35, 13, 1, 1, 'Aman Khan', 134, 'Umara Khan', NULL, '2025-07-01 19:05:19', '2025-07-01 19:05:19', NULL),
(36, 13, 1, 1, 'Mumtaz Gujjar', 135, 'Amir Jan', NULL, '2025-07-01 19:05:54', '2025-07-01 19:05:54', NULL),
(37, 13, 1, 1, 'Noshad', 136, 'Umara Khan', NULL, '2025-07-01 19:07:01', '2025-07-01 19:07:01', NULL),
(38, 13, 1, 1, 'Ihsan Ullah', 137, 'Umara Khan', NULL, '2025-07-01 19:07:29', '2025-07-01 19:07:29', NULL),
(39, 13, 1, 1, 'Dost Muhammad', 138, 'Zaman', NULL, '2025-07-01 19:08:01', '2025-07-01 19:08:01', NULL),
(41, 13, 1, 1, 'Shakeel', 140, 'N/A', NULL, '2025-07-01 19:10:07', '2025-07-01 19:10:07', NULL),
(42, 13, 1, 1, 'Iltaf', 141, 'Bahadur', NULL, '2025-07-01 19:10:34', '2025-07-01 19:10:34', NULL),
(43, 13, 1, 1, 'Wazir', 142, 'Khan Bahadur', NULL, '2025-07-01 19:10:59', '2025-07-01 19:10:59', NULL),
(44, 13, 1, 1, 'Taj Muhammad', 144, 'Khan Bahadur', NULL, '2025-07-01 19:11:37', '2025-07-01 19:11:37', NULL),
(45, 13, 1, 1, 'Ajmal', 143, 'Khan Bahadur', NULL, '2025-07-01 19:12:04', '2025-07-01 19:12:04', NULL),
(46, 13, 1, 1, 'Amin Gul', 145, 'Mohib Gul', NULL, '2025-07-01 19:12:53', '2025-07-01 19:12:53', NULL),
(47, 13, 1, 1, 'Ali Haider', 146, 'N/A', NULL, '2025-07-01 19:13:39', '2025-07-01 19:13:39', NULL),
(48, 13, 1, 1, 'Rahman Jan', 147, 'N/A', NULL, '2025-07-01 19:14:12', '2025-07-01 19:14:12', NULL),
(49, 13, 1, 1, 'Amir Gul Gujjar', 148, 'Jumma Khan', NULL, '2025-07-01 19:14:46', '2025-07-01 19:14:46', NULL),
(50, 13, 1, 1, 'Sher Muhammad', 139, 'Muhammad Afzal', NULL, '2025-07-01 19:17:12', '2025-07-01 19:17:12', NULL),
(51, 13, 1, 1, 'Maqsood Khan', 149, 'Khushal Khan', NULL, '2025-07-01 19:19:28', '2025-07-01 19:19:28', NULL),
(52, 13, 1, 1, 'Nasir Khan', 150, 'Gulab Din', NULL, '2025-07-01 19:25:57', '2025-07-01 19:25:57', NULL),
(53, 13, 1, 1, 'Rabnawaz', 152, 'Saida Jan', NULL, '2025-07-01 19:26:16', '2025-07-01 19:26:16', NULL),
(54, 13, 1, 1, 'Shahid Khan', 153, 'Baidad Khan', NULL, '2025-07-01 19:27:00', '2025-07-01 19:27:00', NULL),
(55, 13, 1, 1, 'Shaukat Khan', 154, 'Khushal Khan', NULL, '2025-07-01 19:27:38', '2025-07-01 19:27:38', NULL),
(56, 13, 1, 1, 'Behram Gul', 151, 'Faqir', NULL, '2025-07-01 19:28:27', '2025-07-01 19:28:27', NULL),
(57, 13, 1, 1, 'Khan Bahadur', 155, 'Sikandar Khan', NULL, '2025-07-01 19:29:45', '2025-07-01 19:29:45', NULL),
(58, 13, 1, 1, 'Itibar Khan', 156, 'Gul Muhammad', NULL, '2025-07-01 19:30:28', '2025-07-01 19:30:28', NULL),
(59, 13, 1, 1, 'Muhammad Gul', 157, 'Ghulam Ali', NULL, '2025-07-01 19:30:56', '2025-07-01 19:30:56', NULL),
(60, 13, 1, 1, 'Muhammad Ullah', 158, 'Gul Nawab', NULL, '2025-07-01 19:33:12', '2025-07-01 19:33:12', NULL),
(61, 13, 1, 1, 'Sher Bacha', 159, 'Khan Bahadur', NULL, '2025-07-01 19:34:03', '2025-07-01 19:34:03', NULL),
(62, 13, 1, 1, 'Naseer', 160, 'Zareen', NULL, '2025-07-01 19:34:38', '2025-07-01 19:34:38', NULL),
(63, 13, 1, 1, 'Wisal', 161, 'Sultan', NULL, '2025-07-01 19:34:58', '2025-07-01 19:34:58', NULL),
(64, 13, 1, 1, 'Wakeel Khan', 162, 'Amir Khan', NULL, '2025-07-01 19:35:25', '2025-07-01 19:35:25', NULL),
(65, 13, 1, 1, 'Abdul Gafoor', 164, 'Sikandar Khan', NULL, '2025-07-01 19:35:55', '2025-07-01 19:35:55', NULL),
(66, 13, 1, 1, 'Sawar Khan', 166, 'Sikandar Khan', NULL, '2025-07-01 19:36:42', '2025-07-01 19:36:42', NULL),
(67, 13, 1, 1, 'Fazal Mabood', 171, 'Rasool Khan', NULL, '2025-07-01 19:38:39', '2025-07-01 19:38:39', NULL),
(69, 13, 1, 1, 'Musammah Abaro', 163, 'Said Qayom', NULL, '2025-07-01 19:40:30', '2025-07-01 19:40:30', NULL),
(70, 13, 1, 1, 'Iqbal', 165, 'Shakar Khan', NULL, '2025-07-01 19:48:53', '2025-07-01 19:48:53', NULL),
(71, 13, 1, 1, 'Sher Bahadur', 167, 'Shakar Khan', NULL, '2025-07-01 19:49:19', '2025-07-01 19:49:19', NULL),
(72, 13, 1, 1, 'Rabnawaz', 168, 'Shakar Khan', NULL, '2025-07-01 19:49:52', '2025-07-01 19:49:52', NULL),
(73, 13, 1, 1, 'Abdul Qadar', 169, 'Shakar Khan', NULL, '2025-07-01 19:50:23', '2025-07-01 19:50:23', NULL),
(74, 13, 1, 1, 'Fazal Mabood', 172, 'Rasool Khan', NULL, '2025-07-01 19:51:28', '2025-07-01 19:51:28', NULL),
(75, 13, 1, 1, 'Sartaj', 177, 'Sikandar Khan', NULL, '2025-07-01 19:53:31', '2025-07-01 19:53:31', NULL),
(76, 13, 1, 1, 'Noor Muhammad', 178, 'Sikandar Khan', NULL, '2025-07-01 19:53:51', '2025-07-01 19:53:51', NULL),
(77, 13, 1, 1, 'Muhammad', 179, 'Sikandar Khan', NULL, '2025-07-01 19:54:16', '2025-07-01 19:54:16', NULL),
(78, 13, 1, 1, 'Musa', 180, 'Sulaiman', NULL, '2025-07-01 19:54:31', '2025-07-01 19:54:31', NULL),
(79, 13, 1, 1, 'Bakht Nazar', 185, 'Dost Muhammad', NULL, '2025-07-01 19:56:28', '2025-07-01 19:56:28', NULL),
(80, 13, 1, 1, 'Bahadur', 186, 'Umara Khan', NULL, '2025-07-01 19:56:52', '2025-07-01 19:56:52', NULL),
(81, 13, 1, 1, 'Nadar', 187, 'Umara Khan', NULL, '2025-07-01 19:57:06', '2025-07-01 19:57:06', NULL),
(82, 13, 1, 1, 'Ayub', 188, 'Umara Khan', NULL, '2025-07-01 19:57:27', '2025-07-01 19:57:27', NULL),
(83, 13, 1, 1, 'Gul Muhammad', 189, 'Sultan Muhammad', NULL, '2025-07-01 19:58:47', '2025-07-01 19:58:47', NULL),
(89, 13, 1, 1, 'Nizam', 176, 'Fazal Mahmood', NULL, '2025-07-01 20:17:18', '2025-07-01 20:17:18', NULL),
(90, 13, 1, 1, 'Fazal Mabood', 174, 'N/A', NULL, '2025-07-01 20:19:35', '2025-07-01 20:19:35', NULL),
(91, 8, 1, 1, 'Manager Military Farm Nowshera', 1, 'Rak sarkar', NULL, '2025-07-02 02:22:25', '2025-07-02 02:22:25', NULL),
(92, 5, 1, 1, 'Admin Officer PAF Risalpur', 1, 'PAF', '00000', '2025-07-02 02:25:27', '2025-07-03 13:27:00', '00000'),
(94, 4, 1, 1, 'Shah Nazar', 12, 'Nasrullah', NULL, '2025-07-02 12:57:44', '2025-07-02 12:57:44', NULL),
(95, 13, 1, 1, 'Awal Khan', 190, 'Hanif Khan', NULL, '2025-07-02 17:09:43', '2025-07-02 17:09:43', NULL),
(96, 13, 1, 1, 'Wali Khan', 191, 'Hanif Khan', NULL, '2025-07-02 17:10:22', '2025-07-02 17:10:22', NULL),
(97, 13, 1, 1, 'Anwar Khan', 192, 'Hanif Khan', NULL, '2025-07-02 17:13:35', '2025-07-02 17:13:35', NULL),
(98, 13, 1, 1, 'Faraz', 193, 'Rahman uddin', NULL, '2025-07-02 17:15:23', '2025-07-02 17:15:23', NULL),
(99, 13, 1, 1, 'Nasir', 194, 'N/A', NULL, '2025-07-02 17:16:54', '2025-07-02 17:16:54', NULL),
(100, 13, 1, 1, 'Sabz Ali, Ayub Khan', 195, 'Shah Imran', NULL, '2025-07-02 17:17:46', '2025-07-02 17:17:46', NULL),
(101, 13, 1, 1, 'Iqbal', 196, 'Sarwar', NULL, '2025-07-02 17:19:52', '2025-07-02 17:19:52', NULL),
(102, 13, 1, 1, 'Tahseen Ullah', 197, 'Hanif Ullah', NULL, '2025-07-02 17:20:41', '2025-07-02 17:20:41', NULL),
(103, 13, 1, 1, 'Fazal Rahman Pir', 198, 'N/A', NULL, '2025-07-02 17:22:33', '2025-07-02 17:22:33', NULL),
(104, 13, 1, 1, 'Noor Rahim Pir', 199, 'N/A', NULL, '2025-07-02 17:23:29', '2025-07-02 17:23:29', NULL),
(105, 13, 1, 1, 'Noor Rahim Pir', 200, 'N/A', NULL, '2025-07-02 17:24:13', '2025-07-02 17:24:13', NULL),
(106, 13, 1, 1, 'Hasan Khan', 201, 'Masil Khan', NULL, '2025-07-02 17:25:08', '2025-07-02 17:25:08', NULL),
(107, 13, 1, 1, 'Husain Khan', 202, 'Masil Khan', NULL, '2025-07-02 17:26:01', '2025-07-02 17:26:01', NULL),
(108, 13, 1, 1, 'Said Rahman Pir', 203, 'N/A', NULL, '2025-07-02 17:26:42', '2025-07-02 17:26:42', NULL),
(109, 13, 1, 1, 'Noor Bacha pir', 204, 'Abdur Rahim', NULL, '2025-07-02 17:27:47', '2025-07-02 17:27:47', NULL),
(110, 13, 1, 1, 'Saif Ali Shah Pir', 205, 'Amir Shah', NULL, '2025-07-02 17:28:53', '2025-07-02 17:28:53', NULL),
(112, 13, 1, 1, 'Saeed Ullah', 207, 'Hameed Khan', NULL, '2025-07-02 17:30:19', '2025-07-02 17:30:19', NULL),
(113, 13, 1, 1, 'Javed', 206, 'Hameed Khan', NULL, '2025-07-02 17:31:02', '2025-07-02 17:31:02', NULL),
(114, 13, 1, 1, 'Bacha Khan', 208, 'Sakhi', '-', '2025-07-02 17:33:19', '2025-07-02 17:34:45', NULL),
(115, 13, 1, 1, 'Saad Ullah Timergara', 209, 'N/A', NULL, '2025-07-02 17:35:32', '2025-07-02 17:35:32', NULL),
(116, 13, 1, 1, 'Taj Muhammad', 210, 'Abdul Qadar', NULL, '2025-07-02 17:36:19', '2025-07-02 17:36:19', NULL),
(117, 13, 1, 1, 'Safdar', 211, 'Abdul Qadar', NULL, '2025-07-02 17:36:42', '2025-07-02 17:36:42', NULL),
(119, 13, 1, 1, 'Nadar Khan', 212, 'Abdul Qadar', NULL, '2025-07-02 17:39:33', '2025-07-02 17:39:33', NULL),
(120, 13, 1, 1, 'Asghar Khan', 213, 'Fazal Qadir', NULL, '2025-07-02 17:41:38', '2025-07-02 17:41:38', NULL),
(121, 13, 1, 1, 'Shahzad Gul', 214, 'Taza Gul', NULL, '2025-07-02 17:42:13', '2025-07-02 17:42:13', NULL),
(122, 13, 1, 1, 'Younas Khan', 215, 'Khan Gul', NULL, '2025-07-02 17:42:45', '2025-07-02 17:42:45', NULL),
(123, 13, 1, 1, 'Saleem', 216, 'Khan Gul', NULL, '2025-07-02 17:43:17', '2025-07-02 17:43:17', NULL),
(124, 13, 1, 1, 'Nisar', 217, 'Fazal Subhan', NULL, '2025-07-02 17:43:48', '2025-07-02 17:43:48', NULL),
(125, 13, 1, 1, 'Ikram', 218, 'Kareem Bakhsh', NULL, '2025-07-02 17:44:33', '2025-07-02 17:44:33', NULL),
(126, 13, 1, 1, 'Fazal Rahman Pir', 219, 'N/A', NULL, '2025-07-02 17:46:52', '2025-07-02 17:46:52', NULL),
(127, 13, 1, 1, 'Bacha', 220, 'Fazal Muhammad', NULL, '2025-07-02 17:47:23', '2025-07-02 17:47:23', NULL),
(128, 13, 1, 1, 'Qaisar', 221, 'Munawar', NULL, '2025-07-02 17:48:10', '2025-07-02 17:48:10', NULL),
(129, 13, 1, 1, 'Diyar Khan', 222, 'Munawar', NULL, '2025-07-02 17:49:25', '2025-07-02 17:49:25', NULL),
(130, 13, 1, 1, 'Shakib', 223, 'Munawar', NULL, '2025-07-02 17:49:46', '2025-07-02 17:49:46', NULL),
(131, 13, 1, 1, 'Muhammad', 224, 'Munawar', NULL, '2025-07-02 17:50:06', '2025-07-02 17:50:06', NULL),
(132, 13, 1, 1, 'Muhammad Zaman', 225, 'Munawar', NULL, '2025-07-02 17:50:32', '2025-07-02 17:50:32', NULL),
(133, 13, 1, 1, 'Mir Alam', 226, 'Munawar', NULL, '2025-07-02 17:51:06', '2025-07-02 17:51:06', NULL),
(134, 13, 1, 1, 'Shamsher', 227, 'Mutabar', NULL, '2025-07-02 17:51:55', '2025-07-02 17:51:55', NULL),
(135, 13, 1, 1, 'Murad', 228, 'Sher Dad', NULL, '2025-07-02 17:52:35', '2025-07-02 17:52:35', NULL),
(136, 13, 1, 1, 'Nosher', 229, 'Mutabar', NULL, '2025-07-02 17:53:05', '2025-07-02 17:53:05', NULL),
(137, 13, 1, 1, 'Haleem Shah', 230, 'Noran Shah', NULL, '2025-07-02 17:54:39', '2025-07-02 17:54:39', NULL),
(138, 13, 1, 1, 'Azmat Ali', 231, 'N/A', NULL, '2025-07-02 17:55:15', '2025-07-02 17:55:15', NULL),
(139, 13, 1, 1, 'Muntazir Shah', 232, 'N/A', NULL, '2025-07-02 17:55:43', '2025-07-02 17:55:43', NULL),
(141, 13, 1, 1, 'Wahid Shah', 233, 'Maaroof Shah', NULL, '2025-07-02 17:57:39', '2025-07-02 17:57:39', NULL),
(142, 13, 1, 1, 'Shah zewar', 234, 'Arab Shah', NULL, '2025-07-02 17:58:22', '2025-07-02 17:58:22', NULL),
(143, 13, 1, 1, 'Mukamil Shah', 235, 'Ahmad Shah', NULL, '2025-07-02 17:59:03', '2025-07-02 17:59:03', NULL),
(144, 13, 1, 1, 'Shamshad', 236, 'Raheem Shah', NULL, '2025-07-02 17:59:47', '2025-07-02 17:59:47', NULL),
(146, 13, 1, 1, 'Shakoor', 238, 'Siddiq', NULL, '2025-07-02 18:00:58', '2025-07-02 18:00:58', NULL),
(147, 13, 1, 1, 'Nisar', 237, 'Dava Jan', NULL, '2025-07-02 18:03:34', '2025-07-02 18:03:34', NULL),
(148, 13, 1, 1, 'Fairoz', 239, 'Siddique', NULL, '2025-07-02 18:05:22', '2025-07-02 18:05:22', NULL),
(149, 13, 1, 1, 'Zubair Shah', 240, 'Kamal Shah', NULL, '2025-07-02 18:05:46', '2025-07-02 18:05:46', NULL),
(150, 13, 1, 1, 'Abid', 241, 'Suhbat Khan', NULL, '2025-07-02 18:06:08', '2025-07-02 18:06:08', NULL),
(151, 13, 1, 1, 'Mahabat', 242, 'Suhbat Khan', NULL, '2025-07-02 18:06:53', '2025-07-02 18:06:53', NULL),
(152, 13, 1, 1, 'Munawar Shah', 243, 'Izzat Shah', NULL, '2025-07-02 18:07:38', '2025-07-02 18:07:38', NULL),
(154, 13, 1, 1, 'Hizar Hayat', 244, 'Sherzada', NULL, '2025-07-02 18:09:15', '2025-07-02 18:09:15', NULL),
(155, 13, 1, 1, 'Shokat Ali', 245, 'Iran Shah', NULL, '2025-07-02 18:09:50', '2025-07-02 18:09:50', NULL),
(156, 13, 1, 1, 'Javed', 246, 'Anwar Shah', NULL, '2025-07-02 18:10:24', '2025-07-02 18:10:24', NULL),
(157, 13, 1, 1, 'Saboor', 247, 'Siddique', NULL, '2025-07-02 18:10:54', '2025-07-02 18:10:54', NULL),
(158, 13, 1, 1, 'Nizam', 248, 'Siddique', NULL, '2025-07-02 18:11:32', '2025-07-02 18:11:32', NULL),
(159, 13, 1, 1, 'Zareeb Khan', 249, 'Kareem Ullah', NULL, '2025-07-02 18:12:46', '2025-07-02 18:12:46', NULL),
(160, 13, 1, 1, 'Fazal Rahman', 1, 'Haji Muqam', NULL, '2025-07-02 18:16:10', '2025-07-02 18:16:10', NULL),
(161, 13, 1, 1, 'Noor Rahman', 2, 'Haji Muqam', NULL, '2025-07-02 18:16:33', '2025-07-02 18:16:33', NULL),
(162, 13, 1, 1, 'Sirtaj Wagera', 4, 'mir Bacha', NULL, '2025-07-02 18:58:21', '2025-07-02 18:58:21', NULL),
(163, 13, 1, 1, 'Khalid', 5, 'N/A', NULL, '2025-07-02 18:59:06', '2025-07-02 18:59:06', NULL),
(164, 13, 1, 1, 'Khalid Khan', 6, 'N/A', NULL, '2025-07-02 18:59:42', '2025-07-02 18:59:42', NULL),
(165, 13, 1, 1, 'Wisal', 7, 'Nisar', NULL, '2025-07-02 19:00:27', '2025-07-02 19:00:27', NULL),
(166, 13, 1, 1, 'Malik Aman', 8, 'Muzafar', NULL, '2025-07-02 19:01:25', '2025-07-02 19:01:25', NULL),
(167, 13, 1, 1, 'Fazal Wahid', 9, 'N/A', NULL, '2025-07-02 19:12:40', '2025-07-02 19:12:40', NULL),
(168, 13, 1, 1, 'Fazal Dayan', 10, 'N/A', NULL, '2025-07-02 19:13:59', '2025-07-02 19:13:59', NULL),
(169, 13, 1, 1, 'khadim Shah', 11, 'Sufaid Shah', NULL, '2025-07-02 19:14:43', '2025-07-02 19:14:43', NULL),
(170, 13, 1, 1, 'Amin Ul Haq', 12, 'Muhammad Rafiq', NULL, '2025-07-02 19:15:14', '2025-07-02 19:15:14', NULL),
(171, 13, 1, 1, 'Miraj Ul Haq', 13, 'Muhammad Rafiq', NULL, '2025-07-02 19:16:09', '2025-07-02 19:16:09', NULL),
(172, 13, 1, 1, 'Muhammad Rafiq', 14, 'Mahmood', NULL, '2025-07-02 19:16:36', '2025-07-02 19:16:36', NULL),
(173, 13, 1, 1, 'Nasrum Minallah', 15, 'Ghulam Habib', NULL, '2025-07-02 19:18:28', '2025-07-02 19:18:28', NULL),
(174, 13, 1, 1, 'Umer Muhammad', 16, 'Ghulam Habib', NULL, '2025-07-02 19:18:47', '2025-07-02 19:18:47', NULL),
(175, 13, 1, 1, 'Malik Aman', 17, 'Muzafar', NULL, '2025-07-02 19:19:13', '2025-07-02 19:19:13', NULL),
(176, 13, 1, 1, 'Fazal Huda', 18, 'Fida Muhammad', NULL, '2025-07-02 19:20:11', '2025-07-02 19:20:11', NULL),
(177, 13, 1, 1, 'Sajjad', 19, 'Dr Sherin', NULL, '2025-07-02 19:21:21', '2025-07-02 19:21:21', NULL),
(178, 13, 1, 1, 'Mushtaq Khan', 20, 'Muhammad Sadiq', NULL, '2025-07-02 19:21:57', '2025-07-02 19:21:57', NULL),
(179, 13, 1, 1, 'Fazal Dayan', 21, 'N/A', NULL, '2025-07-02 19:22:30', '2025-07-02 19:22:30', NULL),
(180, 13, 1, 1, 'Muhammad Nazir', 22, 'Muhammad Ishaq', NULL, '2025-07-02 19:23:14', '2025-07-02 19:23:14', NULL),
(181, 13, 1, 1, 'Ikrm Ul Haq', 23, 'Muhammad Sadiq', NULL, '2025-07-02 19:25:28', '2025-07-02 19:25:28', NULL),
(182, 13, 1, 1, 'Muhammad Shareef', 24, 'Muhammad Ilyas', NULL, '2025-07-02 19:26:26', '2025-07-02 19:26:26', NULL),
(183, 13, 1, 1, 'Sardar Husain', 25, 'Muhammad Haya', NULL, '2025-07-02 19:27:17', '2025-07-02 19:27:17', NULL),
(184, 13, 1, 1, 'Muhammad Amin', 26, 'Umer Gul', NULL, '2025-07-02 19:27:54', '2025-07-02 19:27:54', NULL),
(185, 13, 1, 1, 'Mir Zaman', 27, 'Muhammad Haya', NULL, '2025-07-02 19:29:08', '2025-07-02 19:29:08', NULL),
(186, 13, 1, 1, 'Muhammad Husain', 28, 'Foidad', NULL, '2025-07-02 19:31:29', '2025-07-02 19:31:29', NULL),
(187, 13, 1, 1, 'Said Hasan', 29, 'Foidad', NULL, '2025-07-02 19:31:52', '2025-07-02 19:31:52', NULL),
(188, 13, 1, 1, 'Muhammad Nazeef', 30, 'Foidad', NULL, '2025-07-02 19:32:42', '2025-07-02 19:32:42', NULL),
(189, 13, 1, 1, 'Muhammad Asif', 31, 'Foidad', NULL, '2025-07-02 19:33:01', '2025-07-02 19:33:01', NULL),
(190, 13, 1, 1, 'Muhammad', 32, 'Ghulam Habib', NULL, '2025-07-02 19:34:34', '2025-07-02 19:34:34', NULL),
(191, 13, 1, 1, 'Khushdil', 33, 'Said Arif', NULL, '2025-07-02 19:35:05', '2025-07-02 19:35:05', NULL),
(192, 13, 1, 1, 'Muhammad Zareen', 34, 'Mirza', NULL, '2025-07-02 19:35:45', '2025-07-02 19:35:45', NULL),
(193, 13, 1, 1, 'Shah Khalid', 35, 'Shahzada', NULL, '2025-07-02 19:36:26', '2025-07-02 19:36:26', NULL),
(194, 22, 1, 1, 'Aman Ullah', 1, 'Ameen Jan', '033312345', '2025-07-03 01:33:21', '2025-07-03 01:33:21', '173018940'),
(195, 19, 1, 1, 'Aman Ullah', 1, 'mir alam', '6', '2025-07-03 02:16:36', '2025-07-03 23:50:39', NULL),
(196, 29, 1, 1, 'Ashrif khan', 1, 'Ashrif khan', '03331234', '2025-07-03 02:52:18', '2025-07-03 02:52:18', '151019158'),
(197, 13, 1, 1, 'Mussamat e Shama', 36, 'N/A', NULL, '2025-07-03 07:10:17', '2025-07-03 07:10:17', NULL),
(198, 13, 1, 1, 'Nisar', 37, 'Fazal Subhan', NULL, '2025-07-03 07:10:44', '2025-07-03 07:10:44', NULL),
(199, 13, 1, 1, 'Fazal Amin', 38, 'Gul Rahman', NULL, '2025-07-03 07:11:30', '2025-07-03 07:11:30', NULL),
(200, 13, 1, 1, 'Azeem Khan', 39, 'Guncha Gul', NULL, '2025-07-03 07:11:56', '2025-07-03 07:11:56', NULL),
(201, 13, 1, 1, 'Jabeen Khan', 40, 'N/A', NULL, '2025-07-03 07:12:50', '2025-07-03 07:12:50', NULL),
(202, 13, 1, 1, 'Idris', 41, 'N/A', NULL, '2025-07-03 07:13:36', '2025-07-03 07:13:36', NULL),
(203, 13, 1, 1, 'Bashir Khan', 42, 'N/A', NULL, '2025-07-03 07:14:14', '2025-07-03 07:14:14', NULL),
(204, 13, 1, 1, 'Bashir Khan', 43, 'N/A', NULL, '2025-07-03 07:14:50', '2025-07-03 07:14:50', NULL),
(205, 13, 1, 1, 'Shokat', 44, 'N/A', NULL, '2025-07-03 07:15:11', '2025-07-03 07:15:11', NULL),
(206, 13, 1, 1, 'Jihangir', 45, 'N/A', NULL, '2025-07-03 07:16:09', '2025-07-03 07:16:09', NULL),
(207, 13, 1, 1, 'Nawab', 46, 'Muhammad Jalil', NULL, '2025-07-03 07:16:41', '2025-07-03 07:16:41', NULL),
(208, 13, 1, 1, 'Fazal Rahman', 47, 'Rahim Gul', NULL, '2025-07-03 07:17:05', '2025-07-03 07:17:05', NULL),
(209, 13, 1, 1, 'Mir Afzal', 48, 'Rahim Gul', '-', '2025-07-03 07:17:24', '2025-07-03 07:18:57', NULL),
(210, 13, 1, 1, 'Mian Ajmal Wagera', 49, 'N/A', NULL, '2025-07-03 07:17:50', '2025-07-03 07:17:50', NULL),
(211, 13, 1, 1, 'Sardar Husain', 50, 'Ghulam Husain', NULL, '2025-07-03 07:18:13', '2025-07-03 07:18:13', NULL),
(212, 13, 1, 1, 'Khan Afzal', 48, 'Muhammad Husain', NULL, '2025-07-03 07:19:29', '2025-07-03 07:19:29', NULL),
(213, 13, 1, 1, 'Muhammad Sharif', 51, 'Toti', NULL, '2025-07-03 07:20:09', '2025-07-03 07:20:09', NULL),
(214, 13, 1, 1, 'Sher Bahadur', 52, 'Muhammad Jalil', NULL, '2025-07-03 07:20:40', '2025-07-03 07:20:40', NULL),
(215, 13, 1, 1, 'Muhammad Sarwar', 53, 'Ghulam Sarwar', NULL, '2025-07-03 07:21:08', '2025-07-03 07:21:08', NULL),
(216, 13, 1, 1, 'Multan', 54, 'Said Baaz', NULL, '2025-07-03 07:21:50', '2025-07-03 07:21:50', NULL),
(217, 13, 1, 1, 'Shakir Ullah', 55, 'Abdur Rahman', NULL, '2025-07-03 07:22:12', '2025-07-03 07:22:12', NULL),
(218, 13, 1, 1, 'Haneem Ullah', 56, 'Khan Jan', NULL, '2025-07-03 07:22:32', '2025-07-03 07:22:32', NULL),
(219, 13, 1, 1, 'Hameed Khan', 58, 'Said Baaz', NULL, '2025-07-03 07:23:06', '2025-07-03 07:23:06', NULL),
(220, 13, 1, 1, 'Sultan', 59, 'Said Baaz', NULL, '2025-07-03 07:24:02', '2025-07-03 07:24:02', NULL),
(221, 13, 1, 1, 'Mumtaz', 60, 'Zareen', NULL, '2025-07-03 07:25:15', '2025-07-03 07:25:15', NULL),
(222, 13, 1, 1, 'Noor Rahman', 61, 'Said Baaz', NULL, '2025-07-03 07:25:43', '2025-07-03 07:25:43', NULL),
(223, 13, 1, 1, 'Sahib Zada', 62, 'Said Ahmad', NULL, '2025-07-03 07:26:12', '2025-07-03 07:26:12', NULL),
(224, 13, 1, 1, 'Ghulam Muhammad', 63, 'Azeem Khan', NULL, '2025-07-03 07:26:37', '2025-07-03 07:26:37', NULL),
(225, 13, 1, 1, 'Ghulam Hasan', 64, 'Azeem Khan', NULL, '2025-07-03 07:27:07', '2025-07-03 07:27:07', NULL),
(226, 13, 1, 1, 'Hasan Khan', 65, 'Laal Muhammad', NULL, '2025-07-03 07:27:46', '2025-07-03 07:27:46', NULL),
(227, 13, 1, 1, 'Bahadur', 66, 'Rahman Uddin', NULL, '2025-07-03 07:28:09', '2025-07-03 07:28:09', NULL),
(228, 13, 1, 1, 'Dr Iltaaf', 67, 'Muhammad Sadiq', NULL, '2025-07-03 07:28:48', '2025-07-03 07:28:48', NULL),
(229, 13, 1, 1, 'Amin Ullah', 68, 'Muhammad Raziq', NULL, '2025-07-03 07:29:09', '2025-07-03 07:29:09', NULL),
(230, 13, 1, 1, 'Sardar Ali', 69, 'Sargand', NULL, '2025-07-03 07:29:56', '2025-07-03 07:29:56', NULL),
(231, 13, 1, 1, 'Ameer Husain', 70, 'Sargand', NULL, '2025-07-03 07:30:16', '2025-07-03 07:30:16', NULL),
(232, 13, 1, 1, 'Nazeer', 71, 'Sargand', NULL, '2025-07-03 07:30:37', '2025-07-03 07:30:37', NULL),
(233, 13, 1, 1, 'Abdur Rahim', 72, 'Sardar Husain', NULL, '2025-07-03 07:31:02', '2025-07-03 07:31:02', NULL),
(234, 13, 1, 1, 'Gul Zareen', 73, 'Mirza', NULL, '2025-07-03 07:31:25', '2025-07-03 07:31:25', NULL),
(235, 13, 1, 1, 'Umaray Wagera', 75, 'N/A', NULL, '2025-07-03 07:34:35', '2025-07-03 07:34:35', NULL),
(236, 13, 1, 1, 'Umaray Wagera', 76, 'N/A', NULL, '2025-07-03 07:34:51', '2025-07-03 07:34:51', NULL),
(237, 13, 1, 1, 'Umaray Wagera', 77, 'N/A', NULL, '2025-07-03 07:35:02', '2025-07-03 07:35:02', NULL),
(238, 13, 1, 1, 'Umaray Wagera', 78, 'N/A', NULL, '2025-07-03 07:35:16', '2025-07-03 07:35:16', NULL),
(239, 13, 1, 1, 'Gul Zada', 79, 'Muhammad Jalil', NULL, '2025-07-03 07:36:07', '2025-07-03 07:36:07', NULL),
(240, 13, 1, 1, 'Sher Zada', 80, 'Muhammad Jalil', NULL, '2025-07-03 07:36:33', '2025-07-03 07:36:33', NULL),
(241, 13, 1, 1, 'Umaray Wagera', 81, 'N/A', NULL, '2025-07-03 07:37:01', '2025-07-03 07:37:01', NULL),
(242, 13, 1, 1, 'Baseer Ahmad', 83, 'Pardul', NULL, '2025-07-03 07:42:38', '2025-07-03 07:42:38', NULL),
(243, 13, 1, 1, 'Zewar', 84, 'Muhammad Rafeeq', NULL, '2025-07-03 07:43:01', '2025-07-03 07:43:01', NULL),
(244, 13, 1, 1, 'Muhammad Latif', 85, 'Pardul', NULL, '2025-07-03 07:43:28', '2025-07-03 07:43:28', NULL),
(245, 13, 1, 1, 'Mir Zada', 86, 'Sarfaraz', NULL, '2025-07-03 07:44:53', '2025-07-03 07:44:53', NULL),
(246, 13, 1, 1, 'Sahib Zada', 87, 'Said Ahmad', NULL, '2025-07-03 08:04:06', '2025-07-03 08:04:06', NULL),
(247, 13, 1, 1, 'Sirtaj', 88, 'Basir Ahmad', NULL, '2025-07-03 08:04:40', '2025-07-03 08:04:40', NULL),
(248, 13, 1, 1, 'Adil Muhammad', 89, 'Muhammad', NULL, '2025-07-03 08:05:29', '2025-07-03 08:05:29', NULL),
(249, 13, 1, 1, 'Subhan Uddin', 90, 'Rahman Uddin', NULL, '2025-07-03 08:06:08', '2025-07-03 08:06:08', NULL),
(250, 13, 1, 1, 'Zar Muhammad', 91, 'Alam Khan', NULL, '2025-07-03 08:06:47', '2025-07-03 08:06:47', NULL),
(251, 13, 1, 1, 'Azeem Khan', 92, 'Laal Baaz', NULL, '2025-07-03 08:07:20', '2025-07-03 08:07:20', NULL),
(252, 13, 1, 1, 'Gujjar', 93, 'Faiz Gul', NULL, '2025-07-03 08:08:02', '2025-07-03 08:08:02', NULL),
(253, 13, 1, 1, 'Faqeer Gul', 94, 'Faiz Gul', NULL, '2025-07-03 08:08:26', '2025-07-03 08:08:26', NULL),
(254, 13, 1, 1, 'Ayub Khan', 95, 'Umara Khan', NULL, '2025-07-03 08:08:59', '2025-07-03 08:08:59', NULL),
(255, 13, 1, 1, 'Bahadur', 96, 'Umara Khan', NULL, '2025-07-03 08:09:26', '2025-07-03 08:09:26', NULL),
(257, 13, 1, 1, 'Bahadur', 97, 'Muhammad Sharif', NULL, '2025-07-03 08:13:38', '2025-07-03 08:13:38', NULL),
(258, 13, 1, 1, 'Farid', 98, 'Muhammad Sharif', NULL, '2025-07-03 08:14:07', '2025-07-03 08:14:07', NULL),
(259, 13, 1, 1, 'Nisar Iqbal', 99, 'Muhammad Nazeef', NULL, '2025-07-03 08:14:59', '2025-07-03 08:14:59', NULL),
(260, 13, 1, 1, 'Arshad', 100, 'Muhammad Hasan', NULL, '2025-07-03 08:15:54', '2025-07-03 08:15:54', NULL),
(261, 13, 1, 1, 'Younas', 101, 'Said Hasan', NULL, '2025-07-03 08:16:38', '2025-07-03 08:16:38', NULL),
(262, 13, 1, 1, 'Hasan', 102, 'Nazeef', NULL, '2025-07-03 08:16:58', '2025-07-03 08:16:58', NULL),
(263, 13, 1, 1, 'Mir Afzal', 103, 'Muhammad Nazeef', NULL, '2025-07-03 08:17:37', '2025-07-03 08:17:37', NULL),
(264, 13, 1, 1, 'Sher Afzal', 104, 'N/A', NULL, '2025-07-03 08:18:04', '2025-07-03 08:18:04', NULL),
(265, 13, 1, 1, 'Sher Hasan', 105, 'N/A', NULL, '2025-07-03 08:18:36', '2025-07-03 08:18:36', NULL),
(266, 13, 1, 1, 'Arshad', 106, 'N/A', NULL, '2025-07-03 08:18:54', '2025-07-03 08:18:54', NULL),
(267, 13, 1, 1, 'Said Mahmood', 107, 'N/A', NULL, '2025-07-03 08:20:55', '2025-07-03 08:20:55', NULL),
(268, 13, 1, 1, 'Said Mahmood', 108, 'N/A', NULL, '2025-07-03 08:21:14', '2025-07-03 08:21:14', NULL),
(269, 13, 1, 1, 'Said Mahmood', 109, 'N/A', NULL, '2025-07-03 08:21:24', '2025-07-03 08:21:24', NULL),
(270, 13, 1, 1, 'Said Mahmood', 110, 'N/A', NULL, '2025-07-03 08:21:56', '2025-07-03 08:21:56', NULL),
(271, 13, 1, 1, 'Rahim Ullah', 111, 'Khan Jan', NULL, '2025-07-03 08:22:46', '2025-07-03 08:22:46', NULL),
(272, 13, 1, 1, 'Hazrat Ullah', 112, 'Khan Jan', NULL, '2025-07-03 08:23:13', '2025-07-03 08:23:13', NULL),
(273, 13, 1, 1, 'Karim Ullah', 113, 'Khan Jan', NULL, '2025-07-03 08:23:43', '2025-07-03 08:23:43', NULL),
(274, 13, 1, 1, 'Said Mahmud', 114, 'N/A', NULL, '2025-07-03 08:25:33', '2025-07-03 08:25:33', NULL),
(275, 13, 1, 1, 'Said Mahmood', 115, 'N/A', NULL, '2025-07-03 08:27:26', '2025-07-03 08:27:26', NULL),
(276, 13, 1, 1, 'Said Mahmood', 116, 'n/a', NULL, '2025-07-03 08:27:38', '2025-07-03 08:27:38', NULL),
(277, 13, 1, 1, 'Said Mahmood', 117, 'N/A', NULL, '2025-07-03 08:27:53', '2025-07-03 08:27:53', NULL),
(278, 13, 1, 1, 'Said Kamal', 119, 'Sarfaraz', NULL, '2025-07-03 08:30:47', '2025-07-03 08:30:47', NULL),
(279, 13, 1, 1, 'Said Mahmood', 120, 'N/A', NULL, '2025-07-03 08:31:16', '2025-07-03 08:31:16', NULL),
(280, 13, 1, 1, 'Said Mahmood', 121, 'N/A', NULL, '2025-07-03 08:32:54', '2025-07-03 08:32:54', NULL),
(281, 13, 1, 1, 'Muhammad Ullah', 122, 'Abdul Jalil', NULL, '2025-07-03 08:33:43', '2025-07-03 08:33:43', NULL),
(282, 13, 1, 1, 'Noor Ullah', 123, 'Abdul Jalil', NULL, '2025-07-03 08:34:02', '2025-07-03 08:34:02', NULL),
(284, 56, 1, 1, 'Rasool Shah Bacha', 1, 'Meer Ahmad shah', NULL, '2025-07-04 00:29:33', '2025-07-04 00:29:33', NULL),
(285, 38, 1, 1, 'Alamgir Khan', 1, 'Joher Khan', NULL, '2025-07-04 00:52:43', '2025-07-04 00:52:43', NULL),
(286, 53, 1, 1, 'Murad s/o Juma GUl', 1, 'juma gul', NULL, '2025-07-04 01:03:28', '2025-07-04 01:03:28', NULL),
(287, 41, 1, 1, 'Malak Akhaz', 3, 'Malak Noor Dil', NULL, '2025-07-04 01:26:54', '2025-07-04 01:26:54', NULL),
(289, 58, 1, 1, 'Izhar Ali Khan', 1, 'Ali Azghar Khan', NULL, '2025-07-04 02:28:48', '2025-07-04 02:28:48', NULL),
(290, 35, 1, 1, 'Ghulam', 50, 'Khan', NULL, '2025-07-04 03:35:02', '2025-07-04 03:35:02', NULL),
(292, 38, 1, 1, 'شکیل', 2, 'جوہر', '۔', '2025-07-04 03:47:59', '2025-07-04 03:47:59', '۔'),
(293, 22, 1, 1, 'Sabz Ali', 2, 'Abdul Mageed', NULL, '2025-07-04 03:48:31', '2025-07-04 03:48:31', NULL),
(295, 60, 1, 1, 'Mir afzal', 164, '...', '.....', '2025-07-04 04:47:33', '2025-07-04 04:59:05', NULL),
(296, 60, 1, 1, 'Syed Muhammad', 165, 'Gull rehman', NULL, '2025-07-04 05:01:22', '2025-07-04 05:01:22', NULL),
(297, 60, 1, 1, 'Hamish khan', 166, 'Adam khan', NULL, '2025-07-04 05:02:35', '2025-07-04 05:02:35', NULL),
(298, 60, 1, 1, 'Abdul hamid', 167, 'Rafiullah', NULL, '2025-07-04 05:03:49', '2025-07-04 05:03:49', NULL),
(299, 60, 1, 1, 'Afzal khan', 168, 'haron', NULL, '2025-07-04 05:04:48', '2025-07-04 05:04:48', NULL),
(301, 60, 1, 1, 'Khalid khan', 169, 'Haron', NULL, '2025-07-04 05:05:32', '2025-07-04 05:05:32', NULL),
(302, 60, 1, 1, 'Aslam', 170, 'Haron', NULL, '2025-07-04 05:06:00', '2025-07-04 05:06:00', NULL),
(303, 60, 1, 1, 'Anwar khan', 171, 'Haron', NULL, '2025-07-04 05:06:33', '2025-07-04 05:06:33', NULL),
(304, 60, 1, 1, 'Ismail', 172, 'Gull zada', NULL, '2025-07-04 05:07:04', '2025-07-04 05:07:04', NULL),
(305, 60, 1, 1, 'Aftihar', 172, 'Nazir Muhammad', NULL, '2025-07-04 05:08:13', '2025-07-04 05:08:13', NULL),
(306, 60, 1, 1, 'Ali rehman', 173, 'Faizullah', NULL, '2025-07-04 05:09:27', '2025-07-04 05:09:27', NULL),
(307, 47, 1, 1, 'Abdul wakeel', 1, 'Khan Bahadar', '000000000', '2025-07-04 05:19:51', '2025-07-04 05:19:51', '00000000'),
(308, 60, 1, 1, 'Mushtaq', 174, 'Nazir Muhammad', NULL, '2025-07-04 05:46:17', '2025-07-04 05:46:17', NULL),
(309, 22, 1, 1, 'janzeb khan', 5, 'magul baz khan', NULL, '2025-07-04 05:47:22', '2025-07-04 05:47:22', NULL),
(310, 60, 1, 1, 'Imtiaz', 175, 'Nazir Muhammad', NULL, '2025-07-04 05:47:26', '2025-07-04 05:47:26', NULL),
(311, 60, 1, 1, 'Ghani rehman', 176, 'Khazrat lhan', NULL, '2025-07-04 05:48:24', '2025-07-04 05:48:24', NULL),
(312, 60, 1, 1, 'Jamshid', 177, 'Ali rehman', '..', '2025-07-04 05:48:53', '2025-07-04 05:53:36', NULL),
(313, 47, 1, 1, 'Umar', 2, 'Islam', '00000000', '2025-07-04 06:13:31', '2025-07-07 07:32:48', '0000000000000'),
(315, 14, 1, 1, 'نوشاد', 2, 'محمد عمر', '۔', '2025-07-05 01:46:55', '2025-07-05 01:46:55', '۔'),
(316, 14, 1, 1, 'میر اکبر', 3, 'نور عالم', '۔', '2025-07-05 01:50:37', '2025-07-05 01:50:37', '۔'),
(317, 14, 1, 1, 'صدر/ ممتاز', 5, 'گل اکبر', '۔', '2025-07-05 01:51:26', '2025-07-05 02:11:52', '۔'),
(318, 6, 1, 1, 'عمر', 1, 'کالا خان', '0000', '2025-07-05 02:24:08', '2025-07-08 02:27:58', NULL),
(319, 6, 1, 1, 'امین خان', 2, 'اخسان علی', NULL, '2025-07-05 02:25:02', '2025-07-05 02:25:02', NULL),
(320, 6, 1, 1, 'Janus', 3, 'Abdul Malik', NULL, '2025-07-05 02:25:49', '2025-07-05 02:25:49', NULL),
(321, 14, 1, 1, 'صدبر/ خود کاشت', 6, 'گل اکبر', '۔', '2025-07-05 02:26:23', '2025-07-05 02:26:23', '۔'),
(322, 6, 1, 1, 'Tilawat', 4, 'said wali', NULL, '2025-07-05 02:26:37', '2025-07-05 02:26:37', NULL),
(323, 14, 1, 1, 'صبغت اللہ', 7, 'سلامت اللہ', '۔', '2025-07-05 02:27:59', '2025-07-05 02:27:59', '۔'),
(324, 6, 1, 1, 'Ubaid Khan', 5, 'kalla Khan', NULL, '2025-07-05 02:29:21', '2025-07-05 02:29:21', NULL),
(325, 6, 1, 1, 'Saleem', 6, 'Nawab', NULL, '2025-07-05 02:29:38', '2025-07-05 02:29:38', NULL),
(326, 6, 1, 1, 'Rafiq', 7, 'Ahmad Khan', NULL, '2025-07-05 02:30:08', '2025-07-05 02:30:08', NULL),
(327, 14, 1, 1, 'عماد', 8, 'کپور', '۔', '2025-07-05 02:30:12', '2025-07-05 02:30:12', '۔'),
(328, 6, 1, 1, 'Safdar', 8, 'shahzada', NULL, '2025-07-05 02:30:29', '2025-07-05 02:30:29', NULL),
(329, 6, 1, 1, 'Hunar', 9, 'Hazrat Gul', NULL, '2025-07-05 02:30:54', '2025-07-05 02:30:54', NULL),
(330, 6, 1, 1, 'Muzafar', 10, 'Safdar', NULL, '2025-07-05 02:31:26', '2025-07-05 02:31:26', NULL),
(331, 14, 1, 1, 'طاہر', 9, 'خواجہ محمد', '۔', '2025-07-05 02:31:36', '2025-07-05 02:31:36', '۔'),
(332, 6, 1, 1, 'Amir Zada', 11, 'Wahid Gul', NULL, '2025-07-05 02:32:03', '2025-07-05 02:32:03', NULL),
(333, 14, 1, 1, 'اقبال خان', 113, 'تاج محمد خان', '۔', '2025-07-05 02:34:28', '2025-07-05 02:34:28', '۔'),
(334, 6, 1, 1, 'Irfan', 12, 'aaaa', NULL, '2025-07-05 02:34:55', '2025-07-05 02:34:55', NULL),
(335, 6, 1, 1, 'kamran', 13, 'aaa', NULL, '2025-07-05 02:35:21', '2025-07-05 02:35:21', NULL),
(336, 14, 1, 1, 'عابداللہ', 10, 'عنایت اللہ', '۔', '2025-07-05 02:35:34', '2025-07-05 02:42:00', '۔'),
(337, 14, 1, 1, 'محمد افضل', 12, 'میر افضل', '۔', '2025-07-05 02:36:36', '2025-07-05 02:36:36', '۔'),
(338, 14, 1, 1, 'مدراراللہ', 11, 'عنایت اللہ', '۔', '2025-07-05 02:38:08', '2025-07-05 02:38:08', '۔'),
(339, 6, 1, 1, 'ؓبشر خان', 14, 'شمس القمر', NULL, '2025-07-05 02:38:37', '2025-07-05 02:38:37', NULL),
(340, 14, 1, 1, 'انعام اللہ', 13, 'عنایت اللہ', '۔', '2025-07-05 02:39:22', '2025-07-05 02:39:22', '۔'),
(341, 6, 1, 1, 'Ibrar', 15, 'Gul', NULL, '2025-07-05 02:39:22', '2025-07-05 02:39:22', NULL),
(342, 6, 1, 1, 'Imran', 16, 'Khyial Gul', NULL, '2025-07-05 02:40:18', '2025-07-05 02:40:18', NULL),
(343, 14, 1, 1, 'عبدالروف', 14, 'رحیم اللہ', '۔', '2025-07-05 02:40:43', '2025-07-05 02:40:43', '۔'),
(344, 6, 1, 1, 'Asghar Shah', 17, 'Madad', NULL, '2025-07-05 02:41:12', '2025-07-05 02:41:12', NULL),
(345, 6, 1, 1, 'Said Hassan Shah', 18, 'Shah', NULL, '2025-07-05 02:41:39', '2025-07-05 02:41:39', NULL),
(346, 6, 1, 1, 'Sabz Ali', 19, 'Zahid Gul', NULL, '2025-07-05 02:42:18', '2025-07-05 02:42:18', NULL),
(347, 6, 1, 1, 'Mategh Ullah', 20, 'Zahir Shah', NULL, '2025-07-05 02:42:52', '2025-07-05 02:42:52', NULL),
(348, 6, 1, 1, 'Hayat Ullah', 21, 'Nowshera', NULL, '2025-07-05 02:43:39', '2025-07-05 02:43:39', NULL),
(349, 6, 1, 1, 'Amin Khan', 22, 'Sawab Gul', NULL, '2025-07-05 02:44:24', '2025-07-05 02:44:24', NULL),
(350, 6, 1, 1, 'Samin Jan', 23, 'Nowshera', NULL, '2025-07-05 02:45:35', '2025-07-05 02:45:35', NULL),
(351, 6, 1, 1, 'Raweel Khan', 24, 'aa', NULL, '2025-07-05 02:46:16', '2025-07-05 02:46:16', NULL),
(352, 6, 1, 1, 'Dervesh', 25, 'Ashraf Uddin', NULL, '2025-07-05 02:46:46', '2025-07-05 02:46:46', NULL),
(353, 6, 1, 1, 'Javid', 26, 'Ghufran', NULL, '2025-07-05 02:47:09', '2025-07-05 02:47:09', NULL),
(354, 6, 1, 1, 'Samar', 27, 'Ghufran', NULL, '2025-07-05 02:47:45', '2025-07-05 02:47:45', NULL),
(355, 6, 1, 1, 'Badam Gul', 28, 'AA', NULL, '2025-07-05 02:48:27', '2025-07-05 02:48:27', NULL),
(356, 6, 1, 1, 'Abdul Ghaffar', 29, 'AA', NULL, '2025-07-05 02:48:55', '2025-07-05 02:48:55', NULL),
(357, 6, 1, 1, 'Samar Gul', 30, 'Aa', NULL, '2025-07-05 02:49:16', '2025-07-05 02:49:16', NULL),
(358, 6, 1, 1, 'Lal Bacha', 31, 'Saida Gul', NULL, '2025-07-05 02:49:40', '2025-07-05 02:49:40', NULL),
(359, 6, 1, 1, 'Safdar', 32, 'Aman Ullah', NULL, '2025-07-05 02:50:01', '2025-07-05 02:50:01', NULL),
(360, 6, 1, 1, 'Saleem', 33, 'Mir Ghazan', NULL, '2025-07-05 02:50:37', '2025-07-05 02:50:37', NULL),
(361, 6, 1, 1, 'Jamrooz Khan', 34, 'Mir Ghazan', NULL, '2025-07-05 02:51:10', '2025-07-05 02:51:10', NULL),
(362, 6, 1, 1, 'Amir', 35, 'shaokat', NULL, '2025-07-05 02:51:36', '2025-07-05 02:51:36', NULL),
(363, 6, 1, 1, 'Sar Biland', 36, 'Dolat', NULL, '2025-07-05 02:52:02', '2025-07-05 02:52:02', NULL),
(364, 6, 1, 1, 'Jan', 37, 'Saida Gul', NULL, '2025-07-05 02:52:35', '2025-07-05 02:52:35', NULL),
(365, 6, 1, 1, 'Waheed', 38, 'Mufarh Shah', NULL, '2025-07-05 02:52:55', '2025-07-05 02:52:55', NULL),
(366, 6, 1, 1, 'Danish', 39, 'Kashmir', NULL, '2025-07-05 02:53:22', '2025-07-05 02:53:22', NULL),
(367, 6, 1, 1, 'بخار خان', 40, 'حاجی اکرم خان', NULL, '2025-07-05 02:54:38', '2025-07-05 02:54:38', NULL),
(368, 6, 1, 1, 'Ansar Khan', 41, 'Afsar Khan', NULL, '2025-07-05 02:55:15', '2025-07-05 02:55:15', NULL),
(369, 6, 1, 1, 'Abdur Razaq', 42, 'Amir Abbas', NULL, '2025-07-05 02:55:41', '2025-07-05 02:55:41', NULL),
(370, 6, 1, 1, 'Zawar Hussain', 43, 'Awal Gul', NULL, '2025-07-05 02:56:07', '2025-07-05 02:56:07', NULL),
(371, 6, 1, 1, 'Saif Ullah', 44, 'Said Badshah', NULL, '2025-07-05 02:56:31', '2025-07-05 02:56:31', NULL),
(372, 6, 1, 1, 'Zaman Khan', 45, 'Awal Khan', NULL, '2025-07-05 02:56:56', '2025-07-05 02:56:56', NULL),
(373, 6, 1, 1, 'Sahamas', 46, 'Muzamil', NULL, '2025-07-05 02:57:28', '2025-07-05 02:57:28', NULL),
(374, 6, 1, 1, 'Shah Gul', 47, 'Aa', NULL, '2025-07-05 02:57:59', '2025-07-05 02:57:59', NULL),
(375, 6, 1, 1, 'Akhtar Ali shah', 48, 'Gohar Ali Shah', NULL, '2025-07-05 02:58:25', '2025-07-05 02:58:25', NULL),
(376, 6, 1, 1, 'Gohar Ali shah', 49, 'Now', NULL, '2025-07-05 02:58:47', '2025-07-05 02:58:47', NULL),
(377, 6, 1, 1, 'Muslim Shah', 50, 'Khan', NULL, '2025-07-05 02:59:11', '2025-07-05 02:59:11', NULL),
(378, 6, 1, 1, 'Ghazi', 51, 'Sher Ali', NULL, '2025-07-05 02:59:30', '2025-07-05 02:59:30', NULL),
(379, 6, 1, 1, 'Zahid', 52, 'Painda', NULL, '2025-07-05 03:00:05', '2025-07-05 03:00:05', NULL),
(380, 6, 1, 1, 'Mazhar Ul Haq', 53, 'Mohsin Ul Haq', NULL, '2025-07-05 03:00:37', '2025-07-05 03:00:37', NULL),
(381, 6, 1, 1, 'Muhammad Shah', 54, 'samin', NULL, '2025-07-05 03:01:34', '2025-07-05 03:01:34', NULL),
(382, 6, 1, 1, 'Fatih Khan', 55, 'Khalid', NULL, '2025-07-05 03:01:59', '2025-07-05 03:01:59', NULL),
(383, 6, 1, 1, 'Rahmat Ullah', 56, 'aa', NULL, '2025-07-05 03:02:20', '2025-07-05 03:02:20', NULL),
(384, 6, 1, 1, 'Qadir', 57, 'Abdul Ghafar', NULL, '2025-07-05 03:02:47', '2025-07-05 03:02:47', NULL),
(385, 6, 1, 1, 'Fayaz Khan', 58, 'Said Ghulam', NULL, '2025-07-05 03:03:13', '2025-07-05 03:03:13', NULL),
(386, 14, 1, 1, 'صوبیدار رضا خان', 15, 'عنایت اللہ', '۔', '2025-07-05 03:03:26', '2025-07-05 03:03:26', '۔'),
(387, 6, 1, 1, 'Sultan', 59, 'Gul Muhammad', NULL, '2025-07-05 03:04:00', '2025-07-05 03:04:00', NULL),
(388, 6, 1, 1, 'Ali Akbar', 60, 'kaki', NULL, '2025-07-05 03:04:23', '2025-07-05 03:04:23', NULL),
(389, 6, 1, 1, 'Akabar Khan', 61, 'Gul Akbar', NULL, '2025-07-05 03:05:01', '2025-07-05 03:05:01', NULL),
(390, 6, 1, 1, 'Gul Zada', 62, 'Kachkol', NULL, '2025-07-05 03:05:22', '2025-07-05 03:05:22', NULL),
(391, 14, 1, 1, 'خادم', 16, 'ولی محمد', '۔', '2025-07-05 03:05:47', '2025-07-05 03:05:47', '۔'),
(392, 6, 1, 1, 'Umar Khan', 63, 'Gul Muhammad', NULL, '2025-07-05 03:05:52', '2025-07-05 03:05:52', NULL),
(393, 6, 1, 1, 'Said Muhammad', 64, 'Mir Ahmad', NULL, '2025-07-05 03:06:50', '2025-07-05 03:06:50', NULL),
(394, 14, 1, 1, 'عقیل احمد', 17, 'مختیار احمد', '۔', '2025-07-05 03:07:23', '2025-07-05 03:07:23', '۔'),
(395, 6, 1, 1, 'Khan', 65, 'Said Ghulam', NULL, '2025-07-05 03:07:37', '2025-07-05 03:07:37', NULL),
(396, 14, 1, 1, 'مقصود', 18, 'عبد الخالق', '۔', '2025-07-05 03:08:41', '2025-07-05 03:08:41', '۔'),
(397, 6, 1, 1, 'Wajid Ul Haq', 66, 'Mohsin Ul Haq', NULL, '2025-07-05 03:08:44', '2025-07-05 03:08:44', NULL),
(398, 6, 1, 1, 'Manzoor Ul Haq', 67, 'Mohsin Ul Haq', NULL, '2025-07-05 03:09:14', '2025-07-05 03:09:14', NULL),
(399, 14, 1, 1, 'طلاء', 19, 'حبیب اللہ', '۔', '2025-07-05 03:09:41', '2025-07-05 03:09:41', '۔'),
(400, 6, 1, 1, 'Manir Ul Haq', 68, 'Mohsin Ul Haq', NULL, '2025-07-05 03:09:46', '2025-07-05 03:09:46', NULL),
(401, 6, 1, 1, 'Zahir', 69, 'Fida Muhammad', NULL, '2025-07-05 03:10:13', '2025-07-05 03:10:13', NULL),
(402, 14, 1, 1, 'امیر محمد', 20, 'میر افضل', '۔', '2025-07-05 03:11:13', '2025-07-05 03:11:13', '۔'),
(403, 14, 1, 1, 'مصباح اللہ', 23, '23', '۔', '2025-07-05 03:24:53', '2025-07-05 03:24:53', '۔'),
(404, 14, 1, 1, 'نصر اللہ', 21, 'کپور', '۔', '2025-07-05 03:31:50', '2025-07-05 03:31:50', '۔'),
(405, 14, 1, 1, 'سردار علی', 4, 'سید اکبر', '۔', '2025-07-05 03:33:44', '2025-07-05 03:33:44', '۔'),
(406, 14, 1, 1, 'امان اللہ / عماد', 22, 'امان اللہ ولد اکبر/ عماد ولد کپور', NULL, '2025-07-05 03:39:21', '2025-07-05 03:39:21', NULL),
(407, 14, 1, 1, 'سردار', 24, 'نثار', '۔', '2025-07-05 03:41:51', '2025-07-05 03:41:51', '۔'),
(408, 14, 1, 1, 'عبد الخالق', 25, 'میر افضل', '۔', '2025-07-05 03:46:59', '2025-07-05 03:46:59', '۔'),
(409, 14, 1, 1, 'کامران', 26, 'عبد الواحد', '۔', '2025-07-05 03:48:05', '2025-07-05 03:48:05', '۔'),
(410, 14, 1, 1, 'ماجد', 27, 'عبد الواحد', '۔', '2025-07-05 03:50:00', '2025-07-05 03:50:00', '۔'),
(411, 14, 1, 1, 'منظور محمد', 28, 'ظہور محمد', '۔', '2025-07-05 03:51:32', '2025-07-05 03:51:32', '۔'),
(412, 14, 1, 1, 'ولی داد', 29, 'میر داد', '۔', '2025-07-05 03:52:09', '2025-07-05 03:53:15', '۔'),
(413, 22, 1, 1, 'wazeer muhammad', 6, 'abdul kareem', NULL, '2025-07-05 03:53:51', '2025-07-05 03:53:51', NULL),
(414, 14, 1, 1, 'عبد الرحمن', 34, 'محمد', '۔', '2025-07-05 03:58:41', '2025-07-05 03:58:41', '۔'),
(415, 14, 1, 1, 'عالمگیر خان', 35, 'نثار', '۔', '2025-07-05 04:04:38', '2025-07-05 04:04:38', '۔'),
(416, 22, 1, 1, 'ameer muhammad', 7, 'abdol karem', NULL, '2025-07-05 05:37:43', '2025-07-05 05:37:43', NULL),
(417, 60, 1, 1, 'Shamshad khan', 1, 'Muhammad amin', '.....', '2025-07-05 08:19:26', '2025-07-05 08:24:41', NULL),
(418, 60, 1, 1, 'Abnee amin', 2, 'Gull farist', NULL, '2025-07-05 08:22:31', '2025-07-05 08:22:31', NULL),
(419, 60, 1, 1, 'Muhammad umar', 3, 'Muhammad ameen', '..', '2025-07-05 08:23:19', '2025-07-05 08:24:08', NULL),
(420, 60, 1, 1, 'Taj Muhammad', 4, 'Muhammad ameen', NULL, '2025-07-05 08:25:37', '2025-07-05 08:25:37', NULL),
(421, 60, 1, 1, 'Ghazin', 5, 'Muhammad ameen', NULL, '2025-07-05 08:26:28', '2025-07-05 08:26:28', NULL),
(422, 60, 1, 1, 'Noor khan', 6, 'Muhammad umar', NULL, '2025-07-05 08:27:32', '2025-07-05 08:27:32', NULL),
(423, 60, 1, 1, 'Shah hussain', 7, 'Meer alam', NULL, '2025-07-05 08:28:26', '2025-07-05 08:28:26', NULL),
(424, 60, 1, 1, 'Razi khan', 8, 'Aziz khan', NULL, '2025-07-05 08:28:55', '2025-07-05 08:28:55', NULL),
(425, 60, 1, 1, 'Niyaz Muhammad', 9, 'Ameer  khan', NULL, '2025-07-05 08:30:11', '2025-07-05 08:30:11', NULL),
(426, 60, 1, 1, 'Ayub khan', 10, 'Rasool khan', NULL, '2025-07-05 08:31:01', '2025-07-05 08:31:01', NULL),
(427, 60, 1, 1, 'Akbir ali', 11, 'Amish khan', '.....', '2025-07-05 08:32:07', '2025-07-05 08:38:27', NULL),
(428, 60, 1, 1, 'Jafir khan', 12, 'Ghulam nabi', NULL, '2025-07-05 08:42:34', '2025-07-05 08:42:34', '..'),
(429, 60, 1, 1, 'Rishad', 13, 'Muhammad hussain', NULL, '2025-07-05 08:44:26', '2025-07-05 08:44:26', NULL),
(430, 60, 1, 1, 'Fazal subhan', 14, 'Ghulam nabi', NULL, '2025-07-05 08:45:15', '2025-07-05 08:45:15', NULL),
(431, 60, 1, 1, 'Inzar gull', 15, 'Syed wazir', NULL, '2025-07-05 08:46:25', '2025-07-05 08:46:25', NULL),
(432, 60, 1, 1, 'Qalim jan', 16, 'Mula jan', NULL, '2025-07-05 08:47:12', '2025-07-05 08:47:12', NULL),
(433, 60, 1, 1, 'Sher Ali khan', 17, 'Gujar', NULL, '2025-07-05 08:48:43', '2025-07-05 08:48:43', NULL),
(434, 60, 1, 1, 'Kirnal abdullaziz', 18, 'Muhammad', NULL, '2025-07-05 08:49:46', '2025-07-05 08:49:46', NULL),
(435, 60, 1, 1, 'Muzafir', 19, 'Meer alem', NULL, '2025-07-05 08:50:32', '2025-07-05 08:50:32', NULL),
(436, 60, 1, 1, 'Sirfraz', 20, 'Dilawer', NULL, '2025-07-05 08:51:33', '2025-07-05 08:51:33', NULL),
(437, 60, 1, 1, 'Lal badshah', 21, 'Ameer Muhammad', NULL, '2025-07-05 08:53:32', '2025-07-05 08:53:32', NULL),
(438, 60, 1, 1, 'Kechkol', 22, 'Kabel', NULL, '2025-07-05 08:54:32', '2025-07-05 08:54:32', NULL),
(439, 60, 1, 1, 'Muhammad anwar', 23, 'Faqir gull', NULL, '2025-07-05 08:55:20', '2025-07-05 08:55:20', NULL),
(440, 60, 1, 1, 'Khosh dell khan', 24, 'Gujar', NULL, '2025-07-05 08:55:55', '2025-07-05 08:55:55', NULL),
(441, 60, 1, 1, 'Israr jan', 25, 'Akbir khan', NULL, '2025-07-05 08:57:23', '2025-07-05 08:57:23', NULL),
(442, 60, 1, 1, 'Sahib  zada', 26, 'Kher jan', NULL, '2025-07-05 08:58:18', '2025-07-05 08:58:18', NULL),
(443, 60, 1, 1, 'Muhammad jan', 27, 'Hestam', NULL, '2025-07-05 09:00:01', '2025-07-05 09:00:01', NULL),
(444, 60, 1, 1, 'Ghulam Muhammad', 28, 'Muhammad ameen', NULL, '2025-07-05 09:00:49', '2025-07-05 09:00:49', NULL),
(445, 60, 1, 1, 'Farmanullah', 29, 'Akbir khan', NULL, '2025-07-05 09:02:17', '2025-07-05 09:02:17', NULL),
(446, 60, 1, 1, 'Islah khudin', 30, 'Akbir khan', NULL, '2025-07-05 09:03:08', '2025-07-05 09:03:08', NULL),
(447, 60, 1, 1, 'Abdull manan', 31, 'Abdull matin', NULL, '2025-07-05 09:04:19', '2025-07-05 09:04:19', NULL),
(449, 60, 1, 1, 'Abdull salam', 32, 'Sahib zada', NULL, '2025-07-05 09:10:49', '2025-07-05 09:10:49', NULL),
(450, 60, 1, 1, 'Ajmil khan', 33, 'Akbir Khan', NULL, '2025-07-05 09:12:04', '2025-07-05 09:12:04', NULL),
(451, 60, 1, 1, 'Bashir', 34, 'Anwar khan', NULL, '2025-07-05 09:12:32', '2025-07-05 09:12:32', NULL),
(452, 60, 1, 1, 'Spend Muhammad', 35, 'Lal Muhammad', '.....', '2025-07-05 09:15:03', '2025-07-05 09:18:43', NULL),
(453, 60, 1, 1, 'Sahib agha jan', 36, 'Syed wazir', NULL, '2025-07-05 09:15:55', '2025-07-05 09:15:55', NULL),
(454, 60, 1, 1, 'Qaidullah', 37, 'Abdull hanain', NULL, '2025-07-05 09:17:04', '2025-07-05 09:17:04', NULL),
(455, 60, 1, 1, 'Nasir ali', 38, 'Saifurehman', NULL, '2025-07-05 09:21:32', '2025-07-05 09:21:32', NULL),
(456, 60, 1, 1, 'Hashim khan', 39, 'Alam khan', NULL, '2025-07-05 09:22:38', '2025-07-05 09:22:38', NULL),
(457, 60, 1, 1, 'Jawid', 40, '..', NULL, '2025-07-05 09:23:04', '2025-07-05 09:23:04', NULL),
(458, 60, 1, 1, 'Fatihurehman', 41, 'Zayarit khan', NULL, '2025-07-05 09:24:20', '2025-07-05 09:24:20', NULL),
(459, 4, 1, 1, 'Shamsher', 14, 'Firdos Khan', NULL, '2025-07-05 10:31:15', '2025-07-05 10:31:15', NULL),
(460, 4, 1, 1, 'Jamsheed', 13, 'Umar Dos', NULL, '2025-07-05 10:32:35', '2025-07-05 10:32:35', NULL),
(461, 4, 1, 1, 'Sabz Ali', 15, 'Meher Sadeeq', NULL, '2025-07-05 10:34:19', '2025-07-05 10:34:19', NULL),
(462, 4, 1, 1, 'Muhammad Ali', 16, 'Meher Sadeeq', NULL, '2025-07-05 10:34:37', '2025-07-05 10:34:37', NULL),
(463, 4, 1, 1, 'Abul Kalam', 17, 'Meher Sadeeq', NULL, '2025-07-05 10:34:57', '2025-07-05 10:34:57', NULL),
(464, 4, 1, 1, 'Umber Shah', 18, 'Umar Dad', NULL, '2025-07-05 10:35:23', '2025-07-05 10:35:23', NULL),
(465, 4, 1, 1, 'Saleem Shah', 19, 'Umar Dad', NULL, '2025-07-05 10:36:02', '2025-07-05 10:36:02', NULL),
(466, 4, 1, 1, 'Fazal Amin', 20, 'Abdur Rauf', NULL, '2025-07-05 10:36:34', '2025-07-05 10:36:34', NULL),
(467, 4, 1, 1, 'Nabi Amin', 21, 'Abdur Rauf', NULL, '2025-07-05 10:37:05', '2025-07-05 10:37:05', NULL),
(468, 4, 1, 1, 'Ali Akbar', 22, 'Sajeed Gul', NULL, '2025-07-05 10:40:43', '2025-07-05 10:40:43', NULL),
(469, 4, 1, 1, 'Dilawar', 23, 'Manay', NULL, '2025-07-05 10:41:29', '2025-07-05 10:41:29', NULL),
(470, 4, 1, 1, 'Ali Asghar', 24, 'Ubaid Khan', NULL, '2025-07-05 10:42:10', '2025-07-05 10:42:10', NULL),
(471, 4, 1, 1, 'Baswar', 25, 'Wali Bahadar', NULL, '2025-07-05 10:42:37', '2025-07-05 10:42:37', NULL),
(472, 4, 1, 1, 'Shad Ali', 26, 'Liaqat Ali', NULL, '2025-07-05 10:43:21', '2025-07-05 10:43:21', NULL),
(473, 12, 1, 1, 'Majid', 3, 'Muhammad Baaz', NULL, '2025-07-06 00:46:11', '2025-07-06 00:46:11', NULL),
(474, 12, 1, 1, 'Sher Ali', 4, 'Mir Afzal', NULL, '2025-07-06 00:47:27', '2025-07-06 00:47:27', NULL),
(475, 12, 1, 1, 'Awal Deen', 5, 'N/A', NULL, '2025-07-06 00:54:00', '2025-07-06 00:54:00', NULL),
(476, 12, 1, 1, 'Wazir', 6, 'Toor Baaz', NULL, '2025-07-06 00:54:17', '2025-07-06 00:54:17', NULL),
(477, 12, 1, 1, 'Amir Shah', 7, 'Rahim Gul', NULL, '2025-07-06 00:54:37', '2025-07-06 00:54:37', NULL),
(478, 12, 1, 1, 'Aziz Ul Hakeem', 8, 'Toor', NULL, '2025-07-06 00:55:02', '2025-07-06 00:55:02', NULL),
(479, 12, 1, 1, 'Noor Ul Haq', 9, 'Toor', NULL, '2025-07-06 00:55:32', '2025-07-06 00:55:32', NULL),
(480, 12, 1, 1, 'Sher Ali', 10, 'Toor', NULL, '2025-07-06 00:55:54', '2025-07-06 00:55:54', NULL),
(481, 12, 1, 1, 'Fakhri Alam', 11, 'Dr. Muhamam Gul', NULL, '2025-07-06 00:57:48', '2025-07-06 00:57:48', NULL),
(482, 12, 1, 1, 'Ali Rahman', 12, 'Awal Khan', NULL, '2025-07-06 00:58:12', '2025-07-06 00:58:12', NULL),
(483, 12, 1, 1, 'Ashraf', 13, 'Said Rahman', NULL, '2025-07-06 00:58:31', '2025-07-06 00:58:31', NULL),
(484, 12, 1, 1, 'Jamshed', 14, 'Awal Khan', NULL, '2025-07-06 00:58:56', '2025-07-06 00:58:56', NULL),
(485, 12, 1, 1, 'Javed', 15, 'Awal Khan', NULL, '2025-07-06 00:59:15', '2025-07-06 00:59:15', NULL),
(486, 12, 1, 1, 'Haji Abdul Majeed', 16, 'Shah Khan', NULL, '2025-07-06 00:59:53', '2025-07-06 00:59:53', NULL),
(487, 12, 1, 1, 'Nisar', 17, 'Fazal Subhan', NULL, '2025-07-06 01:00:30', '2025-07-06 01:00:30', NULL),
(488, 12, 1, 1, 'Ikram', 18, 'Karim Bakhsh', NULL, '2025-07-06 01:00:57', '2025-07-06 01:00:57', NULL),
(489, 12, 1, 1, 'Akram Khan', 19, 'Mir Wali', NULL, '2025-07-06 01:01:40', '2025-07-06 01:01:40', NULL),
(490, 12, 1, 1, 'Iqbal', 20, 'Sarwar', NULL, '2025-07-06 01:01:59', '2025-07-06 01:01:59', NULL),
(491, 12, 1, 1, 'Muhammad Nazir', 21, 'Nawab Khan', NULL, '2025-07-06 01:02:32', '2025-07-06 01:02:32', NULL),
(492, 12, 1, 1, 'Aslam', 22, 'Atai Khan', NULL, '2025-07-06 01:02:56', '2025-07-06 01:02:56', NULL),
(493, 12, 1, 1, 'Tahseen Ullah', 23, 'Hanif Khan', NULL, '2025-07-06 01:03:33', '2025-07-06 01:03:33', NULL),
(494, 12, 1, 1, 'Wisal Ahmad Khan', 24, 'Fazal Qadar', NULL, '2025-07-06 01:04:07', '2025-07-06 01:04:07', NULL),
(495, 12, 1, 1, 'Nadar', 25, 'Bao Jan', NULL, '2025-07-06 01:04:54', '2025-07-06 01:04:54', NULL),
(496, 12, 1, 1, 'Farooq Jan', 26, 'Bao Jan', NULL, '2025-07-06 01:05:42', '2025-07-06 01:05:42', NULL),
(497, 12, 1, 1, 'Zareen', 27, 'Bao Jan', NULL, '2025-07-06 01:06:07', '2025-07-06 01:06:07', NULL),
(498, 12, 1, 1, 'Awal Khan', 28, 'Hanif Ullah', NULL, '2025-07-06 01:06:43', '2025-07-06 01:06:43', NULL),
(499, 12, 1, 1, 'Ridar', 29, 'Wali Khan', NULL, '2025-07-06 01:07:13', '2025-07-06 01:07:13', NULL),
(500, 12, 1, 1, 'Faqir Mula Gujjar', 30, 'N/A', NULL, '2025-07-06 01:09:26', '2025-07-06 01:09:26', NULL),
(501, 12, 1, 1, 'Taj Muhammad', 31, 'N/A', NULL, '2025-07-06 01:10:37', '2025-07-06 01:10:37', NULL),
(502, 12, 1, 1, 'Aslam', 32, 'Bao Jan', NULL, '2025-07-06 01:11:02', '2025-07-06 01:11:02', NULL),
(503, 12, 1, 1, 'Tila Muhammad', 33, 'Sher Muhammad', NULL, '2025-07-06 01:11:24', '2025-07-06 01:11:24', NULL),
(504, 12, 1, 1, 'Faqir Mula Gujar Relative', 34, 'N/A', NULL, '2025-07-06 01:12:17', '2025-07-06 01:12:17', NULL),
(505, 12, 1, 1, 'Saifur Gujjar', 35, 'N/A', NULL, '2025-07-06 01:16:42', '2025-07-06 01:16:42', NULL),
(506, 12, 1, 1, 'Saleem', 37, 'Bakhtiar', '-', '2025-07-06 01:17:11', '2025-07-06 01:22:01', NULL);
INSERT INTO `irrigators` (`id`, `village_id`, `div_id`, `canal_id`, `irrigator_name`, `irrigator_khata_number`, `irrigator_f_name`, `irrigator_mobile_number`, `created_at`, `updated_at`, `cnic`) VALUES
(507, 12, 1, 1, 'Masil – Swabi', 36, 'N/A', NULL, '2025-07-06 01:22:08', '2025-07-06 01:22:08', NULL),
(508, 12, 1, 1, 'Zaib Ullah', 38, 'Sharif Ullah', NULL, '2025-07-06 01:23:02', '2025-07-06 01:23:02', NULL),
(509, 12, 1, 1, 'Jamal Shah', 39, 'N/A', NULL, '2025-07-06 01:23:30', '2025-07-06 01:23:30', NULL),
(510, 12, 1, 1, 'Abdul Karim', 40, 'Abdul Hakeem', NULL, '2025-07-06 01:24:24', '2025-07-06 01:24:24', NULL),
(511, 12, 1, 1, 'Nasir', 41, 'Khan Jan', NULL, '2025-07-06 01:25:51', '2025-07-06 01:25:51', NULL),
(512, 12, 1, 1, 'Said Rahman', 42, 'N/A', NULL, '2025-07-06 01:26:23', '2025-07-06 01:26:23', NULL),
(513, 12, 1, 1, 'Amaan Gul', 43, 'N/A', NULL, '2025-07-06 01:27:35', '2025-07-06 01:27:35', NULL),
(514, 12, 1, 1, 'Shafeeq Gujjar', 44, 'N/A', NULL, '2025-07-06 01:28:28', '2025-07-06 01:28:28', NULL),
(515, 12, 1, 1, 'Sardar', 45, 'Muhammad Gul', NULL, '2025-07-06 01:29:00', '2025-07-06 01:29:00', NULL),
(516, 12, 1, 1, 'Sahib Gul', 46, 'Laal Muhammad', NULL, '2025-07-06 01:29:38', '2025-07-06 01:29:38', NULL),
(517, 12, 1, 1, 'Said Muhammad', 47, 'Sultan Muhammad', NULL, '2025-07-06 01:30:54', '2025-07-06 01:30:54', NULL),
(518, 12, 1, 1, 'Gul Muhammad', 48, 'Sultan Muhammad', NULL, '2025-07-06 01:31:32', '2025-07-06 01:31:32', NULL),
(519, 12, 1, 1, 'Zareef Khan', 49, 'Sultan Muhammad', NULL, '2025-07-06 01:32:14', '2025-07-06 01:32:14', NULL),
(520, 12, 1, 1, 'Sarfaraz', 50, 'Sultan Muhammad', NULL, '2025-07-06 01:32:29', '2025-07-06 01:32:29', NULL),
(521, 12, 1, 1, 'Taj Muhammad', 51, 'Zar Muhammad', NULL, '2025-07-06 01:42:57', '2025-07-06 01:42:57', NULL),
(522, 12, 1, 1, 'Muhammad Alam', 52, 'Ghulam Muhammad', NULL, '2025-07-06 01:43:23', '2025-07-06 01:43:23', NULL),
(523, 12, 1, 1, 'Sardar', 53, 'Ghulam Muhammad', NULL, '2025-07-06 01:43:47', '2025-07-06 01:43:47', NULL),
(524, 12, 1, 1, 'Muhammad Ismail', 54, 'Alam Khan', NULL, '2025-07-06 01:44:09', '2025-07-06 01:44:09', NULL),
(525, 12, 1, 1, 'Muhammad Zaman', 55, 'Ghulam Muhammad', NULL, '2025-07-06 01:44:34', '2025-07-06 01:44:34', NULL),
(526, 12, 1, 1, 'Muhammad Nazeer', 56, 'Ghulam Jilani', NULL, '2025-07-06 01:45:22', '2025-07-06 01:45:22', NULL),
(527, 12, 1, 1, 'Khurshid', 57, 'Ghulam Muhammad', NULL, '2025-07-06 01:45:53', '2025-07-06 01:45:53', NULL),
(528, 12, 1, 1, 'Abdul Khaliq', 58, 'Akbar Khan', NULL, '2025-07-06 01:46:21', '2025-07-06 01:46:21', NULL),
(529, 12, 1, 1, 'Said Muhammad', 59, 'Sultan Muhammad', NULL, '2025-07-06 01:47:36', '2025-07-06 01:47:36', NULL),
(530, 12, 1, 1, 'Aman Ullah', 60, 'Ghulam Muhammad', NULL, '2025-07-06 01:49:08', '2025-07-06 01:49:08', NULL),
(531, 12, 1, 1, 'Muhammad Iqbal', 61, 'Shakar Khan', NULL, '2025-07-06 01:49:39', '2025-07-06 01:49:39', NULL),
(532, 12, 1, 1, 'Sherin', 62, 'Zarin', NULL, '2025-07-06 01:50:23', '2025-07-06 01:50:23', NULL),
(533, 12, 1, 1, 'Laal Jan', 63, 'N/A', NULL, '2025-07-06 01:50:43', '2025-07-06 01:50:43', NULL),
(534, 12, 1, 1, 'Zakir', 64, 'Laal Jan', NULL, '2025-07-06 01:51:25', '2025-07-06 01:51:25', NULL),
(535, 12, 1, 1, 'Aziz Ullah', 65, 'Zar Muhammad', NULL, '2025-07-06 01:52:05', '2025-07-06 01:52:05', NULL),
(536, 12, 1, 1, 'Khan Muhammad', 67, 'Sultan Muhammad', NULL, '2025-07-06 01:52:32', '2025-07-06 01:52:32', NULL),
(537, 12, 1, 1, 'Laal Muhammad', 68, 'Sultan Muhammad', NULL, '2025-07-06 01:53:01', '2025-07-06 01:53:01', NULL),
(538, 12, 1, 1, 'Shahid Khan', 69, 'Dost Muhammad Khan', NULL, '2025-07-06 01:54:56', '2025-07-06 01:54:56', NULL),
(539, 12, 1, 1, 'Gul Karam', 70, 'Akbar Khan', NULL, '2025-07-06 01:55:23', '2025-07-06 01:55:23', NULL),
(540, 12, 1, 1, 'Shahid Khan', 71, 'Dost Muhammad Khan', NULL, '2025-07-06 02:01:47', '2025-07-06 02:01:47', NULL),
(541, 12, 1, 1, 'Shahid Khan', 72, 'Dost Muhammad Khan', NULL, '2025-07-06 02:03:20', '2025-07-06 02:03:20', NULL),
(542, 12, 1, 1, 'Shahid Khan', 73, 'Dost Muhammad Khan', NULL, '2025-07-06 02:03:42', '2025-07-06 02:03:42', NULL),
(543, 12, 1, 1, 'Shahid Khan', 74, 'Dost Muhammad Khan', NULL, '2025-07-06 02:04:10', '2025-07-06 02:04:10', NULL),
(544, 12, 1, 1, 'Shahid Khan', 75, 'Dost Muhammad Khan', NULL, '2025-07-06 02:04:30', '2025-07-06 02:04:30', NULL),
(545, 12, 1, 1, 'Shahid Khan', 76, 'Dost Muhammad Khan', NULL, '2025-07-06 02:04:48', '2025-07-06 02:04:48', NULL),
(546, 12, 1, 1, 'Shahid Khan', 77, 'Dost Muhammad Khan', NULL, '2025-07-06 02:05:12', '2025-07-06 02:05:12', NULL),
(547, 12, 1, 1, 'Muhammad Din', 78, 'Jumma Gul', NULL, '2025-07-06 02:07:43', '2025-07-06 02:07:43', NULL),
(548, 12, 1, 1, 'Muhammad Gul', 79, 'Jumma Gul', NULL, '2025-07-06 02:08:05', '2025-07-06 02:08:05', NULL),
(549, 12, 1, 1, 'Adam', 80, 'Akram Jan', NULL, '2025-07-06 02:12:27', '2025-07-06 02:12:27', NULL),
(550, 12, 1, 1, 'Mustaqil Shah', 82, 'Naqeeb Shah', NULL, '2025-07-06 02:13:13', '2025-07-06 02:13:13', NULL),
(551, 12, 1, 1, 'Sher Bahadur', 83, 'Bahadur', NULL, '2025-07-06 02:13:37', '2025-07-06 02:13:37', NULL),
(552, 12, 1, 1, 'Nadar', 84, 'Mutabar', NULL, '2025-07-06 02:14:14', '2025-07-06 02:14:14', NULL),
(553, 12, 1, 1, 'Ali Rahman', 85, 'Jumma Khan', NULL, '2025-07-06 02:15:05', '2025-07-06 02:15:05', NULL),
(554, 12, 1, 1, 'Abdul Malik, Muslim', 86, 'Khaista Rasool', NULL, '2025-07-06 02:19:59', '2025-07-06 02:19:59', NULL),
(555, 12, 1, 1, 'Said Kamal', 87, 'Abdur Rahman', NULL, '2025-07-06 02:20:29', '2025-07-06 02:20:29', NULL),
(556, 12, 1, 1, 'Muhammad Amin', 88, 'Abdur Rahman', NULL, '2025-07-06 02:20:59', '2025-07-06 02:20:59', NULL),
(557, 12, 1, 1, 'Said Amin', 89, 'Jumma Khan', NULL, '2025-07-06 02:21:48', '2025-07-06 02:21:48', NULL),
(558, 12, 1, 1, 'Said Rahman', 90, 'Abdur Rahman', NULL, '2025-07-06 02:22:07', '2025-07-06 02:22:07', NULL),
(559, 12, 1, 1, 'Muhammad Ali', 91, 'Fazal Rahman', NULL, '2025-07-06 02:22:44', '2025-07-06 02:22:44', NULL),
(560, 12, 1, 1, 'Muhammad Ali', 92, 'Fazal Rahman', NULL, '2025-07-06 02:23:47', '2025-07-06 02:23:47', NULL),
(561, 12, 1, 1, 'Said Rahman', 93, 'Ameer Khan', NULL, '2025-07-06 02:25:41', '2025-07-06 02:25:41', NULL),
(562, 12, 1, 1, 'Wahid Ullah', 94, 'Noor Muhammad', NULL, '2025-07-06 02:26:03', '2025-07-06 02:26:03', NULL),
(563, 12, 1, 1, 'Hameed Ullah', 95, 'Noor Muhammad', NULL, '2025-07-06 02:26:32', '2025-07-06 02:26:32', NULL),
(564, 12, 1, 1, 'Khan Ullah', 96, 'Hazrat Shah', NULL, '2025-07-06 02:27:01', '2025-07-06 02:27:01', NULL),
(565, 12, 1, 1, 'Rahman Ullah', 97, 'Hazrat Shah', NULL, '2025-07-06 02:27:28', '2025-07-06 02:27:28', NULL),
(566, 12, 1, 1, 'Muhammad Zahid', 98, 'Dost Muhammad Khan', NULL, '2025-07-06 02:28:12', '2025-07-06 02:28:12', NULL),
(567, 12, 1, 1, 'Sultan Muhammad', 99, 'Ameer Muhammad', NULL, '2025-07-06 02:28:51', '2025-07-06 02:28:51', NULL),
(568, 12, 1, 1, 'Pati Rahman', 100, 'N/A', NULL, '2025-07-06 02:29:17', '2025-07-06 02:29:17', NULL),
(570, 12, 1, 1, 'Ayub Khan', 101, 'Mir Alam', NULL, '2025-07-06 02:30:59', '2025-07-06 02:30:59', NULL),
(571, 12, 1, 1, 'Shamshad', 102, 'Rahim Shah', NULL, '2025-07-06 02:31:37', '2025-07-06 02:31:37', NULL),
(572, 12, 1, 1, 'Shokat Ali', 103, 'Arab Shah', NULL, '2025-07-06 02:32:12', '2025-07-06 02:32:12', NULL),
(573, 12, 1, 1, 'Salim', 104, 'Khan Gul', NULL, '2025-07-06 02:32:35', '2025-07-06 02:32:35', NULL),
(574, 12, 1, 1, 'Gaiyur Ullah Khan', 104, 'N/A', NULL, '2025-07-06 02:33:15', '2025-07-06 02:33:15', NULL),
(575, 12, 1, 1, 'Akbar Shah', 105, 'Kamal Shah', NULL, '2025-07-06 02:33:44', '2025-07-06 02:33:44', NULL),
(576, 12, 1, 1, 'Hayat Khan', 106, 'Kamal Shah', NULL, '2025-07-06 02:34:17', '2025-07-06 02:34:17', NULL),
(577, 12, 1, 1, 'Haleem Shah', 107, 'Noran Shah', NULL, '2025-07-06 02:34:46', '2025-07-06 02:34:46', NULL),
(578, 12, 1, 1, 'Qaiser', 108, 'Gul Zada', NULL, '2025-07-06 02:35:05', '2025-07-06 02:35:05', NULL),
(579, 12, 1, 1, 'Jahan Zeb', 109, 'Gul Zada', NULL, '2025-07-06 02:35:35', '2025-07-06 02:35:35', NULL),
(580, 12, 1, 1, 'Javed', 110, 'Gul Zada', NULL, '2025-07-06 02:35:51', '2025-07-06 02:35:51', NULL),
(581, 12, 1, 1, 'Rahim Zeb', 111, 'Gul Zada', NULL, '2025-07-06 02:36:19', '2025-07-06 02:36:19', NULL),
(582, 12, 1, 1, 'Ameer Zada', 112, 'Arab Shah', NULL, '2025-07-06 02:36:57', '2025-07-06 02:36:57', NULL),
(583, 12, 1, 1, 'Alam Zeb', 113, 'N/A', NULL, '2025-07-06 02:37:19', '2025-07-06 02:37:19', NULL),
(584, 12, 1, 1, 'Bacha Gul', 114, 'N/A', NULL, '2025-07-06 02:37:41', '2025-07-06 02:37:41', NULL),
(585, 12, 1, 1, 'Nasrullah', 115, 'Ameer Ullah', NULL, '2025-07-06 02:38:20', '2025-07-06 02:38:20', NULL),
(586, 12, 1, 1, 'Zarif Ullah', 116, 'Karim Ullah', NULL, '2025-07-06 02:40:47', '2025-07-06 02:40:47', NULL),
(587, 12, 1, 1, 'Inayat Ullah', 117, 'Atta Ullah', NULL, '2025-07-06 02:41:11', '2025-07-06 02:41:11', NULL),
(588, 12, 1, 1, 'Asim', 118, 'Shakir Ullah', NULL, '2025-07-06 02:41:40', '2025-07-06 02:41:40', NULL),
(589, 12, 1, 1, 'Anwar Ali', 119, 'Akbar Khan', NULL, '2025-07-06 02:42:09', '2025-07-06 02:42:09', NULL),
(590, 12, 1, 1, 'Said Muhammad', 120, 'Akbar Khan', NULL, '2025-07-06 02:42:33', '2025-07-06 02:42:33', NULL),
(591, 12, 1, 1, 'Rasool Khan', 121, 'Rahmat Shah', NULL, '2025-07-06 02:43:14', '2025-07-06 02:43:14', NULL),
(592, 12, 1, 1, 'Ahsan Ullah', 122, 'Khair Ullah', '-', '2025-07-06 02:43:45', '2025-07-06 02:44:41', NULL),
(593, 12, 1, 1, 'Shah Husain', 123, 'Dilawar', NULL, '2025-07-06 02:44:53', '2025-07-06 02:44:53', NULL),
(594, 12, 1, 1, 'Muzamil Shah', 124, 'Rahmat Shah', NULL, '2025-07-06 02:45:14', '2025-07-06 02:45:14', NULL),
(595, 12, 1, 1, 'Fakhar e Alam', 125, 'Khalil', NULL, '2025-07-06 02:46:12', '2025-07-06 02:46:12', NULL),
(597, 12, 1, 1, 'Zarif Khan', 126, 'Mir Alam', NULL, '2025-07-06 02:47:20', '2025-07-06 02:47:20', NULL),
(598, 12, 1, 1, 'Musafir', 127, 'Sher Muhammad', NULL, '2025-07-06 02:48:18', '2025-07-06 02:48:18', NULL),
(599, 12, 1, 1, 'Nadar', 128, 'Sher Muhammad', NULL, '2025-07-06 02:48:53', '2025-07-06 02:48:53', NULL),
(600, 12, 1, 1, 'Tila Muhammad', 129, 'Sher Muhammad', NULL, '2025-07-06 02:49:17', '2025-07-06 02:49:17', NULL),
(601, 12, 1, 1, 'Fazal Karim', 130, 'Gul Karim', NULL, '2025-07-06 02:49:43', '2025-07-06 02:49:43', NULL),
(602, 12, 1, 1, 'Rafi Ullah', 131, 'Zair Ullah', NULL, '2025-07-06 02:50:20', '2025-07-06 02:50:20', NULL),
(603, 12, 1, 1, 'Inayat Ullah', 132, 'Atta Ullah', NULL, '2025-07-06 02:50:50', '2025-07-06 02:50:50', NULL),
(604, 12, 1, 1, 'Jamil Gujjar', 133, 'Suhbat Khan', NULL, '2025-07-06 02:51:16', '2025-07-06 02:51:16', NULL),
(605, 12, 1, 1, 'Muhammad Zaman', 134, 'Abdul Karim', NULL, '2025-07-06 02:51:45', '2025-07-06 02:51:45', NULL),
(606, 12, 1, 1, 'Nasrullah', 135, 'Ameer Ullah', NULL, '2025-07-06 02:52:23', '2025-07-06 02:52:23', NULL),
(607, 12, 1, 1, 'Hukam', 136, 'Painda Khan', NULL, '2025-07-06 02:52:52', '2025-07-06 02:52:52', NULL),
(608, 12, 1, 1, 'Umara Khan', 137, 'Sher Dil', NULL, '2025-07-06 02:53:19', '2025-07-06 02:53:19', NULL),
(609, 12, 1, 1, 'Shahzaib', 138, 'Mehruban Shah', NULL, '2025-07-06 02:53:46', '2025-07-06 02:53:46', NULL),
(610, 12, 1, 1, 'Mehruban Shah', 139, 'Margah', NULL, '2025-07-06 02:54:23', '2025-07-06 02:54:23', NULL),
(611, 12, 1, 1, 'Sher Ali', 140, 'Akbar Khan', NULL, '2025-07-06 02:54:45', '2025-07-06 02:54:45', NULL),
(612, 12, 1, 1, 'Hidayat Ullah', 141, 'Mir Aman', NULL, '2025-07-06 02:55:05', '2025-07-06 02:55:05', NULL),
(613, 12, 1, 1, 'Imran Khan', 142, 'Mir Aman', NULL, '2025-07-06 02:55:52', '2025-07-06 02:55:52', NULL),
(614, 12, 1, 1, 'Abdur Raziq', 143, 'Abdul Hanan', NULL, '2025-07-06 02:56:16', '2025-07-06 02:56:16', NULL),
(615, 12, 1, 1, 'Gul Rahman', 144, 'Abdul Hanan', NULL, '2025-07-06 02:56:48', '2025-07-06 02:56:48', NULL),
(616, 12, 1, 1, 'Muhammad Younas', 145, 'Muhammad Yousaf', NULL, '2025-07-06 02:57:23', '2025-07-06 02:57:23', NULL),
(617, 12, 1, 1, 'Muhammad Ayaz', 146, 'Muhammad Yousaf', NULL, '2025-07-06 02:58:07', '2025-07-06 02:58:07', NULL),
(618, 12, 1, 1, 'Muhammad Iqbal', 147, 'Muhammad Yousaf', NULL, '2025-07-06 02:58:21', '2025-07-06 02:58:21', NULL),
(619, 12, 1, 1, 'Abdul Qayum', 148, 'Muhammad Yousaf', NULL, '2025-07-06 02:58:36', '2025-07-06 02:58:36', NULL),
(620, 12, 1, 1, 'Masoom', 149, 'Abdul Qayum', NULL, '2025-07-06 02:59:08', '2025-07-06 02:59:08', NULL),
(621, 12, 1, 1, 'Muhammad Arif Gujar', 150, 'N/A', NULL, '2025-07-06 02:59:36', '2025-07-06 02:59:36', NULL),
(622, 12, 1, 1, 'Hamaish', 151, 'Sher Dil', NULL, '2025-07-06 03:00:01', '2025-07-06 03:00:01', NULL),
(623, 12, 1, 1, 'Asmat', 152, 'Abdul Hanan', NULL, '2025-07-06 03:00:39', '2025-07-06 03:00:39', NULL),
(624, 12, 1, 1, 'Noor Rahman', 153, 'Abdul Hanan', NULL, '2025-07-06 03:00:55', '2025-07-06 03:00:55', NULL),
(625, 12, 1, 1, 'Ubaid Ullah', 154, 'Mir Aman', NULL, '2025-07-06 03:42:37', '2025-07-06 03:42:37', NULL),
(626, 12, 1, 1, 'Khaista Rahman', 155, 'Rahman Uddin', NULL, '2025-07-06 03:43:22', '2025-07-06 03:43:22', NULL),
(627, 12, 1, 1, 'Ghafoor', 156, 'Nazir', NULL, '2025-07-06 03:44:18', '2025-07-06 03:44:18', NULL),
(628, 12, 1, 1, 'Farman', 157, 'Rahim', NULL, '2025-07-06 03:44:42', '2025-07-06 03:44:42', NULL),
(630, 12, 1, 1, 'Adam Khan', 158, 'Mir Zaman', NULL, '2025-07-06 03:47:55', '2025-07-06 03:47:55', NULL),
(631, 12, 1, 1, 'Ajmir Khan', 159, 'Muhammad Khan', NULL, '2025-07-06 03:49:13', '2025-07-06 03:49:13', NULL),
(632, 12, 1, 1, 'Dr Muhammad Jan', 160, 'N/A', NULL, '2025-07-06 03:50:57', '2025-07-06 03:50:57', NULL),
(633, 12, 1, 1, 'Hazrat Umer', 161, 'Mukarram', NULL, '2025-07-06 03:51:35', '2025-07-06 03:51:35', NULL),
(634, 12, 1, 1, 'Said Akbar', 162, 'Laal Muhammad', NULL, '2025-07-06 03:51:58', '2025-07-06 03:51:58', NULL),
(635, 12, 1, 1, 'Jafar', 163, 'Abdul Jalil', NULL, '2025-07-06 03:52:39', '2025-07-06 03:52:39', NULL),
(636, 12, 1, 1, 'Abdul Jabbar', 164, 'Abdul Jalil', NULL, '2025-07-06 03:53:10', '2025-07-06 03:53:10', NULL),
(637, 12, 1, 1, 'Ridar', 165, 'Mahmood', NULL, '2025-07-06 03:53:57', '2025-07-06 03:53:57', NULL),
(638, 12, 1, 1, 'Muhtaram', 166, 'Dilawar', NULL, '2025-07-06 03:55:57', '2025-07-06 03:55:57', NULL),
(639, 12, 1, 1, 'Abid', 167, 'Saad Maluk', NULL, '2025-07-06 03:56:17', '2025-07-06 03:56:17', NULL),
(640, 12, 1, 1, 'Pati Rahman', 168, 'Saifur', NULL, '2025-07-06 03:57:12', '2025-07-06 03:57:12', NULL),
(641, 12, 1, 1, 'Said Rahman', 169, 'Saifur', NULL, '2025-07-06 03:57:41', '2025-07-06 03:57:41', NULL),
(643, 12, 1, 1, 'Wali Khan', 170, 'Hanif Khan', NULL, '2025-07-06 03:59:58', '2025-07-06 03:59:58', NULL),
(644, 12, 1, 1, 'Jehan Zeb', 171, 'Saifur', NULL, '2025-07-06 04:01:03', '2025-07-06 04:01:03', NULL),
(645, 12, 1, 1, 'Rahmat Karim', 172, 'Amaan Karim', NULL, '2025-07-06 04:01:47', '2025-07-06 04:01:47', NULL),
(646, 12, 1, 1, 'Nimat Ullah', 173, 'Noor Muhamamd', NULL, '2025-07-06 04:02:10', '2025-07-06 04:02:10', NULL),
(647, 12, 1, 1, 'Ghulam Rasool', 174, 'Muhammad Khan', '-', '2025-07-06 04:03:05', '2025-07-06 04:05:11', NULL),
(648, 12, 1, 1, 'Abdul Malik, Muslim', 175, 'Khaista Rasool', NULL, '2025-07-06 04:05:57', '2025-07-06 04:05:57', NULL),
(649, 12, 1, 1, 'Aslam', 176, 'Akbar', NULL, '2025-07-06 04:06:22', '2025-07-06 04:06:22', NULL),
(650, 12, 1, 1, 'Malik Khan', 177, 'Khushal', NULL, '2025-07-06 04:06:56', '2025-07-06 04:06:56', NULL),
(651, 12, 1, 1, 'Zahir Shah', 178, 'N/A', NULL, '2025-07-06 04:07:30', '2025-07-06 04:07:30', NULL),
(652, 12, 1, 1, 'Wajid Ali', 179, 'Nihar', NULL, '2025-07-06 04:08:09', '2025-07-06 04:08:09', NULL),
(653, 12, 1, 1, 'Safdar', 180, 'N/A', NULL, '2025-07-06 04:08:31', '2025-07-06 04:08:31', NULL),
(654, 12, 1, 1, 'Tahir', 181, 'Yousaf', NULL, '2025-07-06 04:08:52', '2025-07-06 04:08:52', NULL),
(655, 12, 1, 1, 'Said Arif', 183, 'Muhammad Sharif', NULL, '2025-07-06 04:10:11', '2025-07-06 04:10:11', NULL),
(656, 12, 1, 1, 'Abdul Akbar', 184, 'Noor Jan', NULL, '2025-07-06 04:10:46', '2025-07-06 04:10:46', NULL),
(657, 12, 1, 1, 'Noor Akbar', 185, 'Noor Jan', NULL, '2025-07-06 04:11:16', '2025-07-06 04:11:16', NULL),
(658, 12, 1, 1, 'Aziz Ullah', 186, 'Naqeeb Ullah', NULL, '2025-07-06 04:12:09', '2025-07-06 04:12:09', NULL),
(659, 12, 1, 1, 'Mehtab', 187, 'Shahbaz', NULL, '2025-07-06 04:12:32', '2025-07-06 04:12:32', NULL),
(660, 12, 1, 1, 'Said Umer', 188, 'Ali Rahman', NULL, '2025-07-06 04:13:05', '2025-07-06 04:13:05', NULL),
(661, 12, 1, 1, 'Laal Bahadur', 189, 'Umara Khan', NULL, '2025-07-06 04:13:31', '2025-07-06 04:13:31', NULL),
(663, 12, 1, 1, 'Inayat Ullah', 191, 'Noor Muhammad', NULL, '2025-07-06 04:15:07', '2025-07-06 04:15:07', NULL),
(664, 12, 1, 1, 'Naik Muhammad', 190, 'Fazal Noor', NULL, '2025-07-06 04:16:08', '2025-07-06 04:16:08', NULL),
(665, 12, 1, 1, 'Muhammad Israr', 192, 'Tawab', NULL, '2025-07-06 04:16:36', '2025-07-06 04:16:36', NULL),
(666, 12, 1, 1, 'Farid', 193, 'ABDUL Jalil', NULL, '2025-07-06 04:17:07', '2025-07-06 04:17:07', NULL),
(667, 12, 1, 1, 'Shan Ullah', 194, 'Noor Muhammad', NULL, '2025-07-06 04:17:33', '2025-07-06 04:17:33', NULL),
(668, 12, 1, 1, 'Mukamil Shah', 195, 'Imran', NULL, '2025-07-06 04:18:06', '2025-07-06 04:18:06', NULL),
(669, 12, 1, 1, 'Noor Ul Haq', 196, 'Toor', NULL, '2025-07-06 04:21:51', '2025-07-06 04:21:51', NULL),
(670, 12, 1, 1, 'Hamaish Gul', 197, 'Rahman Gul', NULL, '2025-07-06 04:22:23', '2025-07-06 04:22:23', NULL),
(671, 12, 1, 1, 'Nazar Muhammad', 198, 'Rahman Gul', NULL, '2025-07-06 04:22:40', '2025-07-06 04:22:40', NULL),
(672, 12, 1, 1, 'Said Muhammad', 199, 'Gul Khan', NULL, '2025-07-06 04:23:21', '2025-07-06 04:23:21', NULL),
(673, 12, 1, 1, 'Nasir', 200, 'Gul Khan', NULL, '2025-07-06 04:24:00', '2025-07-06 04:24:00', NULL),
(674, 12, 1, 1, 'Naoroz', 201, 'Gul Khan', NULL, '2025-07-06 04:24:34', '2025-07-06 04:24:34', NULL),
(675, 12, 1, 1, 'Muhtaram', 202, 'Dilawar', NULL, '2025-07-06 04:24:51', '2025-07-06 04:24:51', NULL),
(676, 12, 1, 1, 'Rahmat Ullah', 203, 'Aman Ullah', NULL, '2025-07-06 04:25:17', '2025-07-06 04:25:17', NULL),
(677, 47, 1, 1, 'Haidar zaman', 3, 'Gultaj s/o khan sher', '000000000', '2025-07-07 08:49:13', '2025-07-07 08:49:13', '000000000'),
(678, 47, 1, 1, 'Sajad khan', 4, 'Azamullah s/o Gul Zada', '00000000', '2025-07-07 08:50:44', '2025-07-07 08:50:44', '000000000'),
(679, 47, 1, 1, 'Shokat', 5, 'injer Gul', '00000000', '2025-07-07 08:52:07', '2025-07-07 08:52:07', '000000000'),
(680, 47, 1, 1, 'Jahanzeb', 6, 'Bahadar Sher', '00000000', '2025-07-07 08:52:56', '2025-07-07 08:52:56', '000000000'),
(681, 47, 1, 1, 'Saleem', 7, 'khan Bahadar', NULL, '2025-07-07 08:53:27', '2025-07-07 08:53:27', '000000000'),
(682, 47, 1, 1, 'Lal Bahadar', 8, 'Khan Bahadar', NULL, '2025-07-07 08:54:03', '2025-07-07 08:54:03', '000000000'),
(683, 47, 1, 1, 'Mir Qadar', 9, 'Khan Bahadar', NULL, '2025-07-07 08:55:09', '2025-07-07 08:55:09', '000000000'),
(684, 47, 1, 1, 'Fazal Qadar', 10, 'Khan Bahadar', NULL, '2025-07-07 08:55:45', '2025-07-07 08:55:45', '000000000'),
(685, 47, 1, 1, 'Bacha', 11, 'Akhtary', NULL, '2025-07-07 08:56:20', '2025-07-07 08:56:20', '000000000'),
(686, 22, 1, 1, 'muhammad roshan', 4, 'sher afzal', NULL, '2025-07-07 08:57:49', '2025-07-07 08:57:49', NULL),
(687, 47, 1, 1, 'Ameer Sahib', 12, 'Sakin Garay', NULL, '2025-07-07 08:57:56', '2025-07-07 08:57:56', '000000000'),
(688, 47, 1, 1, 'Anar Gul', 13, 'Nil', NULL, '2025-07-07 08:58:43', '2025-07-07 08:58:43', '000000000'),
(689, 47, 1, 1, 'Habibullah', 14, 'Deedar Gul', NULL, '2025-07-07 08:59:24', '2025-07-07 08:59:24', '000000000'),
(690, 47, 1, 1, 'Gul Sher', 15, 'Dedar Gul', NULL, '2025-07-07 09:00:01', '2025-07-07 09:00:01', '000000000'),
(691, 47, 1, 1, 'Zakriya', 16, 'Abdusamad', NULL, '2025-07-07 09:00:47', '2025-07-07 09:00:47', '000000000'),
(692, 22, 1, 1, 'muhammad azam', 3, 'lalmuhammad', NULL, '2025-07-07 09:01:37', '2025-07-07 09:01:37', NULL),
(693, 47, 1, 1, 'Askar', 17, 'Gulam Qadar', NULL, '2025-07-07 09:01:47', '2025-07-07 09:01:47', '000000000'),
(694, 22, 1, 1, 'shahid khan', 8, 'sahrab khan', NULL, '2025-07-07 09:02:27', '2025-07-07 09:02:27', NULL),
(695, 47, 1, 1, 'Seyar khan', 18, 'Nil Azamullah', NULL, '2025-07-07 09:02:56', '2025-07-07 09:02:56', '000000000'),
(696, 47, 1, 1, 'Seyar khan', 19, 'Nil Gul Taj s/o', NULL, '2025-07-07 09:04:03', '2025-07-07 09:04:03', '000000000'),
(697, 47, 1, 1, 'Seyar', 20, 'Nil Nasrullah', NULL, '2025-07-07 09:04:42', '2025-07-07 09:04:42', '000000000'),
(698, 47, 1, 1, 'Govt Nawaz S/o Gulam khan', 21, 'Govt Amjid S/O Sher Gul', NULL, '2025-07-07 09:06:40', '2025-07-07 09:06:40', '000000000'),
(699, 47, 1, 1, 'Safdar', 23, 'Nil Gul Taj S/O Khan Sher', NULL, '2025-07-07 09:08:21', '2025-07-07 09:08:21', '000000000'),
(700, 47, 1, 1, 'Najmuzaman', 24, 'Gul Ahmad', NULL, '2025-07-07 09:09:06', '2025-07-07 09:09:06', '000000000'),
(701, 47, 1, 1, 'Gulam Haidar', 25, 'Nil Noor Rahman S/o Gufran', NULL, '2025-07-07 09:10:10', '2025-07-07 09:10:10', '000000000'),
(702, 47, 1, 1, 'Gulam Haidar', 26, 'Nil Sabz Ali S/o Raihan', NULL, '2025-07-07 09:11:55', '2025-07-07 09:11:55', '000000000'),
(703, 47, 1, 1, 'Arsala khan', 28, 'Sarver', NULL, '2025-07-07 09:12:55', '2025-07-07 09:12:55', '000000000'),
(704, 47, 1, 1, 'Luqman', 29, 'Nil', NULL, '2025-07-07 09:13:31', '2025-07-07 09:13:31', '000000000'),
(705, 47, 1, 1, 'Haroon', 30, 'Nil', NULL, '2025-07-07 09:14:25', '2025-07-07 09:14:25', '000000000'),
(706, 47, 1, 1, 'Saifoor', 31, 'Khadimulislam', NULL, '2025-07-07 09:15:08', '2025-07-07 09:15:08', '000000000'),
(707, 47, 1, 1, 'Hazrat Ali', 32, 'Khadimulislam', NULL, '2025-07-07 09:15:33', '2025-07-07 09:15:33', '000000000'),
(708, 47, 1, 1, 'Usman', 33, 'Khadimulislam', NULL, '2025-07-07 09:16:04', '2025-07-07 09:16:04', '000000000'),
(709, 47, 1, 1, 'Idrees', 34, 'Khadimulislam', NULL, '2025-07-07 09:16:34', '2025-07-07 09:16:34', '000000000'),
(710, 47, 1, 1, 'Khan wadan', 35, 'khan Raziq', NULL, '2025-07-07 09:18:53', '2025-07-07 09:18:53', '000000000'),
(711, 47, 1, 1, 'Qasim', 36, 'Hasan Shah Bacha', NULL, '2025-07-07 09:19:52', '2025-07-07 09:19:52', '000000000'),
(712, 22, 1, 1, 'ALI AFSAR', 9, 'KHOWAJA MUHAMMAD', NULL, '2025-07-07 09:25:23', '2025-07-07 09:25:23', NULL),
(713, 22, 1, 1, 'syedahmad', 10, 'KHOWAJA MUHAMMAD', NULL, '2025-07-07 09:32:10', '2025-07-07 09:32:10', NULL),
(714, 22, 1, 1, 'israrudin', 11, 'zalabadin', NULL, '2025-07-07 09:41:33', '2025-07-07 09:41:33', NULL),
(715, 22, 1, 1, 'dawa jan', 12, 'abdusatar', NULL, '2025-07-07 09:50:56', '2025-07-07 09:50:56', NULL),
(716, 31, 1, 1, 'Mohd nabi', 25, 'Jamroz', NULL, '2025-07-07 12:04:20', '2025-07-07 12:04:20', NULL),
(717, 11, 1, 1, 'Shah Jehan', 5, 'Syed Akbar Shah', NULL, '2025-07-08 03:56:11', '2025-07-08 03:56:11', NULL),
(718, 11, 1, 1, 'Bashir', 6, 'Durani', NULL, '2025-07-08 03:56:59', '2025-07-08 03:56:59', NULL),
(719, 11, 1, 1, 'Wazir', 7, 'Durani', NULL, '2025-07-08 03:57:10', '2025-07-08 03:57:10', NULL),
(721, 11, 1, 1, 'Muhammad Ayaz', 9, 'Noor Alam', NULL, '2025-07-08 03:58:22', '2025-07-08 03:58:22', NULL),
(722, 11, 1, 1, 'Said Shah, Shah Jahan', 8, 'N/A', NULL, '2025-07-08 04:01:56', '2025-07-08 04:01:56', NULL),
(723, 11, 1, 1, 'Said Alam', 10, 'Gul Din', NULL, '2025-07-08 04:03:14', '2025-07-08 04:03:14', NULL),
(725, 11, 1, 1, 'Laal Badshah', 11, 'Said Badshah', NULL, '2025-07-08 04:05:39', '2025-07-08 04:05:39', NULL),
(726, 11, 1, 1, 'Gul Zaman', 12, 'Hameed Khan', NULL, '2025-07-08 04:06:30', '2025-07-08 04:06:30', NULL),
(727, 11, 1, 1, 'Qasim Shah', 13, 'Dawood Shah', NULL, '2025-07-08 04:09:29', '2025-07-08 04:09:29', NULL),
(728, 11, 1, 1, 'Noor Alam', 14, 'Gul Din', NULL, '2025-07-08 04:10:06', '2025-07-08 04:10:06', NULL),
(729, 11, 1, 1, 'Abdul Sattar', 15, 'Muhammad Hasan', NULL, '2025-07-08 04:10:57', '2025-07-08 04:10:57', NULL),
(730, 11, 1, 1, 'Rahman Said', 16, 'Amir Muhammad', NULL, '2025-07-08 04:11:18', '2025-07-08 04:11:18', NULL),
(731, 11, 1, 1, 'Zahir Shah', 17, 'Dawood Shah', NULL, '2025-07-08 04:11:54', '2025-07-08 04:11:54', NULL),
(732, 11, 1, 1, 'Sher Muhammad', 18, 'Laal Muhammad', NULL, '2025-07-08 04:12:28', '2025-07-08 04:12:28', NULL),
(733, 11, 1, 1, 'Taj Muhammad', 19, 'Fazal Rahim', NULL, '2025-07-08 04:13:24', '2025-07-08 04:13:24', NULL),
(734, 11, 1, 1, 'Fazal Qayum', 20, 'Bahadur Khan', NULL, '2025-07-08 04:13:56', '2025-07-08 04:13:56', NULL),
(735, 11, 1, 1, 'Arbab', 21, 'Bahadur Khan', NULL, '2025-07-08 04:14:30', '2025-07-08 04:14:30', NULL),
(736, 11, 1, 1, 'Faqir Jan', 22, 'Dava Jan', NULL, '2025-07-08 04:14:54', '2025-07-08 04:14:54', NULL),
(737, 11, 1, 1, 'Nazar Muhammad', 23, 'Muhammad Akbar', NULL, '2025-07-08 04:15:19', '2025-07-08 04:15:19', NULL),
(738, 11, 1, 1, 'Zahir Shah', 24, 'Dava Jan', NULL, '2025-07-08 04:16:05', '2025-07-08 04:16:05', NULL),
(739, 11, 1, 1, 'Fazal Qadar', 24, 'Bahadur Khan', '-', '2025-07-08 04:18:05', '2025-07-08 04:18:59', NULL),
(740, 11, 1, 1, 'Muqadas', 25, 'Muqarab', '-', '2025-07-08 04:18:35', '2025-07-08 04:19:14', NULL),
(741, 11, 1, 1, 'Khan Bahadur', 26, 'Bahadur Khan', NULL, '2025-07-08 04:19:58', '2025-07-08 04:19:58', NULL),
(742, 11, 1, 1, 'Muhammad Alam', 27, 'Muhammad Akbar', NULL, '2025-07-08 04:20:25', '2025-07-08 04:20:25', NULL),
(743, 11, 1, 1, 'Noor Rahman', 28, 'Zarin', NULL, '2025-07-08 04:21:03', '2025-07-08 04:21:03', NULL),
(744, 11, 1, 1, 'Dost Muhammad', 29, 'Zarin', NULL, '2025-07-08 04:21:34', '2025-07-08 04:21:34', NULL),
(745, 11, 1, 1, 'Sher Bahadur', 30, 'Umara Khan', NULL, '2025-07-08 04:21:51', '2025-07-08 04:21:51', NULL),
(746, 11, 1, 1, 'Malang', 31, 'Umara Khan', NULL, '2025-07-08 04:22:06', '2025-07-08 04:22:06', NULL),
(747, 11, 1, 1, 'Dost Muhammad', 33, 'Sher Azam', NULL, '2025-07-08 04:23:20', '2025-07-08 04:23:20', NULL),
(748, 11, 1, 1, 'Mir Afzal', 34, 'Sher Azam', NULL, '2025-07-08 04:24:00', '2025-07-08 04:24:00', NULL),
(749, 11, 1, 1, 'Sher Zaman', 35, 'Sher Azam', NULL, '2025-07-08 04:24:23', '2025-07-08 04:24:23', NULL),
(750, 11, 1, 1, 'Khan Badshah', 36, 'Rahim Gul', NULL, '2025-07-08 04:24:46', '2025-07-08 04:24:46', NULL),
(751, 11, 1, 1, 'Laal Zada', 37, 'Umara Khan', NULL, '2025-07-08 04:25:06', '2025-07-08 04:25:06', NULL),
(752, 11, 1, 1, 'Rahim Badshah', 38, 'Rahim Gul', NULL, '2025-07-08 04:25:30', '2025-07-08 04:25:30', NULL),
(753, 11, 1, 1, 'Hasan Badshah', 39, 'Rahim Gul', NULL, '2025-07-08 04:26:24', '2025-07-08 04:26:24', NULL),
(754, 11, 1, 1, 'Sultan', 39, 'Zarin', NULL, '2025-07-08 04:26:43', '2025-07-08 04:26:43', NULL),
(755, 11, 1, 1, 'Arab Khan', 40, 'Sherin', NULL, '2025-07-08 04:27:29', '2025-07-08 04:27:29', NULL),
(756, 11, 1, 1, 'Nadar', 41, 'Muhammad Akbar', NULL, '2025-07-08 04:27:50', '2025-07-08 04:27:50', NULL),
(757, 11, 1, 1, 'Muhammad Ishaq Gujjar', 42, 'Sikandar Khan', NULL, '2025-07-08 04:28:18', '2025-07-08 04:28:18', NULL),
(758, 11, 1, 1, 'Ali Rahman', 43, 'Jumma Khan', NULL, '2025-07-08 04:28:36', '2025-07-08 04:28:36', NULL),
(759, 11, 1, 1, 'Gul Muhammad', 44, 'Shahbaz', NULL, '2025-07-08 04:29:57', '2025-07-08 04:29:57', NULL),
(760, 11, 1, 1, 'Muntazim Shah', 45, 'Nadar Shah', NULL, '2025-07-08 04:30:29', '2025-07-08 04:30:29', NULL),
(761, 11, 1, 1, 'Shoaib', 46, 'Muzamil Shah', NULL, '2025-07-08 04:31:29', '2025-07-08 04:31:29', NULL),
(762, 11, 1, 1, 'Mirza', 46, 'Shahbaz', NULL, '2025-07-08 04:31:59', '2025-07-08 04:31:59', NULL),
(763, 11, 1, 1, 'Amin Dar', 47, 'Nadar Khan', NULL, '2025-07-08 04:32:53', '2025-07-08 04:32:53', NULL),
(764, 11, 1, 1, 'Saleem', 48, 'Nadar Khan', NULL, '2025-07-08 04:33:12', '2025-07-08 04:33:12', NULL),
(765, 11, 1, 1, 'Nawab Shah', 49, 'Ghazi Shah', NULL, '2025-07-08 04:33:33', '2025-07-08 04:33:33', NULL),
(766, 11, 1, 1, 'Zafar', 50, 'Mira Khan', NULL, '2025-07-08 04:34:38', '2025-07-08 04:34:38', NULL),
(768, 11, 1, 1, 'Sher Ali', 52, 'Tausil', NULL, '2025-07-08 04:36:50', '2025-07-08 04:36:50', NULL),
(769, 11, 1, 1, 'Farman', 51, 'Itibar Jan', NULL, '2025-07-08 04:37:17', '2025-07-08 04:37:17', NULL),
(770, 11, 1, 1, 'Ali Rahman', 53, 'Gul Dali', NULL, '2025-07-08 04:42:57', '2025-07-08 04:42:57', NULL),
(771, 11, 1, 1, 'Ghani', 54, 'Gul Dali', NULL, '2025-07-08 04:44:42', '2025-07-08 04:44:42', NULL),
(772, 11, 1, 1, 'Karnal Javed', 55, 'Sultan Muhammad', NULL, '2025-07-08 04:45:53', '2025-07-08 04:45:53', NULL),
(773, 11, 1, 1, 'Rafiq Shah', 56, 'Nadar Shah', NULL, '2025-07-08 04:46:24', '2025-07-08 04:46:24', NULL),
(774, 11, 1, 1, 'Habib Ur Rahman', 57, 'N/A', NULL, '2025-07-08 04:47:02', '2025-07-08 04:47:02', NULL),
(775, 11, 1, 1, 'Abdul Ghani', 58, 'Said Baaz', NULL, '2025-07-08 04:47:43', '2025-07-08 04:47:43', NULL),
(776, 11, 1, 1, 'Noor Rahman', 59, 'Said Baaz', NULL, '2025-07-08 04:48:04', '2025-07-08 04:48:04', NULL),
(777, 11, 1, 1, 'Noor Ahmad', 60, 'N/A', NULL, '2025-07-08 04:48:32', '2025-07-08 04:48:32', NULL),
(778, 11, 1, 1, 'Muzamil Shah', 61, 'Dawood Shah', NULL, '2025-07-08 04:49:10', '2025-07-08 04:49:10', NULL),
(779, 11, 1, 1, 'Sher Jan', 62, 'Nadar Khan', NULL, '2025-07-08 04:49:38', '2025-07-08 04:49:38', NULL),
(780, 11, 1, 1, 'Muhammad Alam', 63, 'Gul Din', NULL, '2025-07-08 04:50:04', '2025-07-08 04:50:04', NULL),
(781, 11, 1, 1, 'Adam Khan', 64, 'Wali Muhammad', NULL, '2025-07-08 04:53:04', '2025-07-08 04:53:04', NULL),
(782, 11, 1, 1, 'Zahir Shah', 65, 'Rahmat Karim', NULL, '2025-07-08 04:53:52', '2025-07-08 04:53:52', NULL),
(783, 11, 1, 1, 'Sher Hasan', 66, 'Hakeem Khan', NULL, '2025-07-08 04:54:20', '2025-07-08 04:54:20', NULL),
(784, 11, 1, 1, 'Husain Khan', 67, 'Hakeem Khan', NULL, '2025-07-08 04:55:03', '2025-07-08 04:55:03', NULL),
(785, 11, 1, 1, 'Gul Rahman', 68, 'Hakeem Khan', NULL, '2025-07-08 04:55:31', '2025-07-08 04:55:31', NULL),
(786, 11, 1, 1, 'Gul Husain', 69, 'Hakeem Khan', NULL, '2025-07-08 04:56:21', '2025-07-08 04:56:21', NULL),
(787, 11, 1, 1, 'Hameed Gul', 70, 'Hakeem Khan', NULL, '2025-07-08 04:56:39', '2025-07-08 04:56:39', NULL),
(788, 11, 1, 1, 'Waheed Gul', 71, 'Muhammad Husain', NULL, '2025-07-08 04:57:41', '2025-07-08 04:57:41', NULL),
(789, 11, 1, 1, 'Munir Khan', 72, 'Mahmood Khan', NULL, '2025-07-08 04:58:35', '2025-07-08 04:58:35', NULL),
(790, 11, 1, 1, 'Zar Muhammad', 73, 'Alam Khan', NULL, '2025-07-08 04:58:57', '2025-07-08 04:58:57', NULL),
(791, 11, 1, 1, 'Sahib Zada', 74, 'Said Ahmad', NULL, '2025-07-08 04:59:30', '2025-07-08 04:59:30', NULL),
(792, 11, 1, 1, 'Zahir Shah', 75, 'Qalar Din', NULL, '2025-07-08 05:00:17', '2025-07-08 05:00:17', NULL),
(793, 11, 1, 1, 'Khan Bahadur', 76, 'Muhammad Jan', NULL, '2025-07-08 05:08:18', '2025-07-08 05:08:18', NULL),
(794, 11, 1, 1, 'Muhammad Ali', 77, 'Akbar Khan', NULL, '2025-07-08 05:08:47', '2025-07-08 05:08:47', NULL),
(795, 11, 1, 1, 'Qalar Din', 78, 'Behram Khan', NULL, '2025-07-08 05:09:50', '2025-07-08 05:09:50', NULL),
(796, 11, 1, 1, 'Rahim Shah', 79, 'Qalar Din', NULL, '2025-07-08 05:10:07', '2025-07-08 05:10:07', NULL),
(797, 11, 1, 1, 'Munawar Said', 80, 'Khaista Rasool', NULL, '2025-07-08 05:11:47', '2025-07-08 05:11:47', NULL),
(798, 11, 1, 1, 'Yousaf Khan', 81, 'Afzal Khan', NULL, '2025-07-08 05:12:27', '2025-07-08 05:12:27', NULL),
(799, 11, 1, 1, 'Fazal Shah', 82, 'Naem Shah', NULL, '2025-07-08 05:14:16', '2025-07-08 05:14:16', NULL),
(800, 11, 1, 1, 'Ziarat Gul', 83, 'Muhammad Jan', NULL, '2025-07-08 05:15:34', '2025-07-08 05:15:34', NULL),
(801, 11, 1, 1, 'Hazrat Husain', 84, 'Muhammad Hasan', NULL, '2025-07-08 05:16:11', '2025-07-08 05:16:11', NULL),
(802, 11, 1, 1, 'Ajmal', 85, 'Akbar Khan', NULL, '2025-07-08 05:17:08', '2025-07-08 05:17:08', NULL),
(803, 11, 1, 1, 'Shokat Ali', 86, 'Noor Hasan', NULL, '2025-07-08 05:17:39', '2025-07-08 05:17:39', NULL),
(804, 11, 1, 1, 'Wazir Shah', 87, 'Amir Shah', NULL, '2025-07-08 05:18:09', '2025-07-08 05:18:09', NULL),
(805, 11, 1, 1, 'Fazal Shah', 88, 'Naem Shah', NULL, '2025-07-08 05:18:38', '2025-07-08 05:18:38', NULL),
(806, 11, 1, 1, 'Israr', 89, 'Naem Shah', NULL, '2025-07-08 05:19:27', '2025-07-08 05:19:27', NULL),
(807, 11, 1, 1, 'Murtaza Khan', 90, 'Naem Shah', NULL, '2025-07-08 05:21:23', '2025-07-08 05:21:23', NULL),
(808, 11, 1, 1, 'Aman Ullah', 91, 'Gul', NULL, '2025-07-08 05:21:57', '2025-07-08 05:21:57', NULL),
(809, 11, 1, 1, 'Sher Bahadur', 92, 'Muhammad Jan', NULL, '2025-07-08 05:22:33', '2025-07-08 05:22:33', NULL),
(810, 11, 1, 1, 'Umer Gul', 93, 'Muhammad Jan', NULL, '2025-07-08 05:23:26', '2025-07-08 05:23:26', NULL),
(811, 11, 1, 1, 'Shakir', 94, 'Sher Afzal', NULL, '2025-07-08 05:24:00', '2025-07-08 05:24:00', NULL),
(812, 11, 1, 1, 'Aman  Khan', 95, 'Abdur Rahman', NULL, '2025-07-08 05:24:31', '2025-07-08 05:24:31', NULL),
(813, 11, 1, 1, 'Naeem Khan', 96, 'Laalay', NULL, '2025-07-08 05:29:19', '2025-07-08 05:29:19', NULL),
(814, 11, 1, 1, 'Abdul Ghafoor', 97, 'Said Rahman', NULL, '2025-07-08 05:31:13', '2025-07-08 05:31:13', NULL),
(815, 11, 1, 1, 'Hayat Khan', 32, 'Ahmad Khan', NULL, '2025-07-08 05:34:38', '2025-07-08 05:34:38', NULL),
(816, 11, 1, 1, 'Abdul Jabbar, Nisar', 98, 'Gul', NULL, '2025-07-08 05:35:31', '2025-07-08 05:35:31', NULL),
(817, 11, 1, 1, 'Abdul Malik', 99, 'Khaista Rasool', NULL, '2025-07-08 05:38:22', '2025-07-08 05:38:22', NULL),
(818, 11, 1, 1, 'Dilawar', 100, 'Abdur Rahman', NULL, '2025-07-08 05:38:48', '2025-07-08 05:38:48', NULL),
(819, 11, 1, 1, 'Arab Khan', 101, 'Said Rahman', NULL, '2025-07-08 05:39:15', '2025-07-08 05:39:15', NULL),
(820, 11, 1, 1, 'Arshad', 102, 'Alif Khan', NULL, '2025-07-08 05:39:52', '2025-07-08 05:39:52', NULL),
(821, 11, 1, 1, 'Waqar', 103, 'Irfan Ullah', NULL, '2025-07-08 05:40:37', '2025-07-08 05:40:37', NULL),
(822, 11, 1, 1, 'Naik Muhammad', 103, 'Fazal Noor', NULL, '2025-07-08 05:41:22', '2025-07-08 05:41:22', NULL),
(823, 11, 1, 1, 'Sarfaraz', 104, 'Naeem', NULL, '2025-07-08 05:41:44', '2025-07-08 05:41:44', NULL),
(824, 11, 1, 1, 'Noor Faraz', 105, 'Naeem', NULL, '2025-07-08 05:42:14', '2025-07-08 05:42:14', NULL),
(825, 11, 1, 1, 'Abdur Rahman', 106, 'Akram Khan', NULL, '2025-07-08 11:38:56', '2025-07-08 11:38:56', NULL),
(826, 11, 1, 1, 'Yaqoob Khan', 107, 'Akram Khan', NULL, '2025-07-08 11:39:33', '2025-07-08 11:39:33', NULL),
(827, 11, 1, 1, 'Amir Nawas', 108, 'Akram Khan', NULL, '2025-07-08 11:41:24', '2025-07-08 11:41:24', NULL),
(828, 11, 1, 1, 'Waqar', 109, 'Abdul Qayum', NULL, '2025-07-08 11:53:14', '2025-07-08 11:53:14', NULL),
(829, 11, 1, 1, 'Murtaza Khan', 110, 'Akram Khan', NULL, '2025-07-08 11:54:19', '2025-07-08 11:54:19', NULL),
(830, 11, 1, 1, 'Abdul Jalil', 111, 'Akram Khan', NULL, '2025-07-08 11:59:03', '2025-07-08 11:59:03', NULL),
(831, 11, 1, 1, 'Shah Zada', 112, 'Raham Dad', NULL, '2025-07-08 12:00:32', '2025-07-08 12:00:32', NULL),
(832, 11, 1, 1, 'Sajid Gul', 113, 'Hazrat Jan', NULL, '2025-07-08 12:11:45', '2025-07-08 12:11:45', NULL),
(833, 11, 1, 1, 'Said Gul', 114, 'Hazrat Jan', NULL, '2025-07-08 12:12:37', '2025-07-08 12:12:37', NULL),
(834, 11, 1, 1, 'Alif Gul', 115, 'Habib Gul', NULL, '2025-07-08 12:13:09', '2025-07-08 12:13:09', NULL),
(835, 11, 1, 1, 'Jahan Zeb', 116, 'Toor', NULL, '2025-07-08 12:15:59', '2025-07-08 12:15:59', NULL),
(836, 11, 1, 1, 'Nisar', 117, 'Saana Gul', NULL, '2025-07-08 12:16:29', '2025-07-08 12:16:29', NULL),
(837, 11, 1, 1, 'Ahmad Gul', 118, 'Umer Gul', NULL, '2025-07-08 12:16:59', '2025-07-08 12:16:59', NULL),
(838, 11, 1, 1, 'Idris', 119, 'Wakeel Khan', NULL, '2025-07-08 12:17:52', '2025-07-08 12:17:52', NULL),
(839, 11, 1, 1, 'Yousaf Khan', 120, 'Nawab', NULL, '2025-07-08 12:18:30', '2025-07-08 12:18:30', NULL),
(840, 11, 1, 1, 'Alam Zeb', 121, 'Nawab', NULL, '2025-07-08 12:19:46', '2025-07-08 12:19:46', NULL),
(841, 11, 1, 1, 'Nawab Ali', 122, 'Sher Ali', NULL, '2025-07-08 12:20:06', '2025-07-08 12:20:06', NULL),
(842, 11, 1, 1, 'Nabi Gul', 123, 'Sher Ali', NULL, '2025-07-08 12:20:36', '2025-07-08 12:20:36', NULL),
(843, 11, 1, 1, 'Husain Khan', 124, 'Muhammad Said', NULL, '2025-07-08 12:21:03', '2025-07-08 12:21:03', NULL),
(844, 11, 1, 1, 'Abdul Jalil', 125, 'Fazal Muhammad', NULL, '2025-07-08 12:21:33', '2025-07-08 12:21:33', NULL),
(845, 11, 1, 1, 'Khaista Rehman', 126, 'Muhammad Said', NULL, '2025-07-08 12:22:17', '2025-07-08 12:22:17', NULL),
(846, 11, 1, 1, 'Ismail', 127, 'Muhammad Said', NULL, '2025-07-08 12:22:56', '2025-07-08 12:22:56', NULL),
(847, 11, 1, 1, 'Arab Gul', 128, 'Hazrat Jan', NULL, '2025-07-08 12:24:30', '2025-07-08 12:24:30', NULL),
(848, 11, 1, 1, 'Ahmad', 129, 'Arab Khan', NULL, '2025-07-08 12:24:58', '2025-07-08 12:24:58', NULL),
(849, 11, 1, 1, 'Ridi Gul', 130, 'Zarif Khan', NULL, '2025-07-08 12:29:38', '2025-07-08 12:29:38', NULL),
(850, 11, 1, 1, 'Gul Wali', 131, 'Janan', NULL, '2025-07-08 12:30:24', '2025-07-08 12:30:24', NULL),
(851, 11, 1, 1, 'Muhammad Husain', 131, 'Hameed Gul', '-', '2025-07-08 12:30:48', '2025-07-08 12:31:20', NULL),
(852, 11, 1, 1, 'Zamir', 132, 'Mahboob', NULL, '2025-07-08 12:33:21', '2025-07-08 12:33:21', NULL),
(853, 11, 1, 1, 'Husain Khan', 133, 'Muhabat Khan', NULL, '2025-07-08 12:33:50', '2025-07-08 12:33:50', NULL),
(854, 11, 1, 1, 'Hasan Gul', 134, 'N/A', NULL, '2025-07-08 12:34:25', '2025-07-08 12:34:25', NULL),
(855, 11, 1, 1, 'Said Gul', 135, 'Hameed Gul', NULL, '2025-07-08 12:34:54', '2025-07-08 12:34:54', NULL),
(856, 11, 1, 1, 'Nadar', 136, 'Said Hakeem', NULL, '2025-07-08 12:35:23', '2025-07-08 12:35:23', NULL),
(857, 11, 1, 1, 'Fazal Rahim', 137, 'Said Hakim', NULL, '2025-07-08 12:36:02', '2025-07-08 12:36:02', NULL),
(858, 11, 1, 1, 'Ibrahim', 138, 'Said Hakim', NULL, '2025-07-08 12:36:19', '2025-07-08 12:36:19', NULL),
(859, 11, 1, 1, 'Aman Gul-Mother', 139, 'N/A', NULL, '2025-07-08 12:37:58', '2025-07-08 12:37:58', NULL),
(860, 11, 1, 1, 'Mukamil Jan', 140, 'Habib Gul', NULL, '2025-07-08 12:38:34', '2025-07-08 12:38:34', NULL),
(861, 11, 1, 1, 'Muhammad Husain, Samin Khan Waghera', 141, 'Mehrab Jan', NULL, '2025-07-08 12:40:28', '2025-07-08 12:40:28', NULL),
(862, 11, 1, 1, 'Abdul Sattar', 142, 'Said Hakim', NULL, '2025-07-08 12:41:46', '2025-07-08 12:41:46', NULL),
(863, 11, 1, 1, 'Aman Gul', 143, 'Umer Gul', NULL, '2025-07-08 12:42:23', '2025-07-08 12:42:23', NULL),
(864, 11, 1, 1, 'Islam Gul', 144, 'Umer Gul', NULL, '2025-07-08 12:43:03', '2025-07-08 12:43:03', NULL),
(865, 11, 1, 1, 'Mehran Gul', 145, 'Zarif Khan', NULL, '2025-07-08 12:43:58', '2025-07-08 12:43:58', NULL),
(866, 11, 1, 1, 'Jamil', 146, 'Niaz Bahadur', NULL, '2025-07-08 12:44:27', '2025-07-08 12:44:27', NULL),
(867, 11, 1, 1, 'Shad Muhammad', 147, 'Jafar', NULL, '2025-07-08 12:45:48', '2025-07-08 12:45:48', NULL),
(868, 11, 1, 1, 'Momin', 148, 'Shahzad Gul', NULL, '2025-07-08 12:46:43', '2025-07-08 12:46:43', NULL),
(869, 11, 1, 1, 'Wajid', 149, 'Ghafoor', NULL, '2025-07-08 12:47:33', '2025-07-08 12:47:33', NULL),
(870, 11, 1, 1, 'Haji Gul', 150, 'Itibar Khan', NULL, '2025-07-08 12:48:11', '2025-07-08 12:48:11', NULL),
(871, 11, 1, 1, 'Muhammad Husain', 151, 'Said Husain', NULL, '2025-07-08 12:49:00', '2025-07-08 12:49:00', NULL),
(872, 11, 1, 1, 'Muhammad Husain', 152, 'Said Husain', NULL, '2025-07-08 12:49:50', '2025-07-08 12:49:50', NULL),
(873, 11, 1, 1, 'Muhammad Zaman', 153, 'Said Husain', NULL, '2025-07-08 12:50:23', '2025-07-08 12:50:23', NULL),
(874, 11, 1, 1, 'Muhammad Akbar', 154, 'Muhammad Husain', NULL, '2025-07-08 12:50:55', '2025-07-08 12:50:55', NULL),
(875, 11, 1, 1, 'Abdul Jalil', 155, 'N/A', NULL, '2025-07-08 12:52:14', '2025-07-08 12:52:14', NULL),
(876, 11, 1, 1, 'Masil', 156, 'Nawab', NULL, '2025-07-08 12:52:35', '2025-07-08 12:52:35', NULL),
(877, 11, 1, 1, 'Mohib Gul', 157, 'Umer Gul', NULL, '2025-07-08 12:53:10', '2025-07-08 12:53:10', NULL),
(878, 11, 1, 1, 'Fida Muhammad', 158, 'Abdul Akbar', NULL, '2025-07-08 12:58:05', '2025-07-08 12:58:05', NULL),
(879, 11, 1, 1, 'Pir Muhammad Jan', 159, 'Nawab', NULL, '2025-07-08 12:59:21', '2025-07-08 12:59:21', NULL),
(880, 11, 1, 1, 'Aman Ullah', 160, 'Abdul Akbar', NULL, '2025-07-08 13:00:30', '2025-07-08 13:00:30', NULL),
(881, 11, 1, 1, 'Shahid', 161, 'Nawaab', NULL, '2025-07-08 13:00:52', '2025-07-08 13:00:52', NULL),
(882, 11, 1, 1, 'Ahmad Jan', 162, 'Toor', NULL, '2025-07-08 13:01:21', '2025-07-08 13:01:21', NULL),
(883, 11, 1, 1, 'Muhammad', 163, 'Toor', NULL, '2025-07-08 13:03:06', '2025-07-08 13:03:06', NULL),
(884, 11, 1, 1, 'Wali Ahad Jan', 164, 'Toor', NULL, '2025-07-08 13:06:04', '2025-07-08 13:06:04', NULL),
(885, 11, 1, 1, 'Muhammad Israel', 164, 'Hamaish', NULL, '2025-07-08 13:07:03', '2025-07-08 13:07:03', NULL),
(886, 11, 1, 1, 'Iftihar', 165, 'Abdul Akbar', NULL, '2025-07-08 13:07:33', '2025-07-08 13:07:33', NULL),
(887, 11, 1, 1, 'Raza Muhammad (a.k.a. Bachagay)', 166, 'Said Ahmad', NULL, '2025-07-08 13:09:58', '2025-07-08 13:09:58', NULL),
(888, 11, 1, 1, 'Muhammad Anwar', 167, 'Mir Alam', NULL, '2025-07-08 13:11:00', '2025-07-08 13:11:00', NULL),
(889, 11, 1, 1, 'Shah Jahan', 168, 'Abdul Azeem', NULL, '2025-07-08 13:12:15', '2025-07-08 13:12:15', NULL),
(890, 11, 1, 1, 'Muhammad Ayaz', 169, 'Amaan Khan', NULL, '2025-07-08 13:12:50', '2025-07-08 13:12:50', NULL),
(891, 11, 1, 1, 'Anwar Khan', 170, 'Hayat Khan', NULL, '2025-07-08 13:13:43', '2025-07-08 13:13:43', NULL),
(892, 11, 1, 1, 'Asad Ullah', 171, 'Musafir', NULL, '2025-07-08 13:14:39', '2025-07-08 13:14:39', NULL),
(893, 3, 1, 1, 'Abdul manaf', 1, 'Ghulam Haider', NULL, '2025-07-08 13:15:14', '2025-07-08 13:15:14', NULL),
(894, 11, 1, 1, 'Gohar', 172, 'Ajab Khan', NULL, '2025-07-08 13:15:15', '2025-07-08 13:15:15', NULL),
(895, 11, 1, 1, 'Sardar', 173, 'Habib Ullah', NULL, '2025-07-08 13:15:57', '2025-07-08 13:15:57', NULL),
(896, 3, 1, 1, 'Almas etc', 2, 'Ghulam Haider', NULL, '2025-07-08 13:16:03', '2025-07-08 13:16:03', NULL),
(897, 11, 1, 1, 'Hasan Khan', 174, 'Muhammad Amin', NULL, '2025-07-08 13:16:33', '2025-07-08 13:16:33', NULL),
(898, 3, 1, 1, 'Nazar Hussain', 3, 'Gul Muhammad', NULL, '2025-07-08 13:16:35', '2025-07-08 13:16:35', NULL),
(899, 11, 1, 1, 'Sardar Ali', 175, 'Nawab Jan', NULL, '2025-07-08 13:17:11', '2025-07-08 13:17:11', NULL),
(900, 3, 1, 1, 'Razeem Khan', 4, 'Hussain Khan', NULL, '2025-07-08 13:17:28', '2025-07-08 13:17:28', NULL),
(901, 3, 1, 1, 'Aslam Kahn', 5, 'Hussain Khan', NULL, '2025-07-08 13:18:08', '2025-07-08 13:18:08', NULL),
(902, 3, 1, 1, 'Tasleem', 6, 'Momen Khan', NULL, '2025-07-08 13:18:36', '2025-07-08 13:18:36', NULL),
(903, 3, 1, 1, 'Dr Zahir shah', 7, 'Xyz', NULL, '2025-07-08 13:19:11', '2025-07-08 13:19:11', NULL),
(904, 3, 1, 1, 'Razeem Khan', 8, 'Ubaid Khan', NULL, '2025-07-08 13:19:52', '2025-07-08 13:19:52', NULL),
(905, 3, 1, 1, 'Mutuwaly', 9, 'Kaboot', NULL, '2025-07-08 13:20:33', '2025-07-08 13:20:33', NULL),
(906, 3, 1, 1, 'Musmat.. Khankhela', 10, 'Xyz', NULL, '2025-07-08 13:21:18', '2025-07-08 13:21:18', NULL),
(907, 3, 1, 1, 'Afzal Rahman', 11, 'Mira Khan', NULL, '2025-07-08 13:21:54', '2025-07-08 13:21:54', NULL),
(908, 11, 1, 1, 'Muhib Jan', 176, 'Muhammad Amin', NULL, '2025-07-08 13:22:19', '2025-07-08 13:22:19', NULL),
(909, 3, 1, 1, 'Farhad', 12, 'Amir Khan', NULL, '2025-07-08 13:22:33', '2025-07-08 13:22:33', NULL),
(910, 11, 1, 1, 'Sahib Jan', 177, 'Muhammad Amin', NULL, '2025-07-08 13:22:49', '2025-07-08 13:22:49', NULL),
(911, 3, 1, 1, 'Amant', 13, 'Sher Dad', NULL, '2025-07-08 13:22:58', '2025-07-08 13:22:58', NULL),
(912, 11, 1, 1, 'Rahib Jan', 178, 'Muhammad Amin', NULL, '2025-07-08 13:23:11', '2025-07-08 13:23:11', NULL),
(913, 3, 1, 1, 'Haji Shah Hussain', 14, 'Haji Akbar Hussain', NULL, '2025-07-08 13:23:31', '2025-07-08 13:23:31', NULL),
(914, 11, 1, 1, 'Mira Jan', 179, 'Hazrat Jan', NULL, '2025-07-08 13:23:53', '2025-07-08 13:23:53', NULL),
(915, 3, 1, 1, 'Sheban ur Rai', 15, 'Haji Akbar Hussain', NULL, '2025-07-08 13:24:15', '2025-07-08 13:24:15', NULL),
(916, 11, 1, 1, 'Ajmal', 180, 'Hazrat Jan', NULL, '2025-07-08 13:24:36', '2025-07-08 13:24:36', NULL),
(917, 3, 1, 1, 'Mukharm', 16, 'Sajeed Gul', NULL, '2025-07-08 13:24:54', '2025-07-08 13:24:54', NULL),
(918, 11, 1, 1, 'Azam Khan', 181, 'Shahzad Gul', NULL, '2025-07-08 13:25:10', '2025-07-08 13:25:10', NULL),
(919, 3, 1, 1, 'Amir zada', 17, 'Zameer Gul', NULL, '2025-07-08 13:25:27', '2025-07-08 13:25:27', NULL),
(920, 3, 1, 1, 'Gul Rahman', 18, 'Majeed Gul', NULL, '2025-07-08 13:26:04', '2025-07-08 13:26:04', NULL),
(921, 11, 1, 1, 'Faizullah', 182, 'Shahzad Gul', NULL, '2025-07-08 13:26:25', '2025-07-08 13:26:25', NULL),
(922, 3, 1, 1, 'Mir Bacha', 19, 'Mir Ahmad', NULL, '2025-07-08 13:26:35', '2025-07-08 13:26:35', NULL),
(923, 11, 1, 1, 'Mir Zaman', 183, 'Shahzad Gul', NULL, '2025-07-08 13:27:02', '2025-07-08 13:27:02', NULL),
(924, 3, 1, 1, 'Mir Bahadur', 20, 'Mir Ahmad', NULL, '2025-07-08 13:27:29', '2025-07-08 13:27:29', NULL),
(925, 3, 1, 1, 'Ajmal', 21, 'Abdul Jameel', NULL, '2025-07-08 13:27:58', '2025-07-08 13:27:58', NULL),
(926, 3, 1, 1, 'Nawaz', 22, 'Abdul Ghani', NULL, '2025-07-08 13:28:19', '2025-07-08 13:28:19', NULL),
(927, 3, 1, 1, 'Tilawat', 23, 'Rahmat', NULL, '2025-07-08 13:28:46', '2025-07-08 13:28:46', NULL),
(928, 3, 1, 1, 'Shams Ur Rahman', 24, 'Muqadar', NULL, '2025-07-08 13:29:24', '2025-07-08 13:29:24', NULL),
(929, 3, 1, 1, 'Multan', 25, 'Mir aman', NULL, '2025-07-08 13:30:01', '2025-07-08 13:30:01', NULL),
(930, 3, 1, 1, 'Taj Muhammad', 26, 'Xyz', NULL, '2025-07-08 13:30:25', '2025-07-08 13:30:25', NULL),
(931, 3, 1, 1, 'Faqeer Hussain', 27, 'Mashal', NULL, '2025-07-08 13:31:03', '2025-07-08 13:31:03', NULL),
(932, 11, 1, 1, 'Momin Khan', 184, 'Shahzad Gul', NULL, '2025-07-08 13:31:05', '2025-07-08 13:31:05', NULL),
(933, 3, 1, 1, 'Fazal Hussain', 28, 'Mashal', NULL, '2025-07-08 13:31:29', '2025-07-08 13:31:29', NULL),
(934, 3, 1, 1, 'Muhammad Ali', 29, 'Meher sadeeq', NULL, '2025-07-08 13:32:15', '2025-07-08 13:32:15', NULL),
(935, 3, 1, 1, 'Abul Kalam', 30, 'Meher sadeeq', NULL, '2025-07-08 13:32:42', '2025-07-08 13:32:42', NULL),
(936, 3, 1, 1, 'Sbaz Ali', 31, 'Meher sadeeq', NULL, '2025-07-08 13:33:17', '2025-07-08 13:33:17', NULL),
(937, 11, 1, 1, 'Muhammad Wali', 185, 'Haleem Jan', NULL, '2025-07-08 13:33:36', '2025-07-08 13:33:36', NULL),
(938, 3, 1, 1, 'Nawaz Khan', 32, 'Abbas Khan', NULL, '2025-07-08 13:33:50', '2025-07-08 13:33:50', NULL),
(939, 11, 1, 1, 'Muhammad Rasool', 186, 'Haleem Jan', NULL, '2025-07-08 13:34:08', '2025-07-08 13:34:08', NULL),
(940, 3, 1, 1, 'Qaim Shah', 33, 'Rahmat Ullah', NULL, '2025-07-08 13:34:21', '2025-07-08 13:34:21', NULL),
(941, 11, 1, 1, 'Muhammad Jan', 187, 'Haleem Khan', NULL, '2025-07-08 13:34:51', '2025-07-08 13:34:51', NULL),
(942, 3, 1, 1, 'Iqbal', 34, 'Mir zada', NULL, '2025-07-08 13:35:02', '2025-07-08 13:35:02', NULL),
(943, 3, 1, 1, 'Sarwar', 35, 'Mir zada', NULL, '2025-07-08 13:35:27', '2025-07-08 13:35:27', NULL),
(944, 11, 1, 1, 'Muhammad Arif', 188, 'Haleem Jan', NULL, '2025-07-08 13:35:28', '2025-07-08 13:35:28', NULL),
(945, 11, 1, 1, 'Husain', 189, 'Haleem Jan', NULL, '2025-07-08 13:35:48', '2025-07-08 13:35:48', NULL),
(946, 11, 1, 1, 'Zabita Khan', 190, 'Sherin Jan', NULL, '2025-07-08 13:37:15', '2025-07-08 13:37:15', NULL),
(947, 3, 1, 1, 'Rashad', 36, 'Mir zada', NULL, '2025-07-08 13:37:30', '2025-07-08 13:37:30', NULL),
(948, 11, 1, 1, 'Gul Said', 191, 'Zar Jan', NULL, '2025-07-08 13:37:59', '2025-07-08 13:37:59', NULL),
(949, 3, 1, 1, 'Shahzada', 37, 'Zameer Gul', NULL, '2025-07-08 13:38:16', '2025-07-08 13:38:16', NULL),
(950, 11, 1, 1, 'Dava Jan', 192, 'Ahmad Gul', NULL, '2025-07-08 13:38:31', '2025-07-08 13:38:31', NULL),
(951, 3, 1, 1, 'Gul zada', 38, 'Zameer Gul', NULL, '2025-07-08 13:38:42', '2025-07-08 13:38:42', NULL),
(952, 11, 1, 1, 'Imran', 193, 'Mirza', NULL, '2025-07-08 13:38:53', '2025-07-08 13:38:53', NULL),
(953, 11, 1, 1, 'Abdul Jalil', 194, 'Said Akbar', NULL, '2025-07-08 13:39:19', '2025-07-08 13:39:19', NULL),
(954, 11, 1, 1, 'Zarab', 195, 'Imran', NULL, '2025-07-08 13:39:53', '2025-07-08 13:39:53', NULL),
(955, 11, 1, 1, 'Gul Khan', 196, 'Karim Jan', NULL, '2025-07-08 13:40:28', '2025-07-08 13:40:28', NULL),
(956, 3, 1, 1, 'Ghulam sadeeq', 39, 'Mugtabar', NULL, '2025-07-08 13:40:37', '2025-07-08 13:40:37', NULL),
(957, 11, 1, 1, 'Abdul Qayum', 197, 'Karim Jan', NULL, '2025-07-08 13:40:50', '2025-07-08 13:40:50', NULL),
(958, 3, 1, 1, 'Mian jee', 40, 'Rahat', NULL, '2025-07-08 13:41:07', '2025-07-08 13:41:07', NULL),
(959, 11, 1, 1, 'Ikram', 198, 'Mirza', NULL, '2025-07-08 13:41:24', '2025-07-08 13:41:24', NULL),
(960, 11, 1, 1, 'Zain Ullah', 199, 'Mirza', NULL, '2025-07-08 13:41:51', '2025-07-08 13:41:51', NULL),
(961, 11, 1, 1, 'Hanif Ullah', 200, 'Mirza', NULL, '2025-07-08 13:42:28', '2025-07-08 13:42:28', NULL),
(962, 11, 1, 1, 'Said', 201, 'Faqir', NULL, '2025-07-08 13:42:57', '2025-07-08 13:42:57', NULL),
(963, 11, 1, 1, 'Shahzor', 202, 'Gujjar Khan', NULL, '2025-07-08 13:46:09', '2025-07-08 13:46:09', NULL),
(964, 11, 1, 1, 'Ayub Khan, Fazal Rahman', 203, 'Abdul Akbar', NULL, '2025-07-08 13:46:49', '2025-07-08 13:46:49', NULL),
(965, 11, 1, 1, 'Sarfaraz', 204, 'Sherin Jan', NULL, '2025-07-08 13:47:18', '2025-07-08 13:47:18', NULL),
(966, 11, 1, 1, 'Muhammad Karim', 205, 'Sharif Jan', NULL, '2025-07-08 13:48:54', '2025-07-08 13:48:54', NULL),
(967, 11, 1, 1, 'Arbab', 206, 'Said Jan', NULL, '2025-07-08 13:49:29', '2025-07-08 13:49:29', NULL),
(968, 11, 1, 1, 'Suhbat Khan', 207, 'Noor Hasan', NULL, '2025-07-08 13:50:32', '2025-07-08 13:50:32', NULL),
(969, 11, 1, 1, 'Faqir Gul', 208, 'Khan Zada', NULL, '2025-07-08 13:51:13', '2025-07-08 13:51:13', NULL),
(970, 11, 1, 1, 'Misal Khan', 209, 'Bahadur Sher', NULL, '2025-07-08 13:52:11', '2025-07-08 13:52:11', NULL),
(971, 11, 1, 1, 'Ghulam Said', 210, 'Umer Din', NULL, '2025-07-08 13:52:39', '2025-07-08 13:52:39', NULL),
(972, 11, 1, 1, 'Faiz Ullah', 211, 'Aslam', NULL, '2025-07-08 13:53:46', '2025-07-08 13:53:46', NULL),
(973, 11, 1, 1, 'Zafar', 212, 'Aslam', NULL, '2025-07-08 13:54:02', '2025-07-08 13:54:02', NULL),
(974, 11, 1, 1, 'Hameed Ullah', 213, 'Aslam', NULL, '2025-07-08 13:54:23', '2025-07-08 13:54:23', NULL),
(975, 11, 1, 1, 'Yaqoob', 214, 'Painda Khan', NULL, '2025-07-08 13:54:52', '2025-07-08 13:54:52', NULL),
(976, 11, 1, 1, 'Mian Khan', 215, 'Haji Anwar', NULL, '2025-07-08 14:50:46', '2025-07-08 14:50:46', NULL),
(977, 11, 1, 1, 'Muhammad Khan', 216, 'Haji Anwar', NULL, '2025-07-08 14:51:36', '2025-07-08 14:51:36', NULL),
(978, 11, 1, 1, 'Basher Gujjar', 217, 'Bahadur', NULL, '2025-07-08 14:52:48', '2025-07-08 14:52:48', NULL),
(979, 11, 1, 1, 'Aman Ullah Khan', 218, 'N/A', NULL, '2025-07-08 14:53:50', '2025-07-08 14:53:50', NULL),
(980, 11, 1, 1, 'Aman Ullah Khan', 219, 'N/A', NULL, '2025-07-08 14:54:18', '2025-07-08 14:54:18', NULL),
(981, 11, 1, 1, 'Aman Ullah Khan', 220, 'N/A', NULL, '2025-07-08 15:38:58', '2025-07-08 15:38:58', NULL),
(982, 11, 1, 1, 'Aman Ullah Khan', 221, 'Inayat Ullah Khan', NULL, '2025-07-08 15:39:38', '2025-07-08 15:39:38', NULL),
(983, 11, 1, 1, 'Aziz Ullah Khan', 222, 'Inayat Ullah Khan', NULL, '2025-07-08 15:40:33', '2025-07-08 15:40:33', NULL),
(984, 11, 1, 1, 'Aman Ullah Khan', 223, 'N/A', NULL, '2025-07-08 15:41:06', '2025-07-08 15:41:06', NULL);
INSERT INTO `irrigators` (`id`, `village_id`, `div_id`, `canal_id`, `irrigator_name`, `irrigator_khata_number`, `irrigator_f_name`, `irrigator_mobile_number`, `created_at`, `updated_at`, `cnic`) VALUES
(985, 11, 1, 1, 'Aman Ullah Khan', 224, 'N/A', NULL, '2025-07-08 15:41:29', '2025-07-08 15:41:29', NULL),
(986, 11, 1, 1, 'Aziz Ullah Khan', 225, 'Inayat Ullah Khan', NULL, '2025-07-08 15:42:36', '2025-07-08 15:42:36', NULL),
(987, 11, 1, 1, 'Aman Ullah Khan', 226, 'Inayat Ullah Khan', NULL, '2025-07-08 15:44:24', '2025-07-08 15:44:24', NULL),
(988, 11, 1, 1, 'Hamdum Minallah Mian', 227, 'N/A', NULL, '2025-07-08 15:48:53', '2025-07-08 15:48:53', NULL),
(989, 11, 1, 1, 'Hamdum Minallah Mian', 228, 'N/A', NULL, '2025-07-08 15:49:09', '2025-07-08 15:49:09', NULL),
(990, 11, 1, 1, 'Hamdum Minallah Mian', 229, 'N/A', NULL, '2025-07-08 15:49:25', '2025-07-08 15:49:25', NULL),
(991, 11, 1, 1, 'Hamdum Minallah Mian', 230, 'N/A', NULL, '2025-07-08 15:50:04', '2025-07-08 15:50:04', NULL),
(992, 11, 1, 1, 'Hamdum Minallah Mian', 231, 'N/A', NULL, '2025-07-08 15:50:14', '2025-07-08 15:50:14', NULL),
(993, 11, 1, 1, 'Musanif Shah', 232, 'Wahid Mian', NULL, '2025-07-08 15:51:51', '2025-07-08 15:51:51', NULL),
(994, 11, 1, 1, 'Hamdum Minallah Mian', 233, 'N/A', NULL, '2025-07-08 15:52:30', '2025-07-08 15:52:30', NULL),
(995, 11, 1, 1, 'Falak Niaz', 234, 'Abdur Rab', NULL, '2025-07-08 15:54:04', '2025-07-08 15:54:04', NULL),
(996, 11, 1, 1, 'Aftab Husain', 235, 'Majeed Ullah', NULL, '2025-07-08 15:54:36', '2025-07-08 15:54:36', NULL),
(997, 11, 1, 1, 'Mati Ullah Mian', 236, 'N/A', NULL, '2025-07-08 15:55:34', '2025-07-08 15:55:34', NULL),
(998, 11, 1, 1, 'Mati Ullah Mian', 237, 'N/A', NULL, '2025-07-08 15:55:59', '2025-07-08 15:55:59', NULL),
(999, 11, 1, 1, 'Dr. Noshad Ali Kaka Khel', 238, 'Hamdum Minallah', NULL, '2025-07-08 15:58:21', '2025-07-08 15:58:21', NULL),
(1000, 11, 1, 1, 'Abdul Latif', 239, 'N/A', NULL, '2025-07-08 16:01:34', '2025-07-08 16:01:34', NULL),
(1001, 11, 1, 1, 'Mian Anwar Shah', 240, 'Karim Ullah Mian', NULL, '2025-07-08 16:02:44', '2025-07-08 16:02:44', NULL),
(1002, 11, 1, 1, 'Asad Mian', 241, 'Abdur Rab Mian', NULL, '2025-07-08 16:03:33', '2025-07-08 16:03:33', NULL),
(1003, 11, 1, 1, 'Hamdum Minallah Mian', 242, 'N/A', NULL, '2025-07-08 16:04:13', '2025-07-08 16:04:13', NULL),
(1004, 11, 1, 1, 'Abdul Latif', 243, 'Abdur Rab Mian', NULL, '2025-07-08 16:04:51', '2025-07-08 16:04:51', NULL),
(1005, 11, 1, 1, 'Hamdum Minallah Mian', 244, 'N/A', NULL, '2025-07-08 16:05:20', '2025-07-08 16:05:20', NULL),
(1006, 11, 1, 1, 'Hamdum Minallah Mian', 245, 'N/A', NULL, '2025-07-08 16:05:42', '2025-07-08 16:05:42', NULL),
(1007, 11, 1, 1, 'Hamdum Minallah Mian', 246, 'N/A', NULL, '2025-07-08 16:06:01', '2025-07-08 16:06:01', NULL),
(1008, 11, 1, 1, 'Hamdum Minallah Mian', 247, 'N/A', NULL, '2025-07-08 16:06:25', '2025-07-08 16:06:25', NULL),
(1009, 11, 1, 1, 'Miraj Husain', 248, 'Majeed Ullah', NULL, '2025-07-08 16:07:05', '2025-07-08 16:07:05', NULL),
(1010, 11, 1, 1, 'Mir Zaman, Iftihar', 249, 'N/A', NULL, '2025-07-08 16:09:33', '2025-07-08 16:09:33', NULL),
(1011, 11, 1, 1, 'Abdul Ghaffar', 250, 'Amin Gul', NULL, '2025-07-08 16:10:38', '2025-07-08 16:10:38', NULL),
(1012, 11, 1, 1, 'Akbar Khan', 251, 'Said Miraan', NULL, '2025-07-08 16:12:02', '2025-07-08 16:12:02', NULL),
(1013, 11, 1, 1, 'Janat Gul', 251, 'Shahzad Gul', '-', '2025-07-08 16:12:45', '2025-07-08 16:13:34', NULL),
(1014, 11, 1, 1, 'Abdul Wahab', 252, 'Afridi', NULL, '2025-07-08 16:15:09', '2025-07-08 16:15:09', NULL),
(1015, 11, 1, 1, 'Sher Bahadur', 253, 'Mir Zada', NULL, '2025-07-08 16:18:11', '2025-07-08 16:18:11', NULL),
(1016, 11, 1, 1, 'Anwar Hasan', 254, 'Hamaish Gul', NULL, '2025-07-08 16:18:42', '2025-07-08 16:18:42', NULL),
(1017, 11, 1, 1, 'Fazal Akram', 255, 'Habib Gul', NULL, '2025-07-08 16:19:58', '2025-07-08 16:19:58', NULL),
(1018, 11, 1, 1, 'Rahmat Gul', 256, 'Mian Gul', NULL, '2025-07-08 16:20:36', '2025-07-08 16:20:36', NULL),
(1019, 11, 1, 1, 'Noor Faraz', 257, 'Hamaish Gul', '-', '2025-07-08 16:21:24', '2025-07-08 16:25:27', NULL),
(1020, 11, 1, 1, 'Faiz Muhammad', 258, 'Sultan', NULL, '2025-07-08 16:25:39', '2025-07-08 16:25:39', NULL),
(1021, 11, 1, 1, 'Hunar Khan', 259, 'Hamaish Gul', NULL, '2025-07-08 16:26:53', '2025-07-08 16:26:53', NULL),
(1022, 11, 1, 1, 'Anwar Hasan- Mother', 260, 'N/A', NULL, '2025-07-08 16:27:37', '2025-07-08 16:27:37', NULL),
(1023, 11, 1, 1, 'Itibar Khan', 261, 'Sher Azam', NULL, '2025-07-08 16:29:51', '2025-07-08 16:29:51', NULL),
(1024, 11, 1, 1, 'Sher', 262, 'Din Muhammad', NULL, '2025-07-08 16:30:33', '2025-07-08 16:30:33', NULL),
(1025, 11, 1, 1, 'Ghani', 263, 'Sultan', NULL, '2025-07-08 16:31:08', '2025-07-08 16:31:08', NULL),
(1026, 11, 1, 1, 'Javed', 264, 'Khan Muhammad', NULL, '2025-07-08 16:32:21', '2025-07-08 16:32:21', NULL),
(1027, 11, 1, 1, 'Nadar', 265, 'Yousaf', NULL, '2025-07-08 16:33:25', '2025-07-08 16:33:25', NULL),
(1028, 11, 1, 1, 'Muhammad Jan', 266, 'Khan Said', NULL, '2025-07-08 16:34:13', '2025-07-08 16:34:13', NULL),
(1029, 11, 1, 1, 'Laal Zaman', 267, 'Adam Khan', NULL, '2025-07-08 16:34:38', '2025-07-08 16:34:38', NULL),
(1030, 11, 1, 1, 'Akbar Ali', 268, 'Shah Zada', NULL, '2025-07-08 16:35:27', '2025-07-08 16:35:27', NULL),
(1031, 11, 1, 1, 'Muhammad', 269, 'Dilawar', NULL, '2025-07-08 16:36:05', '2025-07-08 16:36:05', NULL),
(1032, 11, 1, 1, 'Zahir Shah', 270, 'Sher Zada', NULL, '2025-07-08 16:37:10', '2025-07-08 16:37:10', NULL),
(1033, 11, 1, 1, 'Firdos', 271, 'Gulab', NULL, '2025-07-08 16:38:48', '2025-07-08 16:38:48', NULL),
(1034, 11, 1, 1, 'Baharam', 272, 'Mir Zaman', NULL, '2025-07-08 16:39:27', '2025-07-08 16:39:27', NULL),
(1035, 11, 1, 1, 'Kashmir', 273, 'Mir Zaman', NULL, '2025-07-08 16:40:09', '2025-07-08 16:40:09', NULL),
(1036, 11, 1, 1, 'Aimal', 274, 'Itibar', NULL, '2025-07-08 16:41:12', '2025-07-08 16:41:12', NULL),
(1037, 11, 1, 1, 'Aimal Husain', 275, 'N/A', NULL, '2025-07-08 16:42:51', '2025-07-08 16:42:51', NULL),
(1038, 11, 1, 1, 'Bacha', 276, 'Abdul Majeed', NULL, '2025-07-08 16:43:24', '2025-07-08 16:43:24', NULL),
(1039, 11, 1, 1, 'Rustam', 277, 'Hamaish Gul', NULL, '2025-07-08 16:44:31', '2025-07-08 16:44:31', NULL),
(1040, 11, 1, 1, 'Hazrat Muhammad', 278, 'Dilawar', NULL, '2025-07-08 16:45:02', '2025-07-08 16:45:02', NULL),
(1041, 11, 1, 1, 'Dost Muhammad', 279, 'Dilawar', NULL, '2025-07-08 16:45:40', '2025-07-08 16:45:40', NULL),
(1043, 11, 1, 1, 'Gohar', 280, 'Khan Afzal', NULL, '2025-07-08 16:46:49', '2025-07-08 16:46:49', NULL),
(1044, 11, 1, 1, 'Badshah Shams Ur Rahman', 281, 'Ahmad Khan', NULL, '2025-07-08 16:49:17', '2025-07-08 16:49:17', NULL),
(1045, 11, 1, 1, 'Arab Khan', 281, 'Nadar Khan', NULL, '2025-07-08 19:06:48', '2025-07-08 19:06:48', NULL),
(1046, 11, 1, 1, 'Jamshed', 282, 'Mir Zaman', NULL, '2025-07-08 19:07:15', '2025-07-08 19:07:15', NULL),
(1047, 11, 1, 1, 'Noor Gul', 283, 'Habib Gul', NULL, '2025-07-08 19:08:39', '2025-07-08 19:08:39', NULL),
(1048, 11, 1, 1, 'Said', 284, 'Naimtool', NULL, '2025-07-08 19:09:17', '2025-07-08 19:09:17', NULL),
(1049, 11, 1, 1, 'Said Zafar Ali', 285, 'N/A', NULL, '2025-07-08 19:10:05', '2025-07-08 19:10:05', NULL),
(1050, 11, 1, 1, 'Muhammad Shah', 286, 'Sher Wali', NULL, '2025-07-08 19:10:36', '2025-07-08 19:10:36', NULL),
(1051, 11, 1, 1, 'Muhammad Ishaq', 287, 'Gul Wali', NULL, '2025-07-08 19:12:27', '2025-07-08 19:12:27', NULL),
(1052, 11, 1, 1, 'Muhammad Amin', 288, 'Gul Rahman', NULL, '2025-07-08 19:14:23', '2025-07-08 19:14:23', NULL),
(1053, 11, 1, 1, 'Khan Muhammad (a.k.a Khanay)', 289, 'N/A', NULL, '2025-07-08 19:16:17', '2025-07-08 19:16:17', NULL),
(1054, 11, 1, 1, 'Sher Zaman, Muzamil Shah', 290, 'N/A', NULL, '2025-07-08 19:17:20', '2025-07-08 19:17:20', NULL),
(1055, 11, 1, 1, 'Hazrat Gul', 291, 'Alam Gul', NULL, '2025-07-08 19:17:56', '2025-07-08 19:17:56', NULL),
(1056, 11, 1, 1, 'Wakeel Khan', 292, 'Hazrat Gul', '-', '2025-07-08 19:18:27', '2025-07-08 19:19:05', NULL),
(1057, 11, 1, 1, 'Stana Gul', 293, 'Miran Said', '-', '2025-07-08 19:20:09', '2025-07-08 19:22:36', NULL),
(1058, 11, 1, 1, 'Said Ahmad', 294, 'Gul Ahmad', NULL, '2025-07-08 19:20:42', '2025-07-08 19:20:42', NULL),
(1059, 11, 1, 1, 'Molana Noman', 295, 'N/A', NULL, '2025-07-08 19:24:29', '2025-07-08 19:24:29', NULL),
(1060, 11, 1, 1, 'Molana Noman', 296, 'N/A', NULL, '2025-07-08 19:25:43', '2025-07-08 19:25:43', NULL),
(1061, 11, 1, 1, 'Said Muhammad', 297, 'Gul Ahmad', NULL, '2025-07-08 19:26:42', '2025-07-08 19:26:42', NULL),
(1062, 11, 1, 1, 'Bahram', 298, 'Mir Zaman', NULL, '2025-07-08 19:28:49', '2025-07-08 19:28:49', NULL),
(1063, 11, 1, 1, 'Muhammad Afzal', 299, 'Mir Zaman', NULL, '2025-07-08 19:29:27', '2025-07-08 19:29:27', NULL),
(1064, 11, 1, 1, 'Aman Ullah Khan', 300, 'N/A', NULL, '2025-07-08 19:31:51', '2025-07-08 19:31:51', NULL),
(1065, 11, 1, 1, 'Aman Ullah Khan', 301, 'N/A', NULL, '2025-07-08 19:53:01', '2025-07-08 19:53:01', NULL),
(1066, 11, 1, 1, 'Aman Ullah Khan', 302, 'N/A', NULL, '2025-07-08 19:53:22', '2025-07-08 19:53:22', NULL),
(1067, 11, 1, 1, 'Aman Ullah Khan', 303, 'N/A', NULL, '2025-07-08 19:53:44', '2025-07-08 19:53:44', NULL),
(1068, 11, 1, 1, 'Aman Ullah Khan', 304, 'N/A', NULL, '2025-07-08 19:54:00', '2025-07-08 19:54:00', NULL),
(1069, 11, 1, 1, 'Aman Ullah Khan', 305, 'N/A', NULL, '2025-07-08 19:54:18', '2025-07-08 19:54:18', NULL),
(1070, 11, 1, 1, 'Aman Ullah Khan', 306, 'N/A', NULL, '2025-07-08 19:54:32', '2025-07-08 19:54:32', NULL),
(1071, 11, 1, 1, 'Aman Ullah Khan', 307, 'N/A', NULL, '2025-07-08 19:55:02', '2025-07-08 19:55:02', NULL),
(1072, 11, 1, 1, 'Aman Ullah Khan', 308, 'N/A', NULL, '2025-07-08 20:07:51', '2025-07-08 20:07:51', NULL),
(1073, 11, 1, 1, 'Aman Ullah Khan', 309, 'N/A', NULL, '2025-07-08 20:08:05', '2025-07-08 20:08:05', NULL),
(1074, 11, 1, 1, 'Aman Ullah Khan', 310, 'N/A', NULL, '2025-07-08 20:08:19', '2025-07-08 20:08:19', NULL),
(1075, 11, 1, 1, 'Aman Ullah Khan', 311, 'N/A', NULL, '2025-07-08 20:08:38', '2025-07-08 20:08:38', NULL),
(1076, 11, 1, 1, 'Aman Ullah Khan', 312, 'N/A', NULL, '2025-07-08 20:08:49', '2025-07-08 20:08:49', NULL),
(1077, 11, 1, 1, 'Aman Ullah Khan', 313, 'N/A', NULL, '2025-07-08 20:09:15', '2025-07-08 20:09:15', NULL),
(1078, 11, 1, 1, 'Aman Ullah Khan', 314, 'N/A', NULL, '2025-07-08 20:09:43', '2025-07-08 20:09:43', NULL),
(1079, 11, 1, 1, 'Aman Ullah Khan', 315, 'N/A', NULL, '2025-07-08 20:09:57', '2025-07-08 20:09:57', NULL),
(1080, 11, 1, 1, 'Aman Ullah Khan', 316, 'N/A', NULL, '2025-07-08 20:10:22', '2025-07-08 20:10:22', NULL),
(1081, 11, 1, 1, 'Aman Ullah Khan', 317, 'N/A', NULL, '2025-07-08 20:10:45', '2025-07-08 20:10:45', NULL),
(1082, 11, 1, 1, 'Aman Ullah Khan', 318, 'N/A', NULL, '2025-07-08 20:11:00', '2025-07-08 20:11:00', NULL),
(1083, 11, 1, 1, 'Aman Ullah Khan', 319, 'N/A', NULL, '2025-07-08 20:12:17', '2025-07-08 20:12:17', NULL),
(1084, 11, 1, 1, 'Aman Ullah Khan', 320, 'N/A', NULL, '2025-07-08 20:12:41', '2025-07-08 20:12:41', NULL),
(1085, 11, 1, 1, 'Atta Ullah', 321, 'Mujeeb', NULL, '2025-07-08 20:21:26', '2025-07-08 20:21:26', NULL),
(1086, 11, 1, 1, 'Najeeb', 322, 'Mujeeb', NULL, '2025-07-08 20:22:03', '2025-07-08 20:22:03', NULL),
(1087, 11, 1, 1, 'Aman Ullah Khan', 323, 'N/A', NULL, '2025-07-08 20:49:39', '2025-07-08 20:49:39', NULL),
(1088, 11, 1, 1, 'Aman Ullah Khan', 324, 'N/A', NULL, '2025-07-08 20:50:01', '2025-07-08 20:50:01', NULL),
(1089, 11, 1, 1, 'Aman Ullah Khan', 325, 'N/A', NULL, '2025-07-08 20:50:18', '2025-07-08 20:50:18', NULL),
(1090, 11, 1, 1, 'Aziz Ullah', 326, 'Inayat Ullah Khan', NULL, '2025-07-08 20:51:17', '2025-07-08 20:51:17', NULL),
(1091, 11, 1, 1, 'Samin Khan', 327, 'Inam Ullah Khan', NULL, '2025-07-08 21:30:52', '2025-07-08 21:30:52', NULL),
(1092, 11, 1, 1, 'Samin Khan', 328, 'Inam Ullah Khan', NULL, '2025-07-08 21:31:20', '2025-07-08 21:31:20', NULL),
(1093, 11, 1, 1, 'Inam Ullah Khan', 329, 'Inayat Ullah', NULL, '2025-07-08 21:32:03', '2025-07-08 21:32:03', NULL),
(1094, 11, 1, 1, 'Inam Ullah', 330, 'Inayat Ullah', NULL, '2025-07-08 21:33:03', '2025-07-08 21:33:03', NULL),
(1095, 11, 1, 1, 'Inam Ullah', 331, 'Inayat Ullah', NULL, '2025-07-08 21:33:27', '2025-07-08 21:33:27', NULL),
(1096, 11, 1, 1, 'Inam Ullah', 332, 'Inayat Ullah', NULL, '2025-07-08 21:34:12', '2025-07-08 21:34:12', NULL),
(1097, 11, 1, 1, 'Inam Ullah', 333, 'Inayat Ullah', NULL, '2025-07-08 21:34:38', '2025-07-08 21:34:38', NULL),
(1098, 11, 1, 1, 'Inam Ullah', 334, 'Inayat Ullah', NULL, '2025-07-08 21:35:10', '2025-07-08 21:35:10', NULL),
(1099, 11, 1, 1, 'Inam Ullah', 335, 'Inayat Ullah', NULL, '2025-07-08 21:35:49', '2025-07-08 21:35:49', NULL),
(1100, 11, 1, 1, 'Inam Ullah Khan', 336, 'N/A', NULL, '2025-07-08 21:38:46', '2025-07-08 21:38:46', NULL),
(1101, 11, 1, 1, 'Inam Ullah Khan', 337, 'N/A', NULL, '2025-07-08 21:38:56', '2025-07-08 21:38:56', NULL),
(1102, 11, 1, 1, 'Inam Ullah Khan', 338, 'N/A', NULL, '2025-07-08 21:39:22', '2025-07-08 21:39:22', NULL),
(1103, 11, 1, 1, 'Inam Ullah Khan', 339, 'N/A', NULL, '2025-07-08 21:39:34', '2025-07-08 21:39:34', NULL),
(1104, 11, 1, 1, 'Inam Ullah Khan', 340, 'N/A', NULL, '2025-07-08 21:40:02', '2025-07-08 21:40:02', NULL),
(1105, 11, 1, 1, 'Inam Ullah Khan', 341, 'N/A', NULL, '2025-07-08 21:40:27', '2025-07-08 21:40:27', NULL),
(1106, 11, 1, 1, 'Inam Ullah Khan', 342, 'N/A', NULL, '2025-07-08 21:40:37', '2025-07-08 21:40:37', NULL),
(1107, 11, 1, 1, 'Inam Ullah Khan', 343, 'N/A', NULL, '2025-07-08 21:40:49', '2025-07-08 21:40:49', NULL),
(1108, 11, 1, 1, 'Inam Ullah Khan', 344, 'N/A', NULL, '2025-07-08 21:41:14', '2025-07-08 21:41:14', NULL),
(1109, 13, 1, 1, 'Khan Ghalib', 3, 'Ziarat Gul', NULL, '2025-07-09 01:00:16', '2025-07-09 01:00:16', NULL),
(1110, 21, 1, 1, 'Miss Mukhtiar Bagum', 1, 'W/O Farid Khan', NULL, '2025-07-09 01:31:52', '2025-07-09 01:31:52', NULL),
(1111, 21, 1, 1, 'Ismail (PRC Mardan)', 2, 'xyz', NULL, '2025-07-09 01:43:46', '2025-07-09 01:43:46', NULL),
(1112, 21, 1, 1, 'Ibrahim (PRC Mardan)', 3, 'xyz', NULL, '2025-07-09 01:50:50', '2025-07-09 01:50:50', NULL),
(1113, 21, 1, 1, 'PRC Mardan', 4, 'xyz', NULL, '2025-07-09 01:51:28', '2025-07-09 01:51:28', NULL),
(1114, 21, 1, 1, 'Aman Ullah Khan', 5, 'Inayat Ullah', NULL, '2025-07-09 01:52:02', '2025-07-09 01:52:02', NULL),
(1115, 21, 1, 1, 'Abbass Khan', 6, 'Aziz Khan', NULL, '2025-07-09 01:52:58', '2025-07-09 01:52:58', NULL),
(1116, 21, 1, 1, 'Inam Khan', 7, 'Hakim Mir Zaman Khan', NULL, '2025-07-09 01:53:27', '2025-07-09 01:53:27', NULL),
(1117, 21, 1, 1, 'Saeed Khan', 8, 'Hakim Mir Zaman Khan', NULL, '2025-07-09 01:53:54', '2025-07-09 01:53:54', NULL),
(1118, 21, 1, 1, 'Jahangeer Khan', 9, 'Iqbal Khan', NULL, '2025-07-09 01:54:14', '2025-07-09 01:54:14', NULL),
(1119, 21, 1, 1, 'Tahir Khan', 10, 'Malak Aman', NULL, '2025-07-09 01:54:39', '2025-07-09 01:54:39', NULL),
(1120, 21, 1, 1, 'Aurangzeb', 11, 'Islam Ud Din', NULL, '2025-07-09 01:56:18', '2025-07-09 01:56:18', NULL),
(1121, 21, 1, 1, 'Zahoor', 12, 'Zar Dullah', NULL, '2025-07-09 01:56:44', '2025-07-09 01:56:44', NULL),
(1122, 21, 1, 1, 'Haji Musarat Shah', 13, 'Mukamil Shah', NULL, '2025-07-09 01:57:16', '2025-07-09 01:57:16', NULL),
(1123, 21, 1, 1, 'Abdullah', 14, 'Saiffur Khan', NULL, '2025-07-09 01:57:42', '2025-07-09 01:57:42', NULL),
(1124, 21, 1, 1, 'Ikram Shah', 15, 'Hamayun Saiffur Khan', NULL, '2025-07-09 01:58:10', '2025-07-09 01:58:10', NULL),
(1125, 21, 1, 1, 'Hamayun', 16, 'Saiffur Khan', NULL, '2025-07-09 01:58:31', '2025-07-09 01:58:31', NULL),
(1126, 21, 1, 1, 'Ayub Khan', 17, 'Fojun', NULL, '2025-07-09 02:00:08', '2025-07-09 02:00:08', NULL),
(1127, 21, 1, 1, 'Muhammad Akbar', 18, 'Abdur Rahim', NULL, '2025-07-09 02:01:55', '2025-07-09 02:01:55', NULL),
(1128, 21, 1, 1, 'Nasir Khan', 19, 'Jamil Khan', NULL, '2025-07-09 02:02:12', '2025-07-09 02:02:12', NULL),
(1129, 21, 1, 1, 'Muhammad Rafiq', 20, 'Zarif Khan', NULL, '2025-07-09 02:02:39', '2025-07-09 02:02:39', NULL),
(1130, 21, 1, 1, 'Ajmal Khan', 21, 'Yaqoob Khan', NULL, '2025-07-09 02:03:09', '2025-07-09 02:03:09', NULL),
(1131, 21, 1, 1, 'Aziz Khan', 22, 'Sarfaraz Khan', NULL, '2025-07-09 02:04:03', '2025-07-09 02:04:03', NULL),
(1132, 21, 1, 1, 'Haji Iqbal', 23, 'Tamash Khan', NULL, '2025-07-09 02:04:35', '2025-07-09 02:04:35', NULL),
(1133, 21, 1, 1, 'Saleem Khan', 24, 'Ghulam Ahmad Khan', NULL, '2025-07-09 02:04:55', '2025-07-09 02:04:55', NULL),
(1134, 21, 1, 1, 'Amin Khan', 25, 'Latif Khan', NULL, '2025-07-09 02:05:43', '2025-07-09 02:05:43', NULL),
(1135, 21, 1, 1, 'Aqeela Bagum', 26, 'W/o Umar Khan', NULL, '2025-07-09 02:06:18', '2025-07-09 02:06:18', NULL),
(1136, 21, 1, 1, 'Fazle Subhan', 27, 'Mira Khan', NULL, '2025-07-09 02:06:56', '2025-07-09 02:06:56', NULL),
(1137, 21, 1, 1, 'Ahmad Khan Bahadar', 28, 'Ali Haider', NULL, '2025-07-09 02:07:16', '2025-07-09 02:07:16', NULL),
(1138, 21, 1, 1, 'Riaz Khan', 29, 'Nawab Khan', NULL, '2025-07-09 02:07:59', '2025-07-09 02:07:59', NULL),
(1139, 21, 1, 1, 'Haji Abdul Wahab', 30, 'Nawab Abdul Khaliq', NULL, '2025-07-09 02:08:26', '2025-07-09 02:08:26', NULL),
(1140, 21, 1, 1, 'Haji Abdul Wahab', 31, 'Khan Meer', NULL, '2025-07-09 02:08:45', '2025-07-09 02:08:45', NULL),
(1141, 21, 1, 1, 'Malak Aman Ullah Khan', 32, 'Ferdos Khan', NULL, '2025-07-09 02:09:22', '2025-07-09 02:09:22', NULL),
(1142, 21, 1, 1, 'Haji Musarat Shah', 33, 'Mukamil Shah', NULL, '2025-07-09 02:16:31', '2025-07-09 02:16:31', NULL),
(1143, 21, 1, 1, 'Suhan Ud Din', 34, 'Mir Akbar', NULL, '2025-07-09 02:16:54', '2025-07-09 02:16:54', NULL),
(1144, 21, 1, 1, 'Alamzeb', 35, 'Sahib Zar', NULL, '2025-07-09 02:17:17', '2025-07-09 02:17:17', NULL),
(1145, 21, 1, 1, 'Shahid Khan', 36, 'Jafar Khan', NULL, '2025-07-09 02:17:44', '2025-07-09 02:17:44', NULL),
(1146, 21, 1, 1, 'Rehan Ud Din', 37, 'Raham Din', NULL, '2025-07-09 02:23:05', '2025-07-09 02:23:05', NULL),
(1147, 21, 1, 1, 'Dr. Farhat Ullah', 38, 'Israr Ullah', NULL, '2025-07-09 02:23:59', '2025-07-09 02:23:59', NULL),
(1148, 21, 1, 1, 'Inam Malak', 39, 'Aziz Malak', NULL, '2025-07-09 02:24:16', '2025-07-09 02:24:16', NULL),
(1149, 21, 1, 1, 'Zahid', 40, 'Zafar Khan', NULL, '2025-07-09 02:24:32', '2025-07-09 02:24:32', NULL),
(1150, 21, 1, 1, 'Haji Ameer', 41, 'xyz', NULL, '2025-07-09 02:24:54', '2025-07-09 02:24:54', NULL),
(1151, 21, 1, 1, 'Asif', 42, 'Safdar', NULL, '2025-07-09 02:25:18', '2025-07-09 02:25:18', NULL),
(1152, 21, 1, 1, 'Qayum Malak', 43, 'Zia Ud Din', NULL, '2025-07-09 02:25:50', '2025-07-09 02:25:50', NULL),
(1153, 21, 1, 1, 'Saeed Malak', 44, 'Sher Malak', NULL, '2025-07-09 02:26:16', '2025-07-09 02:26:16', NULL),
(1154, 21, 1, 1, 'Sher Malak', 45, 'Zia ud Din', NULL, '2025-07-09 02:26:41', '2025-07-09 02:26:41', NULL),
(1155, 21, 1, 1, 'Shakoor', 46, 'Mashal', NULL, '2025-07-09 02:27:36', '2025-07-09 02:27:36', NULL),
(1156, 21, 1, 1, 'Saleem', 47, 'Ghulab Din', NULL, '2025-07-09 02:27:51', '2025-07-09 02:27:51', NULL),
(1157, 21, 1, 1, 'Abdul Rehman Khan', 48, 'Shah Zada', NULL, '2025-07-09 02:28:14', '2025-07-09 02:28:14', NULL),
(1158, 21, 1, 1, 'Shajahan', 49, 'Misbah Ud Din', NULL, '2025-07-09 02:28:39', '2025-07-09 02:28:39', NULL),
(1159, 21, 1, 1, 'Hashim Malak', 50, 'Rafi Ud Din', NULL, '2025-07-09 02:28:58', '2025-07-09 02:28:58', NULL),
(1160, 21, 1, 1, 'Sher Dad', 51, 'Nazar Din', NULL, '2025-07-09 02:29:14', '2025-07-09 02:29:14', NULL),
(1161, 21, 1, 1, 'Haji Rehan Ud Din', 52, 'Rafi Ud Din', NULL, '2025-07-09 02:29:36', '2025-07-09 02:29:36', NULL),
(1162, 21, 1, 1, 'Haji  Niamuddin', 53, 'Fazal Din', NULL, '2025-07-09 02:31:04', '2025-07-09 02:31:04', NULL),
(1163, 21, 1, 1, 'Usman Khan', 54, 'Hashim Malak', NULL, '2025-07-09 02:31:24', '2025-07-09 02:31:24', NULL),
(1164, 21, 1, 1, 'Sarzamin', 55, 'Chamne', NULL, '2025-07-09 02:32:04', '2025-07-09 02:32:04', NULL),
(1165, 21, 1, 1, 'Faqir Malak', 56, 'Rehan ud Din', NULL, '2025-07-09 02:32:26', '2025-07-09 02:32:26', NULL),
(1166, 21, 1, 1, 'Shamsul Wahab', 57, 'Abdul Wahab', NULL, '2025-07-09 02:32:53', '2025-07-09 02:32:53', NULL),
(1167, 21, 1, 1, 'Amin', 58, 'Jalal Din', NULL, '2025-07-09 02:33:19', '2025-07-09 02:33:19', NULL),
(1168, 21, 1, 1, 'Akbar Ali', 59, 'Wazeer', NULL, '2025-07-09 02:33:46', '2025-07-09 02:33:46', NULL),
(1169, 21, 1, 1, 'Ghani', 60, 'Sher Khan', NULL, '2025-07-09 02:34:04', '2025-07-09 02:34:04', NULL),
(1170, 21, 1, 1, 'Aslam', 61, 'Ghulab Din', NULL, '2025-07-09 02:34:23', '2025-07-09 02:34:23', NULL),
(1171, 21, 1, 1, 'Farman', 62, 'Zabita', NULL, '2025-07-09 02:34:47', '2025-07-09 02:34:47', NULL),
(1172, 21, 1, 1, 'Khan Baig', 63, 'Mirza Baig', NULL, '2025-07-09 02:36:56', '2025-07-09 02:36:56', NULL),
(1173, 21, 1, 1, 'Noor ud Din', 64, 'Ashraf ud Din', NULL, '2025-07-09 02:37:42', '2025-07-09 02:37:42', NULL),
(1174, 21, 1, 1, 'Wilayat', 65, 'Imran ud Din', NULL, '2025-07-09 02:38:11', '2025-07-09 02:38:11', NULL),
(1176, 21, 1, 1, 'Shakoor', 66, 'Subhan ud Din', NULL, '2025-07-09 03:07:29', '2025-07-09 03:07:29', NULL),
(1178, 21, 1, 1, 'Islam', 68, 'Ghulab Din', NULL, '2025-07-09 03:08:13', '2025-07-09 03:08:13', NULL),
(1179, 21, 1, 1, 'Waris', 69, 'xyz', NULL, '2025-07-09 03:08:29', '2025-07-09 03:08:29', NULL),
(1180, 21, 1, 1, 'Yar Muhammad', 70, 'Ashraf ud Din', NULL, '2025-07-09 03:08:55', '2025-07-09 03:08:55', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2024_10_24_070033_create_districts_table', 1),
(6, '2024_10_31_102828_create_divisions_table', 2),
(7, '2024_10_31_105241_create_tehsils_table', 2),
(9, '2024_11_01_095010_create_villages_table', 4),
(12, '2024_11_01_040006_create_canal_outlets_table', 5),
(13, '2024_11_01_110102_create_canals_table', 6),
(14, '2024_11_01_125515_create_canals_table', 7),
(15, '2024_11_01_160915_village_id_to_canal_outlets_table', 8),
(16, '2024_11_01_170722_rename_village_id_in_canal_outlets_table', 9),
(17, '2024_11_01_171344_village_id_to_canal_outlets_table', 10),
(18, '2024_11_04_055910_create_farmers_table', 11),
(19, '2024_11_04_071907_create_admins_table', 12),
(21, '2024_11_06_044255_create_crops_table', 13),
(22, '2024_11_08_162149_create_roles_table', 14),
(23, '2024_11_08_163444_create_permissions_table', 15),
(24, '2024_11_09_170500_create_assign_roles_table', 16),
(25, '2024_11_11_054431_add_columns_to_users_table', 17),
(26, '2024_11_20_060822_div_id_to_districts_table', 18),
(27, '2024_11_20_063252_create_halqa_table', 19),
(28, '2024_11_21_035657_create_patwari_table', 20),
(29, '2024_11_25_073723_create_irrigators_table', 21),
(30, '2024_11_27_095311_create_land_records_table', 22),
(31, '2024_11_28_153748_add_halqa_id_to_villages_table', 23),
(32, '2024_12_04_041414_create_cropsurveys_table', 24),
(33, '2024_12_11_064448_rename_district_id_to_halqa_id_in_users_table', 25),
(34, '2024_12_19_071559_create_outlets_table', 26),
(35, '2024_12_20_102504_create_canals_table', 27),
(36, '2024_12_20_111509_create_canals_table', 28),
(37, '2024_12_20_113520_create_canals_table', 29),
(38, '2024_12_23_094232_create_crops_table', 30),
(39, '2024_12_23_163242_add_new_column_to_cropsurveys_table', 31),
(40, '2024_12_24_091957_create_cropprices_table', 32),
(43, '2024_12_24_092313_create_cropprices_table', 33),
(44, '2024_12_26_095212_add_new_column_to_cropprices_table', 33),
(45, '2024_12_26_105934_add_new_column_to_cropsurveys_table', 34),
(46, '2024_12_26_110353_add_new_column_to_cropsurveys_table', 35),
(47, '2025_01_13_105106_add_new_column_to_cropsurveys_table', 36),
(48, '2025_01_13_105107_add_new_column_to_cropsurveys_table', 37),
(49, '2025_01_13_112830_modify_review_column_in_cropsurveys_table', 38),
(50, '2025_02_28_100352_add_column_to_irrigators_table', 39),
(51, '2025_03_08_011751_add_columns_to_canals_table', 40),
(52, '2025_03_08_051615_create_minorcanals_table', 41),
(53, '2025_03_08_190432_create_distributaries_table', 42),
(54, '2025_03_10_042831_add_columns_to_outlets_table', 43),
(56, '2025_03_19_074347_create_reviews_table', 44),
(58, '2025_03_10_044908_add_columns_to_outlets_table', 45),
(59, '2025_03_19_093616_create_review_table', 45),
(60, '2025_03_20_044051_add_columns_to_users_table', 46),
(61, '2025_03_28_183443_add_div_id_to_irrigators_table', 47),
(62, '2025_06_05_082355_create_canal_branch_table', 48),
(63, '2025_06_19_075709_add_crop_type_to_cropprices_table', 49),
(64, '2025_06_23_192712_create_price_revenues_table', 50);

-- --------------------------------------------------------

--
-- Table structure for table `minorcanals`
--

CREATE TABLE `minorcanals` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `minor_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `canal_id` bigint(20) UNSIGNED DEFAULT NULL,
  `div_id` bigint(20) UNSIGNED DEFAULT NULL,
  `no_outlet` int(11) DEFAULT NULL,
  `no_outlet_ls` int(11) DEFAULT NULL,
  `no_outlet_rs` int(11) DEFAULT NULL,
  `total_no_cca` float(10,2) DEFAULT NULL,
  `total_no_discharge_cusic` float(10,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `minorcanals`
--

INSERT INTO `minorcanals` (`id`, `minor_name`, `canal_id`, `div_id`, `no_outlet`, `no_outlet_ls`, `no_outlet_rs`, `total_no_cca`, `total_no_discharge_cusic`, `created_at`, `updated_at`) VALUES
(1, 'Distry No 7', 1, 1, 11, 3, 7, 2531.00, 25.00, '2025-07-03 01:20:11', '2025-07-03 01:20:11'),
(2, 'Disty No 8', 1, 1, 54, 24, 29, 16533.00, 454.00, '2025-07-01 01:41:15', '2025-07-01 01:41:15'),
(3, 'Disty No 9', 1, 1, 55, 21, 33, 13333.00, 440.00, '2025-07-03 01:14:31', '2025-07-03 01:14:31'),
(4, 'Kandar Murdara', 3, 1, 4, 4, 0, 1058.00, 9.53, '2025-07-04 00:05:53', '2025-07-04 00:05:53'),
(5, 'Channel A', 5, 1, 4, 3, 1, 717.00, 6.45, '2025-07-04 00:21:03', '2025-07-04 00:21:03'),
(6, 'Channel B', 5, 1, 3, 1, 2, 630.00, 5.67, '2025-07-04 00:21:53', '2025-07-04 00:21:53');

-- --------------------------------------------------------

--
-- Table structure for table `outlets`
--

CREATE TABLE `outlets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `outlet_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `canal_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `div_id` bigint(20) UNSIGNED DEFAULT NULL,
  `minor_id` bigint(20) UNSIGNED DEFAULT NULL,
  `distrib_id` bigint(20) UNSIGNED DEFAULT NULL,
  `branch_id` bigint(20) DEFAULT NULL,
  `beneficiaries` int(11) DEFAULT NULL,
  `total_no_discharge_cusic` float(10,2) DEFAULT NULL,
  `total_no_cca` float(10,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `outlets`
--

INSERT INTO `outlets` (`id`, `outlet_name`, `canal_id`, `created_at`, `updated_at`, `div_id`, `minor_id`, `distrib_id`, `branch_id`, `beneficiaries`, `total_no_discharge_cusic`, `total_no_cca`) VALUES
(1, 'RD-6000-R', 1, '2025-07-03 03:10:36', '2025-07-03 03:10:36', 1, 3, 8, 2, 35, 4.11, 457.00),
(2, 'RD-25860-L', 1, '2025-07-03 03:13:50', '2025-07-03 03:13:50', 1, 2, 4, NULL, 153, 2.81, 312.00),
(3, 'RD-27705-L', 1, '2025-07-03 03:14:42', '2025-07-03 03:14:42', 1, 2, 4, NULL, 180, 3.26, 362.00),
(4, 'RD-29409-L', 1, '2025-07-03 03:15:16', '2025-07-03 03:15:16', 1, 2, 4, NULL, 93, 2.20, 245.00),
(5, 'RD-29409-TF', 1, '2025-07-03 03:22:26', '2025-07-03 03:22:26', 1, 2, 4, NULL, 34, 1.35, 150.00),
(6, 'RD-8714-L', 1, '2025-07-03 03:30:14', '2025-07-03 03:30:14', 1, 2, 4, 1, 21, 1.30, 144.00),
(7, 'RD-5782-L', 1, '2025-07-03 03:30:49', '2025-07-03 03:30:49', 1, 2, 4, 1, 55, 0.50, 56.00),
(8, 'RD-9284-L', 1, '2025-07-03 03:31:33', '2025-07-03 03:31:33', 1, 2, 4, 1, 151, 2.35, 261.00),
(9, 'RD-9284-TF', 1, '2025-07-03 03:32:26', '2025-07-03 03:32:26', 1, 2, 4, 1, 240, 2.88, 320.00),
(10, 'RD-11463-R', 1, '2025-07-03 03:33:11', '2025-07-03 03:33:11', 1, 2, 4, NULL, 67, 1.50, 167.00),
(11, 'High Drum', 1, '2025-07-03 03:36:35', '2025-07-03 03:36:35', 1, 2, 6, NULL, 1, 0.83, 93.00),
(12, 'TF Nowshera Minor', 1, '2025-07-03 03:38:24', '2025-07-03 03:38:24', 1, 2, 6, NULL, 1, 14.32, 1591.00),
(14, 'RD-9362-L', 1, '2025-07-03 04:31:37', '2025-07-03 04:31:37', 1, 3, NULL, NULL, 187, 5.97, 663.00),
(15, '6742-R', 1, '2025-07-03 04:39:25', '2025-07-03 04:39:25', 1, 3, 8, 3, 46, 2.57, 286.00),
(16, 'RD-10543-R', 1, '2025-07-03 04:43:04', '2025-07-05 14:13:14', 1, 3, 8, 3, 114, 3.57, 379.00),
(17, 'RD-13854-L', 1, '2025-07-03 04:44:12', '2025-07-03 04:44:12', 1, 3, NULL, NULL, 211, 4.82, 536.00),
(18, 'RD-10543-L', 1, '2025-07-03 04:46:49', '2025-07-03 04:46:49', 1, 3, 8, 3, 29, 1.85, 205.00),
(19, 'RD-40730-R', 1, '2025-07-03 04:52:15', '2025-07-03 05:20:27', 1, 3, 8, NULL, 79, 4.87, 541.00),
(20, 'RD-46600-R', 1, '2025-07-03 04:54:44', '2025-07-03 04:54:44', 1, 3, 8, NULL, 158, 3.58, 397.00),
(21, 'RD-34700-R', 1, '2025-07-03 04:56:42', '2025-07-03 04:57:27', 1, 3, 8, NULL, 67, 2.46, 274.00),
(22, 'RD-35500-R', 1, '2025-07-03 05:00:23', '2025-07-03 05:00:23', 1, 3, 8, NULL, 51, 2.30, 255.00),
(23, 'RD-38981-R', 1, '2025-07-03 05:01:42', '2025-07-03 05:01:42', 1, 3, 8, NULL, 51, 1.65, 184.00),
(24, 'RD-39441-R', 1, '2025-07-03 05:04:39', '2025-07-03 05:04:39', 1, 3, 8, NULL, 74, 2.63, 455.00),
(25, 'arbibanda', 2, '2025-07-03 05:06:37', '2025-07-03 05:06:37', 1, NULL, NULL, NULL, 63, 2.24, 250.00),
(26, 'RD-40489-R', 1, '2025-07-03 05:07:29', '2025-07-03 05:07:29', 1, 3, 8, NULL, 44, 2.20, 205.00),
(30, 'RD-17485-L', 1, '2025-07-03 05:14:08', '2025-07-03 05:14:08', 1, 3, NULL, NULL, 7, 3.34, 371.00),
(31, 'RD-17485-R', 1, '2025-07-03 05:15:37', '2025-07-03 05:15:37', 1, 3, NULL, NULL, 259, 2.58, 287.00),
(32, '11975-R', 1, '2025-07-03 05:19:04', '2025-07-03 05:19:04', 1, NULL, NULL, 2, 43, 3.50, 398.00),
(33, '28112-R', 1, '2025-07-03 05:23:04', '2025-07-03 05:23:04', 1, 3, 8, NULL, 61, 0.88, 98.00),
(34, 'RD-6000-L', 1, '2025-07-03 05:26:43', '2025-07-03 05:26:43', 1, 3, 8, 2, 23, 4.11, 457.00),
(35, 'RD-9560-L', 1, '2025-07-03 05:28:03', '2025-07-03 05:28:03', 1, 3, 8, 2, 33, 1.86, 207.00),
(36, '32700-R', 1, '2025-07-03 05:29:36', '2025-07-03 05:29:36', 1, 3, 8, NULL, 75, 3.50, 245.00),
(37, 'RD-11920-L', 1, '2025-07-03 05:30:40', '2025-07-03 05:30:40', 1, 3, 8, 2, 52, 2.57, 286.00),
(39, 'RD-23703-L', 1, '2025-07-03 05:41:13', '2025-07-03 05:41:13', 1, 3, NULL, NULL, 34, 3.14, 349.00),
(40, '33209-R', 1, '2025-07-03 05:41:45', '2025-07-03 05:41:45', 1, 3, 8, NULL, 5, 0.43, 48.00),
(42, '21592-R', 1, '2025-07-03 05:43:37', '2025-07-03 05:43:37', 1, 3, 8, NULL, 155, 3.21, 357.00),
(43, '24270-R', 1, '2025-07-03 05:44:16', '2025-07-03 05:44:16', 1, 3, 8, NULL, 14, 0.45, 50.00),
(44, '28112-R', 1, '2025-07-03 05:45:13', '2025-07-03 05:45:13', 1, 3, 8, NULL, 16, 0.88, 98.00),
(45, 'RD-7020-R', 1, '2025-07-03 05:51:49', '2025-07-03 05:54:23', 1, 3, 8, NULL, 65, 1.55, 173.00),
(46, 'RD-8748-R', 1, '2025-07-03 05:53:51', '2025-07-03 05:53:51', 1, 3, 8, NULL, 68, 1.50, 139.00),
(47, 'RD-12520-L', 1, '2025-07-03 05:59:51', '2025-07-03 05:59:51', 1, 3, 8, NULL, 33, 0.54, 60.00),
(48, 'RD-12480-R', 1, '2025-07-03 06:02:37', '2025-07-03 06:02:37', 1, 3, 8, NULL, 55, 1.29, 143.00),
(49, 'RD-85150-L', 1, '2025-07-03 06:05:56', '2025-07-03 06:05:56', 1, 3, NULL, NULL, 13, 0.92, 103.00),
(50, 'RD-19800-R', 1, '2025-07-03 06:08:11', '2025-07-03 06:08:11', 1, 3, NULL, NULL, 74, 2.24, 249.00),
(51, 'RD-13561-R', 1, '2025-07-03 06:08:13', '2025-07-03 06:08:13', 1, 3, 8, NULL, 56, 1.32, 147.00),
(52, 'RD-23626-R', 1, '2025-07-03 06:10:00', '2025-07-03 06:10:00', 1, 3, NULL, NULL, 119, 2.88, 320.00),
(53, 'RD-16890-R', 1, '2025-07-03 06:17:30', '2025-07-03 06:17:30', 1, 3, 8, NULL, 41, 1.34, 149.00),
(54, 'RD-23703-R', 1, '2025-07-03 06:47:14', '2025-07-03 06:47:14', 1, 3, NULL, NULL, 45, 3.14, 349.00),
(55, 'RD-27376-R', 1, '2025-07-03 06:47:53', '2025-07-03 06:47:53', 1, 3, NULL, NULL, 264, 3.70, 411.00),
(56, 'RD-30656-R', 1, '2025-07-03 06:48:31', '2025-07-03 06:48:31', 1, 3, NULL, NULL, 16, 3.05, 339.00),
(57, 'RD-30854-L', 1, '2025-07-03 06:49:20', '2025-07-03 06:49:20', 1, 3, NULL, NULL, 127, 4.93, 548.00),
(58, 'RD-2700-R', 1, '2025-07-03 07:07:59', '2025-07-03 07:07:59', 1, 3, 8, 2, 115, 4.08, 454.00),
(59, 'RD-3478-R', 1, '2025-07-03 07:09:04', '2025-07-03 07:09:04', 1, 3, 8, 2, 24, 1.21, 135.00),
(60, 'RD-5010-R', 1, '2025-07-03 09:40:11', '2025-07-03 09:40:11', 1, 3, 7, NULL, 138, 2.63, 292.00),
(61, 'RD-25860-L', 1, '2025-07-03 09:44:33', '2025-07-03 09:44:33', 1, 3, 7, NULL, 229, 2.75, 306.00),
(63, 'RD-38258-R', 1, '2025-07-03 09:53:59', '2025-07-03 09:53:59', 1, 3, NULL, NULL, 272, 3.70, 317.00),
(64, 'RD-40576-R', 1, '2025-07-03 09:55:28', '2025-07-03 09:55:28', 1, 3, NULL, NULL, 208, 2.10, 233.00),
(65, 'RD-9884-L', 1, '2025-07-03 09:57:21', '2025-07-03 09:57:21', 1, 3, 7, NULL, 84, 0.76, 84.00),
(66, 'RD-9882-L', 1, '2025-07-03 09:58:54', '2025-07-03 09:58:54', 1, 3, 7, NULL, 84, 2.20, 245.00),
(67, 'RD-8108-L', 1, '2025-07-03 10:01:11', '2025-07-03 10:01:11', 1, 3, 7, NULL, 133, 2.86, 318.00),
(68, 'RD-45245-L', 1, '2025-07-03 10:04:09', '2025-07-03 10:04:09', 1, 3, NULL, NULL, 1, 1.92, 207.00),
(69, 'RD-8108-R', 1, '2025-07-03 10:05:56', '2025-07-03 10:05:56', 1, 3, 7, NULL, 84, 3.17, 242.00),
(70, 'RD-9760-R', 1, '2025-07-03 10:09:57', '2025-07-03 10:09:57', 1, 3, 7, NULL, 1, 3.01, 334.00),
(71, 'RD-400-L', 1, '2025-07-03 10:12:16', '2025-07-03 10:12:16', 1, 3, 9, NULL, 6, 0.07, 8.00),
(72, 'RD-1400-R', 1, '2025-07-03 10:13:16', '2025-07-03 10:13:16', 1, 3, 9, NULL, 149, 2.38, 265.00),
(73, 'RD-85295-R', 1, '2025-07-03 10:13:52', '2025-07-03 10:13:52', 1, 3, NULL, NULL, 24, 1.40, 156.00),
(74, 'RD-44486-L', 1, '2025-07-03 10:14:57', '2025-07-03 10:14:57', 1, 3, NULL, NULL, 2, 0.84, 68.00),
(75, 'RD-75292-L', 1, '2025-07-03 10:15:29', '2025-07-03 10:15:29', 1, 3, NULL, NULL, 22, 3.05, 322.00),
(76, 'RD-40770-L', 1, '2025-07-03 10:15:46', '2025-07-03 10:15:46', 1, 3, NULL, NULL, 119, 1.36, 152.00),
(77, 'RD-38357-R', 1, '2025-07-03 10:16:40', '2025-07-03 10:16:40', 1, 3, NULL, NULL, 3, 0.20, 23.00),
(78, 'RD-75685-R', 1, '2025-07-03 10:16:48', '2025-07-03 10:16:48', 1, 3, NULL, NULL, 56, 2.55, 284.00),
(79, 'RD-40625-R', 1, '2025-07-03 10:17:30', '2025-07-03 10:17:30', 1, 3, NULL, NULL, 164, 2.58, 287.00),
(80, 'RD-78660-R', 1, '2025-07-03 10:18:05', '2025-07-03 10:18:05', 1, 3, NULL, NULL, 5, 0.36, 40.00),
(81, 'RD-4500-L', 1, '2025-07-03 10:18:16', '2025-07-03 10:18:16', 1, 3, 9, NULL, 12, 1.38, 153.00),
(82, 'RD-3563-R', 1, '2025-07-03 10:19:12', '2025-07-03 10:19:12', 1, 3, 9, NULL, 65, 4.59, 510.00),
(83, 'RD-78659-R', 1, '2025-07-03 10:19:27', '2025-07-03 10:19:27', 1, 3, NULL, NULL, 28, 0.61, 68.00),
(84, 'RD-40730-L', 1, '2025-07-03 10:20:01', '2025-07-03 10:20:01', 1, 3, NULL, NULL, 105, 3.73, 414.00),
(85, 'RD-15950-TF', 1, '2025-07-03 10:22:36', '2025-07-03 10:22:36', 1, 3, 11, NULL, 93, 5.99, 665.00),
(86, 'RD-15380-R', 1, '2025-07-03 10:24:06', '2025-07-03 10:24:06', 1, 3, 11, NULL, 45, 0.94, 104.00),
(87, 'RD-73455-R', 1, '2025-07-03 10:29:15', '2025-07-03 10:29:15', 1, 3, NULL, NULL, 17, 1.65, 184.00),
(88, 'RD-75486-L', 1, '2025-07-03 10:30:50', '2025-07-03 10:30:50', 1, 3, NULL, NULL, 32, 1.23, 137.00),
(89, 'RD-78860-R', 1, '2025-07-03 10:37:40', '2025-07-03 10:37:40', 1, 3, NULL, NULL, 4, 1.49, 130.00),
(90, 'RD-78970-R', 1, '2025-07-03 10:41:02', '2025-07-03 10:41:02', 1, 3, NULL, NULL, 2, 1.03, 115.00),
(91, 'RD-79860-L', 1, '2025-07-03 10:46:45', '2025-07-03 10:46:45', 1, 3, NULL, NULL, 26, 1.35, 150.00),
(92, 'RD-79825-L', 1, '2025-07-03 10:48:49', '2025-07-03 10:48:49', 1, 3, NULL, NULL, 14, 1.84, 205.00),
(93, 'RD-79761-L', 1, '2025-07-03 10:50:47', '2025-07-03 10:50:47', 1, 3, NULL, NULL, 88, 3.27, 363.00),
(94, 'RD-79855-L', 1, '2025-07-03 10:56:28', '2025-07-03 10:56:28', 1, 3, NULL, NULL, 160, 3.76, 418.00),
(95, 'RD-83192-R', 1, '2025-07-03 10:59:38', '2025-07-03 10:59:38', 1, 3, NULL, NULL, 1, 0.09, 11.00),
(96, 'RD-4373-R', 1, '2025-07-03 13:17:34', '2025-07-03 13:17:34', 1, 3, NULL, NULL, 137, 3.09, 344.00),
(97, 'RD-274-R', 1, '2025-07-03 13:19:02', '2025-07-03 13:19:02', 1, 3, NULL, NULL, 58, 0.56, 112.00),
(98, 'RD-55050-R', 1, '2025-07-03 13:20:26', '2025-07-03 13:20:26', 1, 3, NULL, NULL, 143, 7.67, 852.00),
(99, 'RD-2759-R', 1, '2025-07-03 13:21:13', '2025-07-03 13:21:13', 1, 3, NULL, NULL, 85, 0.89, 99.00),
(100, 'TF of Minor 1/9', 1, '2025-07-03 13:21:22', '2025-07-03 13:21:22', 1, 3, 7, NULL, 71, 2.67, 297.00),
(101, 'RD-62186-R', 1, '2025-07-03 13:22:22', '2025-07-03 13:22:22', 1, 3, NULL, NULL, 37, 4.29, 476.00),
(102, 'RD-15464-R', 1, '2025-07-03 13:23:10', '2025-07-03 13:23:10', 1, 3, 7, NULL, 10, 0.81, 90.00),
(104, 'RD-15464-L', 1, '2025-07-03 13:23:56', '2025-07-03 13:23:56', 1, 3, 7, NULL, 20, 1.59, 176.00),
(105, 'RD-6681-R', 1, '2025-07-03 13:24:11', '2025-07-03 13:24:11', 1, 3, NULL, NULL, 10, 0.00, 0.00),
(106, 'RD-17936-R', 1, '2025-07-03 13:24:42', '2025-07-03 13:24:42', 1, 3, 7, NULL, 48, 2.32, 248.00),
(107, 'RD-20140-L', 1, '2025-07-03 13:25:30', '2025-07-03 13:25:30', 1, 3, 7, NULL, 32, 0.52, 58.00),
(108, 'RD-4373-L', 1, '2025-07-03 13:25:42', '2025-07-03 13:25:42', 1, 3, NULL, NULL, 42, 3.73, 414.00),
(109, 'RD-55180-R', 1, '2025-07-03 13:26:12', '2025-07-03 13:26:12', 1, 3, NULL, NULL, 6, 1.00, 111.00),
(110, 'RD-56290-R', 1, '2025-07-03 13:26:54', '2025-07-03 13:26:54', 1, 3, NULL, NULL, 29, 3.42, 380.00),
(111, 'RD-6852-R', 1, '2025-07-03 13:27:11', '2025-07-03 13:27:11', 1, 3, NULL, NULL, 9, 0.00, 0.00),
(112, 'RD-51412-R', 1, '2025-07-03 13:27:40', '2025-07-03 13:27:40', 1, 3, NULL, NULL, 25, 1.00, 111.00),
(113, 'RD-6681-R', 1, '2025-07-03 13:28:22', '2025-07-03 13:28:22', 1, 3, NULL, NULL, 96, 1.51, 168.00),
(114, 'RD-7650-R', 1, '2025-07-03 13:28:24', '2025-07-03 13:28:24', 1, 3, 10, NULL, 2, 1.68, 187.00),
(115, 'RD-8874-R', 1, '2025-07-03 13:29:03', '2025-07-03 13:29:03', 1, 3, 10, NULL, 6, 1.28, 128.00),
(116, 'RD-7932-R', 1, '2025-07-03 13:30:28', '2025-07-03 13:30:28', 1, 3, NULL, NULL, 12, 0.62, 69.00),
(117, 'RD-6540-R', 1, '2025-07-03 13:33:12', '2025-07-03 13:33:12', 1, 3, NULL, NULL, 39, 1.74, 194.00),
(118, 'RD-9348-R', 1, '2025-07-03 13:36:44', '2025-07-03 13:36:44', 1, 3, NULL, NULL, 4, 0.00, 0.00),
(119, 'RD-11096-L', 1, '2025-07-03 13:38:09', '2025-07-03 13:38:09', 1, 3, NULL, NULL, 48, 2.63, 292.00),
(120, 'RD-11400-R', 1, '2025-07-03 13:40:07', '2025-07-03 13:40:07', 1, 3, NULL, NULL, 2, 1.92, 214.00),
(121, 'RD-13476-R', 1, '2025-07-03 13:41:29', '2025-07-03 13:41:29', 1, 3, NULL, NULL, 238, 2.27, 252.00),
(122, 'RD-1077-L', 3, '2025-07-04 00:26:14', '2025-07-04 00:26:14', 1, 4, NULL, NULL, 99, 2.91, 324.00),
(123, 'RD-3232-L', 3, '2025-07-04 00:26:52', '2025-07-04 00:26:52', 1, 4, NULL, NULL, 105, 3.03, 336.00),
(124, 'RD-4082-L', 3, '2025-07-04 00:28:23', '2025-07-04 00:28:23', 1, 4, NULL, NULL, 12, 3.52, 391.00),
(125, 'RD-4086-L', 3, '2025-07-04 00:29:09', '2025-07-04 00:29:09', 1, 4, NULL, NULL, 5, 0.06, 7.00),
(126, 'RD-1452-L', 3, '2025-07-04 00:29:52', '2025-07-04 00:29:52', 1, 4, 12, NULL, 44, 2.30, 255.00),
(127, 'RD-4312-L', 3, '2025-07-04 00:30:21', '2025-07-04 00:30:21', 1, 4, 12, NULL, 44, 1.51, 168.00),
(128, 'RD-7370-L', 3, '2025-07-04 00:31:03', '2025-07-04 00:31:03', 1, 4, 12, NULL, 46, 2.90, 322.00),
(129, 'RD-7800-L', 3, '2025-07-04 00:31:35', '2025-07-04 00:31:35', 1, 4, 12, NULL, 12, 3.32, 369.00),
(130, 'RD-11311-L', 3, '2025-07-04 00:32:41', '2025-07-04 00:32:41', 1, 4, 12, NULL, 0, 3.47, 385.00),
(131, 'RD-14200-L', 3, '2025-07-04 00:35:11', '2025-07-04 00:35:11', 1, 4, 12, NULL, 0, 2.70, 300.00),
(132, 'RD-1994-L', 1, '2025-07-04 00:59:37', '2025-07-04 00:59:37', 1, 3, 8, 2, 3, 0.85, 14.00),
(133, 'RD-17600-L', 3, '2025-07-04 01:24:26', '2025-07-04 01:24:26', 1, 4, 12, NULL, 0, 2.37, 263.00),
(134, 'RD-17800-TF', 3, '2025-07-04 01:25:04', '2025-07-04 01:25:04', 1, 4, 12, NULL, 0, 2.30, 256.00),
(135, 'RD-1320-R', 3, '2025-07-04 01:26:06', '2025-07-04 01:26:06', 1, 4, 13, NULL, 3, 0.54, 53.00),
(136, 'RD-3000-R', 3, '2025-07-04 01:28:05', '2025-07-04 01:28:05', 1, 4, 13, NULL, 46, 2.08, 231.00),
(137, 'RD-4000-R', 3, '2025-07-04 01:28:49', '2025-07-04 01:28:49', 1, 4, 13, NULL, 0, 1.77, 197.00),
(138, 'RD-13000-TF', 3, '2025-07-04 01:29:54', '2025-07-04 01:29:54', 1, 4, 13, NULL, 0, 0.95, 106.00),
(139, 'RD-50-R', 4, '2025-07-04 01:31:37', '2025-07-04 01:31:37', 1, NULL, NULL, NULL, 6, 1.07, 119.00),
(140, 'RD-50-L', 4, '2025-07-04 01:32:08', '2025-07-04 01:32:08', 1, NULL, NULL, NULL, 34, 0.28, 31.00),
(141, 'RD-5400-R', 4, '2025-07-04 01:32:46', '2025-07-04 01:32:46', 1, NULL, NULL, NULL, 33, 0.82, 91.00),
(142, 'RD-5400-L', 4, '2025-07-04 01:33:15', '2025-07-04 01:33:15', 1, NULL, NULL, NULL, 134, 2.58, 287.00),
(143, 'RD-6300-R', 4, '2025-07-04 01:34:48', '2025-07-04 01:34:48', 1, NULL, NULL, NULL, 29, 0.72, 80.00),
(144, 'RD-8000-TF', 4, '2025-07-04 01:35:16', '2025-07-04 01:35:16', 1, NULL, NULL, NULL, 94, 1.17, 130.00),
(145, 'RD-50-R', 5, '2025-07-04 01:38:32', '2025-07-04 01:38:32', 1, 5, NULL, NULL, 29, 0.18, 20.00),
(146, 'RD-50-L', 5, '2025-07-04 01:42:03', '2025-07-04 01:42:03', 1, 5, NULL, NULL, 66, 0.87, 97.00),
(147, 'RD-2700-L', 5, '2025-07-04 01:48:56', '2025-07-04 01:48:56', 1, 5, NULL, NULL, 116, 2.13, 236.00),
(148, 'RD-3000-TF', 5, '2025-07-04 01:49:59', '2025-07-04 01:49:59', 1, 5, NULL, NULL, 109, 3.39, 377.00),
(149, 'RD-1800-R', 5, '2025-07-04 01:50:41', '2025-07-04 01:50:41', 1, 6, NULL, NULL, 32, 0.29, 32.00),
(150, 'RD-4000-R', 5, '2025-07-04 01:51:17', '2025-07-04 01:51:17', 1, 6, NULL, NULL, 0, 1.54, 171.00),
(151, 'RD-6300-TF', 5, '2025-07-04 01:52:42', '2025-07-04 01:52:42', 1, 6, NULL, NULL, 0, 3.85, 427.00),
(152, 'RD-67200-R', 1, '2025-07-04 02:09:11', '2025-07-04 02:09:11', 1, 2, NULL, NULL, 104, 3.11, 345.00),
(153, 'RD-63962-R', 1, '2025-07-04 02:10:14', '2025-07-04 02:10:14', 1, 2, NULL, NULL, 10, 2.18, 242.00),
(154, 'RD-504-L', 1, '2025-07-04 02:30:11', '2025-07-04 02:30:11', 1, 2, 4, NULL, 58, 1.64, 182.00),
(155, 'RD-1892-L', 1, '2025-07-04 02:31:04', '2025-07-04 02:31:04', 1, 2, 4, NULL, 18, 0.93, 104.00),
(156, 'RD-3904-L', 1, '2025-07-04 02:32:41', '2025-07-04 02:32:41', 1, 2, 4, NULL, 51, 1.82, 202.00),
(157, 'RD-6080-L', 1, '2025-07-04 02:33:40', '2025-07-04 02:33:40', 1, 2, 4, NULL, 40, 1.82, 202.00),
(158, 'RD-8167-L', 1, '2025-07-04 02:34:50', '2025-07-04 02:34:50', 1, 2, 4, NULL, 65, 1.26, 140.00),
(159, 'RD-9730-L', 1, '2025-07-04 02:38:02', '2025-07-04 02:38:02', 1, 2, 4, NULL, 76, 1.45, 161.00),
(160, 'RD-1121-R', 1, '2025-07-04 02:39:03', '2025-07-04 02:39:03', 1, 2, 4, NULL, 8, 0.72, 80.00),
(161, 'RD-3392-R', 1, '2025-07-04 02:40:14', '2025-07-04 02:40:14', 1, 2, 4, NULL, 110, 1.92, 213.00),
(162, 'RD-3400-R', 1, '2025-07-04 02:44:15', '2025-07-04 02:44:15', 1, 2, 6, NULL, 43, 0.83, 93.00),
(163, 'RD-50468-L', 1, '2025-07-04 02:57:01', '2025-07-04 02:57:01', 1, 2, NULL, NULL, 175, 3.34, 371.00),
(164, 'RD-24745-L', 1, '2025-07-04 03:46:21', '2025-07-04 03:46:21', 1, 2, 4, NULL, 88, 1.42, 158.00),
(165, 'RD-11406-L', 1, '2025-07-04 03:47:46', '2025-07-04 03:47:46', 1, 2, 4, NULL, 27, 0.83, 93.83),
(166, 'RD-20963-L', 1, '2025-07-04 03:49:30', '2025-07-04 03:49:30', 1, 2, 4, NULL, 143, 1.41, 197.00),
(167, 'RD-12797-L', 1, '2025-07-04 03:54:55', '2025-07-04 03:54:55', 1, 2, 4, NULL, 53, 1.74, 197.00),
(168, 'RD-14734-L', 1, '2025-07-04 03:55:38', '2025-07-04 03:55:38', 1, 2, 4, NULL, 75, 1.20, 133.00),
(169, 'RD-16143-L', 1, '2025-07-04 04:02:51', '2025-07-04 04:02:51', 1, 2, 4, NULL, 15, 0.74, 83.00),
(170, 'RD-16702-L', 1, '2025-07-04 04:03:38', '2025-07-04 04:03:38', 1, 2, 4, NULL, 127, 1.67, 185.00),
(171, 'RD-16600-L', 1, '2025-07-04 04:05:04', '2025-07-04 04:05:04', 1, 2, 4, NULL, 15, 0.54, 60.00),
(172, 'RD-23245-L', 1, '2025-07-04 04:06:20', '2025-07-04 04:06:20', 1, 2, 4, NULL, 163, 2.37, 263.00),
(173, 'RD-22314-L', 1, '2025-07-04 04:10:01', '2025-07-04 04:10:01', 1, 2, 4, NULL, 158, 1.22, 136.00),
(174, 'RD-18438-L', 1, '2025-07-04 04:11:39', '2025-07-04 04:11:39', 1, 2, 4, NULL, 122, 1.92, 214.00),
(175, 'RD-59856-L', 1, '2025-07-04 04:46:25', '2025-07-04 04:46:25', 1, 2, NULL, NULL, 90, 2.20, 244.00),
(176, 'RD-63280-L', 1, '2025-07-04 04:47:14', '2025-07-04 04:47:14', 1, 2, NULL, NULL, 150, 2.38, 264.00),
(177, 'RD-63963-R', 1, '2025-07-04 04:48:28', '2025-07-04 04:48:28', 1, 2, NULL, NULL, 197, 2.65, 294.00),
(178, 'RD-69322-R', 1, '2025-07-04 04:59:19', '2025-07-04 04:59:19', 1, 2, NULL, NULL, 27, 0.94, 104.00),
(179, 'RD-26988-TF', 1, '2025-07-04 05:04:45', '2025-07-04 05:04:45', 1, 3, 8, 2, 94, 1.81, 201.00),
(180, 'RD-26988-R', 1, '2025-07-04 05:05:56', '2025-07-04 05:05:56', 1, 3, 8, 2, 24, 0.88, 24.00),
(181, 'RD-48310-L', 1, '2025-07-04 05:56:29', '2025-07-04 05:56:29', 1, 2, NULL, NULL, 14, 1.93, 199.00),
(182, 'RD-20606-L', 1, '2025-07-05 02:22:05', '2025-07-05 02:22:05', 1, 2, NULL, NULL, 16, 4.27, 69.00),
(183, 'RD-21341-L', 1, '2025-07-05 02:23:08', '2025-07-05 02:23:08', 1, 2, NULL, NULL, 8, 0.80, 89.00),
(184, 'RD-22651-L', 1, '2025-07-05 02:24:01', '2025-07-05 02:24:01', 1, 2, NULL, NULL, 10, 1.66, 56.00),
(185, 'RD-17915-R', 1, '2025-07-05 02:28:40', '2025-07-05 02:28:40', 1, 2, NULL, NULL, 76, 3.76, 358.00),
(186, 'RD-18003-R', 1, '2025-07-05 02:34:56', '2025-07-05 02:34:56', 1, 2, 1, NULL, 57, 3.73, 434.00),
(187, 'RD-20704-L', 1, '2025-07-05 02:35:55', '2025-07-05 02:35:55', 1, 2, 1, NULL, 37, 0.66, 73.00),
(188, 'RD-22893-L', 1, '2025-07-05 02:37:00', '2025-07-05 02:37:00', 1, 2, 1, NULL, 59, 2.46, 275.00),
(189, 'RD-13620-L', 1, '2025-07-05 02:40:11', '2025-07-05 02:40:11', 1, 2, NULL, NULL, 6, 2.25, 230.00),
(190, 'RD-20000-L', 1, '2025-07-05 02:41:39', '2025-07-05 02:41:39', 1, 2, NULL, NULL, 24, 2.36, 20.00),
(191, 'RD-2439-L', 1, '2025-07-05 02:43:10', '2025-07-05 02:43:10', 1, 2, 1, NULL, 45, 1.59, 177.00),
(192, 'RD-4847-R', 1, '2025-07-05 02:44:17', '2025-07-05 02:44:17', 1, 2, 1, NULL, 17, 1.21, 135.00),
(193, 'RD-4866-R', 1, '2025-07-05 02:45:50', '2025-07-05 02:45:50', 1, 2, 1, NULL, 45, 1.60, 178.00),
(194, 'RD-8624-R', 1, '2025-07-05 02:47:02', '2025-07-05 02:47:02', 1, 2, 1, NULL, 16, 0.70, 78.00),
(195, 'RD-11983-R', 1, '2025-07-05 02:50:14', '2025-07-05 02:50:14', 1, 2, 1, NULL, 28, 2.07, 269.00),
(196, 'RD-11679-R', 1, '2025-07-05 02:51:08', '2025-07-05 02:51:08', 1, 2, 1, NULL, 13, 1.66, 179.00),
(197, 'RD-18012-R', 1, '2025-07-05 02:53:39', '2025-07-05 02:53:39', 1, 2, 1, NULL, 9, 0.60, 69.00),
(198, 'RD-2664-L', 1, '2025-07-05 02:55:19', '2025-07-05 02:55:19', 1, 2, NULL, NULL, 8, 2.76, 50.00),
(199, 'RD-2663-L', 1, '2025-07-05 02:56:50', '2025-07-05 02:56:50', 1, 2, 1, NULL, 20, 1.92, 213.00),
(200, 'RD-8503-L', 1, '2025-07-05 02:58:05', '2025-07-05 02:58:05', 1, 2, 1, NULL, 121, 1.09, 3.00),
(201, 'RD-11990-L', 1, '2025-07-05 02:59:35', '2025-07-05 02:59:35', 1, 2, 1, NULL, 0, 0.00, 0.00),
(202, 'RD-12000-L', 1, '2025-07-05 03:00:18', '2025-07-05 03:00:18', 1, 2, 1, NULL, 8, 2.03, 237.00),
(203, 'RD-18005-L', 1, '2025-07-05 03:01:21', '2025-07-05 03:01:21', 1, 2, 1, NULL, 33, 1.94, 252.00),
(204, 'RD-11945-L', 1, '2025-07-05 03:02:28', '2025-07-05 03:02:28', 1, 2, 1, NULL, 4, 0.59, 71.00),
(205, 'RD-3981-R', 1, '2025-07-05 03:04:00', '2025-07-05 03:04:00', 1, 2, 2, NULL, 16, 0.69, 108.00),
(206, 'RD-5950-L', 1, '2025-07-05 03:04:57', '2025-07-05 03:04:57', 1, 2, 2, NULL, 24, 0.69, 77.00),
(207, 'RD-24000-R', 1, '2025-07-05 05:55:41', '2025-07-05 05:55:41', 1, 2, NULL, NULL, 56, 7.20, 738.00),
(208, 'RD-26882-R', 1, '2025-07-05 05:56:29', '2025-07-05 05:56:29', 1, 2, NULL, NULL, 17, 3.06, 340.00),
(209, 'RD-34343-R', 1, '2025-07-05 05:57:26', '2025-07-05 05:57:26', 1, 2, NULL, NULL, 19, 1.57, 158.00),
(210, 'RD-25753-L', 1, '2025-07-05 05:58:27', '2025-07-05 05:58:27', 1, 2, NULL, NULL, 14, 2.30, 219.00),
(211, 'RD-13994-R', 1, '2025-07-05 06:02:39', '2025-07-05 06:02:39', 1, 2, NULL, NULL, 25, 2.61, 96.00),
(212, 'RD-19381-R', 1, '2025-07-05 06:04:02', '2025-07-05 06:04:02', 1, 2, NULL, NULL, 76, 3.98, 442.00),
(213, 'RD-20157-R', 1, '2025-07-05 06:40:24', '2025-07-05 06:40:24', 1, 2, NULL, NULL, 84, 3.53, 392.00),
(214, 'RD-20132-R', 1, '2025-07-05 06:41:26', '2025-07-05 06:41:26', 1, 2, NULL, NULL, 56, 3.92, 434.00),
(215, 'RD-260003-R', 1, '2025-07-05 06:46:24', '2025-07-05 06:46:24', 1, 2, NULL, NULL, 312, 4.48, 497.00),
(216, 'RD-25950-R', 1, '2025-07-05 06:47:23', '2025-07-05 06:47:23', 1, 2, NULL, NULL, 135, 1.40, 139.00),
(217, 'RD-31198-R', 1, '2025-07-05 06:48:32', '2025-07-05 06:48:32', 1, 2, NULL, NULL, 38, 12.55, 1394.00),
(218, 'RD-38152-R', 1, '2025-07-05 06:49:35', '2025-07-05 06:49:35', 1, 2, NULL, NULL, 141, 1.77, 152.00),
(219, 'RD-42741-R', 1, '2025-07-05 06:51:01', '2025-07-05 06:51:01', 1, 2, NULL, NULL, 142, 2.85, 270.00),
(220, 'RD-21750-TF', 1, '2025-07-05 07:41:14', '2025-07-05 07:41:14', 1, 3, 8, 3, 1, 3.69, 410.00),
(221, 'RD-16225-L', 1, '2025-07-05 07:42:42', '2025-07-05 07:42:42', 1, 3, 8, 3, 74, 1.99, 221.00),
(222, 'RD-19690-R', 1, '2025-07-05 07:44:13', '2025-07-05 07:44:13', 1, 3, 8, 3, 47, 1.20, 134.00),
(223, 'RD-21750-L', 1, '2025-07-05 08:30:24', '2025-07-05 08:30:24', 1, 3, 8, 3, 35, 4.62, 513.00),
(224, 'RD-14248-R', 1, '2025-07-05 08:31:21', '2025-07-05 08:31:21', 1, 3, 8, 2, 24, 1.46, 162.00),
(225, 'RD-16225-L', 1, '2025-07-05 08:32:12', '2025-07-05 08:32:12', 1, 3, 8, 2, 55, 2.14, 238.00),
(226, 'RD-19282-L', 1, '2025-07-05 08:33:26', '2025-07-05 08:33:26', 1, 3, 8, 2, 17, 2.14, 238.00),
(227, 'RD-21750-R', 1, '2025-07-05 08:34:23', '2025-07-05 08:34:23', 1, 3, 8, 2, 92, 0.25, 27.00),
(228, 'RD-25976-R', 1, '2025-07-05 08:36:25', '2025-07-05 08:36:25', 1, 3, 8, 2, 5, 0.07, 8.00),
(229, 'RD-26988-L', 1, '2025-07-05 08:37:14', '2025-07-05 08:37:14', 1, 3, 8, 2, 24, 1.74, 193.00),
(230, 'RD-21750-L', 1, '2025-07-05 08:37:58', '2025-07-05 08:37:58', 1, 3, 8, 2, 106, 1.46, 162.00),
(231, 'RD-26988-R', 1, '2025-07-05 08:38:39', '2025-07-05 08:38:39', 1, 3, 8, 2, 102, 0.88, 98.00),
(232, 'RD-90543-R', 1, '2025-07-05 09:17:52', '2025-07-05 09:17:52', 1, NULL, NULL, NULL, 47, 1.64, 182.00),
(233, 'RD-95043-R', 1, '2025-07-05 09:18:39', '2025-07-05 09:18:39', 1, NULL, NULL, NULL, 113, 1.93, 214.00),
(234, 'RD-96182-R', 1, '2025-07-05 09:19:11', '2025-07-05 09:19:11', 1, NULL, NULL, NULL, 49, 5.94, 660.00),
(235, 'RD-114-R', 1, '2025-07-05 09:19:56', '2025-07-05 09:19:56', 1, 1, NULL, NULL, 65, 1.64, 364.00),
(236, 'RD-114-L', 1, '2025-07-05 09:20:27', '2025-07-05 09:20:27', 1, 1, NULL, NULL, 55, 1.64, 207.00),
(237, 'RD-1463-R', 1, '2025-07-05 09:21:01', '2025-07-05 09:21:01', 1, 1, NULL, NULL, 96, 3.66, 407.00),
(238, 'RD-1639-R', 1, '2025-07-05 09:21:46', '2025-07-05 09:21:46', 1, 1, NULL, NULL, 67, 2.03, 226.00),
(239, 'RD-4371-R', 1, '2025-07-05 09:22:21', '2025-07-05 09:22:21', 1, 1, NULL, NULL, 45, 1.03, 114.00),
(240, 'RD-6010-L', 1, '2025-07-05 09:23:01', '2025-07-05 09:23:01', 1, 1, NULL, NULL, 60, 1.41, 157.00),
(241, 'RD-8912-R', 1, '2025-07-05 09:23:34', '2025-07-05 09:23:34', 1, 1, NULL, NULL, 34, 0.73, 81.00),
(242, 'RD-8954-L', 1, '2025-07-05 09:24:14', '2025-07-05 09:24:14', 1, 1, NULL, NULL, 40, 1.20, 133.00),
(243, 'RD-11620-R', 1, '2025-07-05 09:25:21', '2025-07-05 09:25:21', 1, 1, NULL, NULL, 12, 0.36, 40.00),
(244, 'RD-12845-R', 1, '2025-07-05 09:25:56', '2025-07-05 09:25:56', 1, 1, NULL, NULL, 13, 0.24, 27.00),
(245, 'RD-12993-R', 1, '2025-07-05 14:22:40', '2025-07-05 14:22:40', 1, 3, 8, NULL, 52, 1.70, 90.00),
(246, 'RD-12993-L', 1, '2025-07-05 14:23:29', '2025-07-05 14:23:29', 1, 3, 8, NULL, 27, 1.92, 213.00),
(247, 'RD-1994-R', 1, '2025-07-05 14:24:14', '2025-07-05 14:24:14', 1, 3, 8, NULL, 40, 2.29, 254.00),
(248, 'RD-1994-TF', 1, '2025-07-05 14:24:54', '2025-07-05 14:24:54', 1, 3, 8, NULL, 82, 3.40, 377.00),
(249, 'RD-44865-R', 1, '2025-07-05 14:27:25', '2025-07-05 14:27:25', 1, 3, 8, NULL, 54, 0.53, 63.00),
(250, 'RD-50010-R', 1, '2025-07-05 14:29:56', '2025-07-05 14:29:56', 1, 3, 8, NULL, 36, 1.93, 214.00),
(251, 'RD-50018-R', 1, '2025-07-05 14:30:39', '2025-07-05 14:30:39', 1, 3, 8, NULL, 51, 1.43, 159.00),
(252, 'RD-50075-R', 1, '2025-07-05 14:31:23', '2025-07-05 14:31:23', 1, 3, 8, NULL, 45, 2.08, 231.00),
(253, 'RD-3000-L', 1, '2025-07-05 14:32:10', '2025-07-05 14:32:10', 1, 3, 8, 3, 41, 1.50, 167.00),
(254, 'RD-5500-L', 1, '2025-07-05 14:32:46', '2025-07-05 14:32:46', 1, 3, 8, 3, 17, 1.67, 186.00),
(255, 'RD-6742-L', 1, '2025-07-05 14:34:01', '2025-07-05 14:34:01', 1, 3, 8, 3, 65, 1.13, 126.00),
(256, 'RD-106957-R', 1, '2025-07-06 23:21:03', '2025-07-06 23:21:03', 1, NULL, NULL, NULL, 20, 8.20, 63.00),
(257, 'RD-106957-R', 1, '2025-07-06 23:22:23', '2025-07-06 23:22:23', 1, NULL, NULL, NULL, 49, 8.20, 190.00),
(258, 'RD-104590-R', 1, '2025-07-06 23:23:56', '2025-07-06 23:23:56', 1, NULL, NULL, NULL, 19, 1.19, 125.00),
(259, 'RD-2664-L', 1, '2025-07-06 23:25:22', '2025-07-06 23:25:22', 1, 2, NULL, NULL, 19, 2.76, 76.00),
(260, 'RD-7742-L', 1, '2025-07-06 23:26:18', '2025-07-06 23:26:18', 1, 2, NULL, NULL, 31, 1.14, 127.00),
(261, 'RD-7744-R', 1, '2025-07-06 23:27:24', '2025-07-06 23:27:24', 1, 2, NULL, NULL, 134, 5.21, 579.00),
(262, 'RD-13476-R', 1, '2025-07-06 23:28:21', '2025-07-06 23:28:21', 1, 2, NULL, NULL, 48, 1.29, 149.00),
(263, 'RD-110445-R', 1, '2025-07-06 23:29:24', '2025-07-06 23:29:24', 1, NULL, NULL, NULL, 148, 4.10, 456.00),
(264, 'RD-106957-R', 1, '2025-07-06 23:30:30', '2025-07-06 23:30:30', 1, NULL, NULL, NULL, 128, 8.20, 658.00),
(265, 'RD-101691-R', 1, '2025-07-06 23:36:40', '2025-07-06 23:36:40', 1, NULL, NULL, NULL, 18, 0.45, 50.00),
(266, 'RD-10459-R', 1, '2025-07-06 23:38:08', '2025-07-06 23:38:08', 1, NULL, NULL, NULL, 4, 1.19, 9.00),
(267, 'RD-2664-L', 1, '2025-07-06 23:39:06', '2025-07-06 23:39:06', 1, NULL, NULL, NULL, 62, 2.76, 181.00),
(268, 'RD-62186-R', 1, '2025-07-06 23:45:20', '2025-07-06 23:45:20', 1, 3, NULL, NULL, 11, 4.29, 61.00),
(269, 'RD-66258-R', 1, '2025-07-06 23:46:52', '2025-07-06 23:46:52', 1, 3, NULL, NULL, 32, 0.89, 95.00),
(270, 'RD-66258-L', 1, '2025-07-06 23:54:10', '2025-07-06 23:54:10', 1, 3, NULL, NULL, 1, 0.89, 44.00),
(271, 'RD-7000-R', 1, '2025-07-06 23:55:32', '2025-07-06 23:55:32', 1, 3, 11, NULL, 13, 0.22, 24.00),
(272, 'RD-8658-R', 1, '2025-07-06 23:56:57', '2025-07-06 23:56:57', 1, 3, 11, NULL, 93, 0.92, 102.00),
(273, 'RD-5650-R', 1, '2025-07-06 23:58:09', '2025-07-06 23:58:09', 1, 3, 11, NULL, 9, 1.54, 171.00),
(274, 'RD-12900-R', 1, '2025-07-06 23:59:15', '2025-07-06 23:59:15', 1, 3, 11, NULL, 7, 0.16, 12.00),
(275, 'RD-13965-R', 1, '2025-07-07 00:00:56', '2025-07-07 00:00:56', 1, 3, 7, NULL, 95, 2.00, 222.00),
(276, 'RD-18826-L', 1, '2025-07-07 00:53:49', '2025-07-07 00:53:49', 1, 3, 10, NULL, 15, 0.81, 84.00),
(277, 'RD-19815-R', 1, '2025-07-07 00:56:13', '2025-07-07 00:56:13', 1, 3, 10, NULL, 50, 2.37, 263.00),
(278, 'RD-19821-R', 1, '2025-07-07 01:01:38', '2025-07-07 01:01:38', 1, 3, 10, NULL, 81, 1.29, 143.00),
(279, 'RD-12900-TF', 1, '2025-07-07 01:02:33', '2025-07-07 01:02:33', 1, 3, 10, NULL, 33, 1.01, 113.00),
(280, 'RD-12900-R', 1, '2025-07-07 01:03:59', '2025-07-07 01:03:59', 1, 3, 11, NULL, 9, 0.16, 6.00),
(281, 'RD-14930-L', 1, '2025-07-07 01:05:11', '2025-07-07 01:05:11', 1, 3, 11, NULL, 4, 0.69, 10.00),
(282, 'RD-15950-TF', 1, '2025-07-07 01:06:41', '2025-07-07 01:06:41', 1, 3, 11, NULL, 4, 5.99, 280.00),
(283, 'RD-4429-L', 1, '2025-07-07 01:07:51', '2025-07-07 01:07:51', 1, 3, 11, NULL, 20, 0.09, 10.00),
(284, 'RD-8670-L', 1, '2025-07-07 01:08:47', '2025-07-07 01:08:47', 1, 3, 11, NULL, 10, 0.09, 0.00),
(285, 'RD-61000-R', 1, '2025-07-07 01:10:37', '2025-07-07 01:10:37', 1, 3, NULL, NULL, 29, 0.56, 62.00),
(286, 'RD-62186-R', 1, '2025-07-07 01:11:22', '2025-07-07 01:11:22', 1, 3, NULL, NULL, 5, 4.29, 15.00),
(287, 'RD-62337-R', 1, '2025-07-07 01:12:48', '2025-07-07 01:12:48', 1, 3, NULL, NULL, 10, 0.63, 70.00),
(288, 'RD-62176-R', 1, '2025-07-07 01:13:42', '2025-07-07 01:13:42', 1, 3, NULL, NULL, 10, 1.43, 161.00),
(289, 'RD-3450-R', 1, '2025-07-07 01:14:57', '2025-07-07 01:14:57', 1, 3, 11, NULL, 14, 1.59, 121.00),
(290, 'RD-8874-R', 1, '2025-07-07 01:16:09', '2025-07-07 01:16:09', 1, 3, 10, NULL, 3, 1.28, 14.00),
(291, 'RD-12359-L', 1, '2025-07-07 01:17:23', '2025-07-07 01:17:23', 1, 3, 10, NULL, 1, 0.22, 25.00),
(292, 'RD-12776-R', 1, '2025-07-07 01:19:15', '2025-07-07 01:19:15', 1, 3, 10, NULL, 24, 1.26, 140.00),
(293, 'RD-13110-R', 1, '2025-07-07 01:22:51', '2025-07-07 01:22:51', 1, 3, NULL, NULL, 48, 1.48, 165.00),
(294, 'RD-14995-L', 1, '2025-07-07 01:28:59', '2025-07-07 01:28:59', 1, 3, 10, NULL, 4, 0.29, 32.00),
(295, 'RD-15511-R', 1, '2025-07-07 01:30:08', '2025-07-07 01:30:08', 1, 3, 10, NULL, 50, 1.36, 151.00),
(296, 'RD-15805-R', 1, '2025-07-07 01:32:43', '2025-07-07 01:32:43', 1, 3, 10, NULL, 35, 0.56, 63.00),
(297, 'RD-15960-L', 1, '2025-07-07 01:33:46', '2025-07-07 01:33:46', 1, 3, 10, NULL, 20, 1.00, 111.00),
(298, 'RD-18170-L', 1, '2025-07-07 01:34:46', '2025-07-07 01:34:46', 1, 3, 10, NULL, 3, 0.00, 26.00),
(299, 'RD-18357-R', 1, '2025-07-07 01:35:56', '2025-07-07 01:35:56', 1, 3, 10, NULL, 23, 0.78, 87.00),
(300, 'RD-18630-L', 1, '2025-07-07 01:40:28', '2025-07-07 01:40:28', 1, 3, 10, NULL, 1, 0.16, 18.00),
(301, 'RD-18826-L', 1, '2025-07-07 01:43:14', '2025-07-07 01:43:14', 1, 3, 10, NULL, 5, 0.81, 6.00),
(302, 'RD-19000-L', 1, '2025-07-07 01:44:12', '2025-07-07 01:44:12', 1, 3, 10, NULL, 6, 0.16, 18.00),
(303, 'RD-19000-L', 1, '2025-07-07 01:44:12', '2025-07-07 01:44:12', 1, 3, 10, NULL, 6, 0.16, 18.00),
(304, 'RD-7885-L', 1, '2025-07-07 05:28:35', '2025-07-07 05:28:35', 1, 2, NULL, NULL, 80, 4.15, 461.00),
(305, 'RD-13523-R', 1, '2025-07-07 05:45:54', '2025-07-07 05:45:54', 1, 2, NULL, NULL, 40, 21.80, 241.00),
(306, 'RD-13620-L', 1, '2025-07-07 05:47:59', '2025-07-07 05:47:59', 1, 2, NULL, NULL, 110, 2.25, 230.00),
(307, 'RD-19362-R', 1, '2025-07-07 05:59:01', '2025-07-07 05:59:01', 1, 2, NULL, NULL, 70, 1.45, 21.00),
(308, 'RD-38166-L', 1, '2025-07-07 12:33:57', '2025-07-07 12:33:57', 1, 2, NULL, NULL, 60, 2.40, 322.00),
(309, 'RD-40671-L', 1, '2025-07-07 12:34:45', '2025-07-07 12:34:45', 1, 2, NULL, NULL, 196, 3.56, 395.00),
(310, 'RD-42743-L', 1, '2025-07-07 12:36:14', '2025-07-07 12:36:14', 1, 2, NULL, NULL, 63, 2.22, 246.00),
(311, 'RD-42813-L', 1, '2025-07-07 12:36:57', '2025-07-07 12:36:57', 1, 2, NULL, NULL, 224, 3.08, 341.00),
(312, 'RD-48320-L', 1, '2025-07-07 12:37:37', '2025-07-07 12:37:37', 1, 2, NULL, NULL, 203, 1.31, 146.00),
(313, 'RD-50565-L', 1, '2025-07-07 12:38:15', '2025-07-07 12:38:15', 1, 2, NULL, NULL, 59, 1.11, 123.00),
(314, 'RD-8432-R', 1, '2025-07-07 12:44:54', '2025-07-07 12:44:54', 1, 2, 3, NULL, 83, 0.41, 47.00),
(315, 'RD-4396-L', 1, '2025-07-07 12:48:56', '2025-07-07 12:48:56', 1, 2, 3, NULL, 25, 1.02, 204.00),
(316, 'RD-7958-L', 1, '2025-07-07 12:49:32', '2025-07-07 12:49:32', 1, 2, 3, NULL, 82, 1.18, 285.00),
(317, 'RD-11500-L', 1, '2025-07-07 12:55:08', '2025-07-07 12:55:08', 1, 2, 3, NULL, 2, 1.00, 111.00),
(318, 'RD-12300-R', 1, '2025-07-07 12:55:51', '2025-07-07 12:55:51', 1, 2, 3, NULL, 7, 0.42, 45.00),
(319, 'RD-47904-L', 1, '2025-07-07 12:57:53', '2025-07-07 12:57:53', 1, 2, NULL, NULL, 184, 2.90, 398.00),
(320, 'RD-1365-TF', 1, '2025-07-07 12:59:51', '2025-07-07 12:59:51', 1, 2, 3, NULL, 17, 2.90, 464.00),
(321, 'RD-15358-R', 1, '2025-07-07 13:02:19', '2025-07-07 13:02:19', 1, 2, 2, NULL, 2, 0.38, 44.00),
(322, 'RD-18968-L', 1, '2025-07-07 13:02:56', '2025-07-07 13:02:56', 1, 2, 2, NULL, 49, 1.19, 132.00),
(323, 'RD-18968-R', 1, '2025-07-07 13:03:35', '2025-07-07 13:03:35', 1, 2, 2, NULL, 130, 3.21, 356.00),
(324, 'RD-31987-L', 1, '2025-07-07 13:15:05', '2025-07-07 13:15:05', 1, 2, 1, NULL, 2, 3.32, 431.00),
(325, 'RD-25750-R', 1, '2025-07-07 13:18:20', '2025-07-07 13:18:20', 1, 2, 1, NULL, 7, 0.39, 46.00),
(326, 'RD-25750-L', 1, '2025-07-07 13:20:59', '2025-07-07 13:20:59', 1, 2, 1, NULL, 15, 1.43, 173.00),
(327, 'RD-22893-L', 1, '2025-07-07 13:26:09', '2025-07-07 13:26:09', 1, 2, 1, NULL, 14, 0.65, 94.00),
(328, 'RD-25512-R', 1, '2025-07-07 13:28:17', '2025-07-07 13:28:17', 1, 2, 1, NULL, 71, 2.50, 278.00),
(329, 'RD-32095-R', 1, '2025-07-07 13:30:10', '2025-07-07 13:30:10', 1, 2, 1, NULL, 27, 1.17, 130.00),
(330, 'RD-8990-L', 1, '2025-07-07 13:31:02', '2025-07-07 13:31:02', 1, 2, 2, NULL, 10, 0.56, 63.00),
(331, 'RD-12075-L', 1, '2025-07-07 13:36:07', '2025-07-07 13:36:07', 1, 2, 2, NULL, 26, 2.19, 100.00),
(332, 'RD-14200-L', 1, '2025-07-07 13:37:26', '2025-07-07 13:37:26', 1, 2, 2, NULL, 19, 1.28, 143.00),
(333, 'RD-14280-L', 1, '2025-07-07 13:38:01', '2025-07-07 13:38:01', 1, 2, 2, NULL, 19, 0.77, 36.00),
(334, 'RD-8418-R', 1, '2025-07-07 13:39:12', '2025-07-07 13:39:12', 1, 2, 2, NULL, 68, 3.94, 387.00),
(335, 'RD-11920-R', 1, '2025-07-07 13:40:13', '2025-07-07 13:40:13', 1, 2, 2, NULL, 710, 1.09, 122.00),
(336, 'RD-12125-R', 1, '2025-07-07 13:41:06', '2025-07-07 13:41:06', 1, 2, 2, NULL, 49, 2.90, 322.00),
(337, 'RD-34347-L', 1, '2025-07-07 13:41:44', '2025-07-07 13:41:44', 1, 2, NULL, NULL, 2, 1.01, 113.00),
(338, 'RD-19421-R', 1, '2025-07-09 01:53:40', '2025-07-09 01:53:40', 1, 2, NULL, NULL, 80, 0.45, 16.00),
(339, 'RD-20188-R', 1, '2025-07-09 01:54:47', '2025-07-09 01:54:47', 1, 2, NULL, NULL, 90, 1.69, 207.00),
(340, 'RD-20592-R', 1, '2025-07-09 01:57:30', '2025-07-09 01:57:30', 1, 2, NULL, NULL, 110, 0.40, 55.00),
(341, 'RD-20606-R', 1, '2025-07-09 01:58:35', '2025-07-09 01:58:35', 1, 2, NULL, NULL, 20, 4.27, 474.00),
(342, 'RD-22665-L', 1, '2025-07-09 02:04:20', '2025-07-09 02:04:20', 1, 2, NULL, NULL, 24, 1.66, 129.00),
(343, 'RD-22940-R', 1, '2025-07-09 02:09:48', '2025-07-09 02:09:48', 1, NULL, NULL, NULL, 4, 489.00, 489.00),
(344, 'RD-24000-R', 1, '2025-07-09 02:11:30', '2025-07-09 02:11:30', 1, 2, NULL, NULL, 65, 7.20, 61.00),
(345, 'RD-35934-R', 1, '2025-07-09 02:12:56', '2025-07-09 02:12:56', 1, 2, 1, NULL, 90, 0.48, 57.00),
(346, 'RD-38980-L', 1, '2025-07-09 02:15:46', '2025-07-09 02:15:46', 1, 2, 1, NULL, 10, 2.45, 287.00),
(347, 'RD-41721-R', 1, '2025-07-09 02:17:51', '2025-07-09 02:17:51', 1, 2, NULL, NULL, 3, 3.04, 351.00),
(348, 'RD-42871-R', 1, '2025-07-09 02:19:51', '2025-07-09 02:19:51', 1, 2, 1, NULL, 289, 2.27, 45.00),
(349, 'RD-44794-R', 1, '2025-07-09 02:22:02', '2025-07-09 02:22:02', 1, 2, 1, NULL, 28, 1.13, 125.00),
(350, 'RD-44876-R', 1, '2025-07-09 02:24:12', '2025-07-09 02:24:12', 1, 2, 1, NULL, 76, 2.61, 92.00),
(351, 'RD-44812-L', 1, '2025-07-09 02:25:53', '2025-07-09 02:25:53', 1, NULL, NULL, NULL, 90, 0.60, 74.00),
(352, 'RD-44574-R', 1, '2025-07-09 02:27:16', '2025-07-09 02:27:16', 1, 2, 1, NULL, 15, 1.36, 161.00),
(353, 'RD-49032-L', 1, '2025-07-09 02:29:20', '2025-07-09 02:29:20', 1, 2, 1, NULL, 29, 1.89, 227.00),
(354, 'RD-46876-R', 1, '2025-07-09 02:35:01', '2025-07-09 02:35:01', 1, 2, 1, NULL, 94, 2.61, 211.00),
(355, 'RD-47307-R', 1, '2025-07-09 02:36:28', '2025-07-09 02:36:28', 1, 2, 1, NULL, 112, 2.09, 232.00),
(356, 'RD-14927-R', 1, '2025-07-09 02:38:32', '2025-07-09 02:38:32', 1, 2, 3, NULL, 92, 2.09, 232.00),
(357, 'RD-14927-L', 1, '2025-07-09 02:41:30', '2025-07-09 02:41:30', 1, 2, 3, NULL, 10, 2.62, 246.00),
(358, 'RD-49076-R', 1, '2025-07-09 02:46:39', '2025-07-09 02:46:39', 1, 2, 1, NULL, 40, 5.81, 690.00),
(359, 'RD-49076-TF', 1, '2025-07-09 02:47:59', '2025-07-09 02:47:59', 1, 2, 1, NULL, 10, 2.62, 316.00),
(360, 'RD-14927-R', 1, '2025-07-09 02:49:54', '2025-07-09 02:49:54', 1, 2, 3, NULL, 14, 1.62, 248.00),
(361, 'RD-14932-TF', 1, '2025-07-09 02:51:12', '2025-07-09 02:51:12', 1, 2, 3, NULL, 8, 2.98, 530.00),
(362, 'RD-52702-R', 1, '2025-07-09 02:55:05', '2025-07-09 02:55:05', 1, 2, NULL, NULL, 14, 5.40, 185.00),
(363, 'RD-50936-R', 1, '2025-07-09 02:55:57', '2025-07-09 02:55:57', 1, 2, NULL, NULL, 18, 2.70, 284.00),
(364, 'RD-53356-R', 1, '2025-07-09 02:57:00', '2025-07-09 02:57:00', 1, 2, NULL, NULL, 30, 0.91, 78.00),
(365, 'RD-56242-R', 1, '2025-07-09 02:58:45', '2025-07-09 02:58:45', 1, 2, NULL, NULL, 90, 1.20, 386.00),
(366, 'RD-56128-L', 1, '2025-07-09 03:00:17', '2025-07-09 03:00:17', 1, 2, NULL, NULL, 122, 1.09, 110.00),
(367, 'RD-49856-L', 1, '2025-07-09 03:01:48', '2025-07-09 03:01:48', 1, 2, NULL, NULL, 230, 0.77, 86.00),
(368, 'RD-62133-L', 1, '2025-07-09 03:03:05', '2025-07-09 03:03:05', 1, 2, NULL, NULL, 145, 0.43, 37.00),
(369, 'RD-50956-R', 1, '2025-07-09 03:04:25', '2025-07-09 03:04:25', 1, 2, NULL, NULL, 38, 1.07, 23.00),
(370, 'RD-62843-R', 1, '2025-07-09 03:05:31', '2025-07-09 03:05:31', 1, 2, NULL, NULL, 18, 3.10, 344.00),
(371, 'RD-42702-R', 1, '2025-07-09 03:06:24', '2025-07-09 03:06:24', 1, 2, NULL, NULL, 14, 5.04, 185.00),
(372, 'RD-53353-R', 1, '2025-07-09 03:07:56', '2025-07-09 03:07:56', 1, 2, NULL, NULL, 38, 3.88, 23.00),
(373, 'RD-53250-L', 1, '2025-07-09 03:08:59', '2025-07-09 03:08:59', 1, 2, NULL, NULL, 23, 3.88, 65.00),
(374, 'RD-50936-R', 1, '2025-07-09 03:10:42', '2025-07-09 03:10:42', 1, 2, NULL, NULL, 10, 3.70, 19.00),
(375, 'RD-67200-R', 1, '2025-07-09 03:11:28', '2025-07-09 03:11:28', 1, 2, NULL, NULL, 30, 3.10, 155.00),
(376, 'RD-53250-L', 1, '2025-07-09 03:12:52', '2025-07-09 03:12:52', 1, 2, NULL, NULL, 290, 3.88, 409.00),
(377, 'RD-53250-L', 1, '2025-07-09 03:13:49', '2025-07-09 03:13:49', 1, 2, NULL, NULL, 15, 0.61, 68.00);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `patwari`
--

CREATE TABLE `patwari` (
  `patwari_id` bigint(20) UNSIGNED NOT NULL,
  `patwari_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `patwari_cnic` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `halqa_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'delete', '2024-11-09 11:32:10', '2024-11-09 11:32:10'),
(2, 'Add User', '2024-11-09 11:43:38', '2024-11-09 11:43:38'),
(3, 'Edit User', '2024-11-09 11:43:53', '2024-11-09 11:43:53'),
(4, 'Delete User', '2024-11-09 11:44:03', '2024-11-09 11:44:03'),
(5, 'Add Demand Statement', '2024-11-09 11:44:38', '2024-11-09 11:44:38'),
(6, 'Edit Demand Statement', '2024-11-09 11:45:13', '2024-11-09 11:45:13'),
(7, 'update', '2024-11-12 11:20:16', '2024-11-12 11:20:16'),
(8, 'uzair', '2024-11-25 05:17:20', '2024-11-25 05:17:20'),
(9, 'Charsdda', '2025-02-22 12:34:29', '2025-02-22 12:34:29');

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `personal_access_tokens`
--

INSERT INTO `personal_access_tokens` (`id`, `tokenable_type`, `tokenable_id`, `name`, `token`, `abilities`, `last_used_at`, `expires_at`, `created_at`, `updated_at`) VALUES
(1, 'App\\Models\\User', 1, 'YourAppName', '60482d9551a01bfc2446c4e7b86dd66ef916570850696be618c15537425438ac', '[\"*\"]', NULL, NULL, '2024-11-05 11:28:02', '2024-11-05 11:28:02'),
(2, 'App\\Models\\User', 1, 'YourAppName', 'e22a777508bf02df984757c1849bdf77e27457aae64ea8cb608c1f5bef9754db', '[\"*\"]', NULL, NULL, '2024-11-05 11:36:21', '2024-11-05 11:36:21'),
(3, 'App\\Models\\User', 1, 'YourAppName', '13c5b2d96cd52f062ab22b8c87de17683c1d3ed39ffacf5e0058a33ef40ccaa9', '[\"*\"]', NULL, NULL, '2024-11-05 11:36:23', '2024-11-05 11:36:23'),
(4, 'App\\Models\\User', 1, 'YourAppName', '43d39dad30a1a374b559335a7f9b6a71ccb1904aeb91f3671c8446e2355613d8', '[\"*\"]', NULL, NULL, '2024-11-07 00:48:50', '2024-11-07 00:48:50'),
(5, 'App\\Models\\User', 1, 'api-token', '017a693cfe56cde15e13ff9c2963dcba8351710ddf3e744fd26d6d1c25cb930e', '[\"*\"]', NULL, NULL, '2025-07-02 04:13:00', '2025-07-02 04:13:00'),
(6, 'App\\Models\\User', 1, 'api-token', 'c72932c5d788e163f719c2cab31d6b9f7f3d0cd8d3318defe9549806799f2e7f', '[\"*\"]', NULL, NULL, '2025-07-02 04:13:59', '2025-07-02 04:13:59'),
(7, 'App\\Models\\User', 2, 'api-token', 'd5e7c071e8c23555adfa51f478b8404bb161b6be499b040e21160733ef9e8d8d', '[\"*\"]', NULL, NULL, '2025-07-02 04:14:26', '2025-07-02 04:14:26'),
(8, 'App\\Models\\User', 2, 'api-token', '8aed2ca09ae214960518b29747ea320aa6eabd00e82b02b4be25ad5c8702253d', '[\"*\"]', '2025-07-02 05:25:42', NULL, '2025-07-02 05:25:37', '2025-07-02 05:25:42'),
(9, 'App\\Models\\User', 2, 'api-token', '1c5952fd72e2dccd585ec149671e0fd24150936a7f789b2b82d0c3e65d04679d', '[\"*\"]', '2025-07-02 05:32:55', NULL, '2025-07-02 05:32:55', '2025-07-02 05:32:55'),
(10, 'App\\Models\\User', 2, 'api-token', 'cf6b18dada651595a0e39e9622a42cc5b4d17780267beade4b6acb4e367b1324', '[\"*\"]', NULL, NULL, '2025-07-02 05:37:39', '2025-07-02 05:37:39'),
(11, 'App\\Models\\User', 2, 'api-token', '8ab7f2a813b05112f3a78eb9acdc4379a92a9b6eb298ffef23605e4330baf740', '[\"*\"]', '2025-07-03 04:50:57', NULL, '2025-07-02 05:40:46', '2025-07-03 04:50:57'),
(12, 'App\\Models\\User', 2, 'api-token', 'c42c4cede8b89f3206766b49dd6624e3b099049062693e260e7d368b4cd51306', '[\"*\"]', '2025-07-08 02:59:10', NULL, '2025-07-03 05:03:22', '2025-07-08 02:59:10'),
(13, 'App\\Models\\User', 2, 'api-token', 'd60528ec5fa20bc6762209d52ebfd7de9a78aaf5394b59d72b133049f8db7321', '[\"*\"]', '2025-07-08 13:14:35', NULL, '2025-07-03 23:50:03', '2025-07-08 13:14:35'),
(14, 'App\\Models\\User', 2, 'api-token', 'caac83e6b960be97b23d973766e3a84cb6d51b4d2e026219ae99d8a703c97edd', '[\"*\"]', '2025-07-09 05:15:19', NULL, '2025-07-08 03:10:01', '2025-07-09 05:15:19');

-- --------------------------------------------------------

--
-- Table structure for table `price_revenues`
--

CREATE TABLE `price_revenues` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `crop_type` enum('Cash Crop','Non-Cash Crop') COLLATE utf8mb4_unicode_ci NOT NULL,
  `flow` double(10,2) NOT NULL,
  `LIS` double(10,2) NOT NULL,
  `t_well` double(10,2) NOT NULL,
  `jhallar` double(10,2) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `price_revenues`
--

INSERT INTO `price_revenues` (`id`, `crop_type`, `flow`, `LIS`, `t_well`, `jhallar`, `created_at`, `updated_at`) VALUES
(1, 'Cash Crop', 600.00, 1200.00, 1200.00, 300.00, '2025-06-23 14:51:56', '2025-06-23 15:18:41'),
(2, 'Non-Cash Crop', 400.00, 800.00, 800.00, 200.00, '2025-06-23 14:55:19', '2025-06-25 05:52:56');

-- --------------------------------------------------------

--
-- Table structure for table `review`
--

CREATE TABLE `review` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `review_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `servey_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'Admin', '2024-11-09 11:39:08', '2024-11-09 11:39:08'),
(12, 'Patwari', '2024-11-19 05:08:18', '2024-11-19 05:08:18'),
(15, 'Zilladar', '2025-01-08 06:26:00', '2025-01-08 06:26:00'),
(16, 'Deputy Collector', '2025-01-08 06:27:07', '2025-01-08 06:27:07'),
(17, 'XEN', '2025-01-08 06:27:50', '2025-01-08 06:27:50');

-- --------------------------------------------------------

--
-- Table structure for table `tehsils`
--

CREATE TABLE `tehsils` (
  `tehsil_id` bigint(20) UNSIGNED NOT NULL,
  `tehsil_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `district_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tehsils`
--

INSERT INTO `tehsils` (`tehsil_id`, `tehsil_name`, `district_id`, `created_at`, `updated_at`) VALUES
(1, 'Nowshera', 1, '2025-07-01 01:33:37', '2025-07-01 01:33:37'),
(2, 'Mardan', 2, '2025-07-01 01:35:29', '2025-07-01 01:35:29'),
(3, 'Takht Bhai', 2, '2025-07-01 03:57:42', '2025-07-01 03:57:42'),
(4, 'Ghari Kapora', 2, '2025-07-01 04:05:16', '2025-07-01 04:05:16'),
(5, 'Charsadda', 3, '2025-07-03 02:12:58', '2025-07-03 02:12:58');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `div_id` bigint(20) UNSIGNED DEFAULT NULL,
  `district_id` bigint(20) UNSIGNED DEFAULT NULL,
  `tehsil_id` bigint(20) UNSIGNED DEFAULT NULL,
  `name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `halqa_id` bigint(20) UNSIGNED DEFAULT '0',
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `phone_number` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `div_id`, `district_id`, `tehsil_id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`, `halqa_id`, `role_id`, `phone_number`) VALUES
(1, NULL, NULL, NULL, 'Admin', 'admin@gmail.com', NULL, '$2y$10$PT10r7qjSD5AquLackEBsOSJJU4tEw6oSyvonU0i6ARbsPG6A3Dl.', NULL, '2024-12-17 04:09:58', '2024-12-17 04:09:58', 0, 1, '03171443929'),
(2, NULL, 2, 2, 'Waqas', 'waqas7066@gmail.com', NULL, '$2y$10$JH.L/O9CY.R/J3jYVEYEpOrSpEboN/BboLqq5mkJd1u04UETDa8mG', NULL, '2025-07-01 01:38:49', '2025-07-01 01:38:49', 2, 12, '03459024533'),
(3, NULL, 1, 1, 'Muhammad Naeem', 'mnaeemkhan100@gmail.com', NULL, '$2y$10$I4E.XbkqHTPB0wsBRCLOi.PN0XzA5VZsJMctcBOUkA0AQylBWaWiK', NULL, '2025-07-01 02:15:24', '2025-07-01 02:15:24', 1, 12, '03005711036'),
(4, NULL, 2, NULL, 'Faisal Bacha', 'faisal123@gmail.com', NULL, '$2y$10$PMy6/qMkNbAvvR/RkUNj3.U429S9KuRv5VAM3DEuhlZWEiROLHwN6', NULL, '2025-07-01 02:46:17', '2025-07-01 03:01:55', 1, 15, '03009302420'),
(5, NULL, 2, NULL, 'DCI Mardan', 'dcimardan@gmail.com', NULL, '$2y$10$WCAg1DsO6oFIhJWb5lIaFuGLpwVu/r9i5/74l6DsLxHtLWAVZB7HC', NULL, '2025-07-01 02:49:52', '2025-07-01 03:02:48', 1, 16, '03189955494'),
(7, 1, NULL, NULL, 'XEN', 'xen@gmail.com', NULL, '$2y$10$Np6bgBOlixckCTtzVr0Ixeicm/rCm50J9uZfJHt3v1VCYKXtlZzbi', NULL, '2025-07-01 03:00:16', '2025-07-01 03:04:13', 1, 17, '88888'),
(8, NULL, 2, 2, 'Shakeel Pervez', 'shakeelpervez3@gmail.com', NULL, '$2y$10$OEHqyOBCKlymVa.IY8zbE.8cBxwuTJ5nsw5q1Zez.Dv3mv28RF0Qu', NULL, '2025-07-01 04:02:42', '2025-07-01 04:02:42', 4, 12, '03145357887'),
(9, NULL, 2, 3, 'Naveed Khan', 'naveedyosafzai@gmail.com', NULL, '$2y$10$Gt6X0KV3O2TRV0Z8Mi8JiuOjbsA1g5kSkCHJyqnD.ebnExfoCkfoy', NULL, '2025-07-01 04:17:31', '2025-07-01 04:17:31', 5, 12, '03457111258'),
(10, NULL, 2, 3, 'Ibad Rahman', 'ibad4126@gmail.com', NULL, '$2y$10$nE0War4dzVkE.MvwxFFgM.uCm3quaY04CMKjiKrcQkOqsH9odvxZC', NULL, '2025-07-01 04:32:01', '2025-07-01 04:32:01', 3, 12, '03339858894'),
(11, NULL, 2, NULL, 'Faisal Jamal Bacha', 'faisalbacha123@yahoo.com', NULL, '$2y$10$wsYPJMl7VCPOk2zczzaopuWrjV/Kry04f5WtiQqBVQe1JZGdDC8.K', NULL, '2025-07-03 00:48:13', '2025-07-03 00:48:13', NULL, 15, '03009302420'),
(12, NULL, 2, 2, 'Muhammad Uzair', 'muhammaduzair@gmail.com', NULL, '$2y$10$exLwo1ol4ZABTytD7yUgxeEhwsPChC75H/pUvDIr3.t36fnS7GCQy', NULL, '2025-07-03 00:53:44', '2025-07-03 00:53:44', 6, 12, '03139692750'),
(13, NULL, 2, 2, 'Walli Rehman', 'wallirehman@gmail.com', NULL, '$2y$10$Hp0C3EKL.jk/SZRq43F4/uPc.RONXN8ilBV2nGjUDJ9nvEw1mnX/2', NULL, '2025-07-03 01:12:35', '2025-07-03 01:12:35', 8, 12, '03459344239'),
(14, NULL, 1, 1, 'Muhammad Sulaiman and Naeem', 'bandachail@gmail.com', NULL, '$2y$10$SLP0woCo6WjgV.udAdMuTeRNuGod9/kDkvQ2gnSS2AATKwAxIYPSa', NULL, '2025-07-03 01:18:37', '2025-07-03 01:54:53', 9, 12, '03355713413'),
(15, NULL, 2, 2, 'fateh khan', 'fatehkhan@gmail.com', NULL, '$2y$10$8zdcPwiTl9kAMlp0INEZd.FuJU3Un9Egx4DKmkq21FJ87TThe.cUy', NULL, '2025-07-03 01:24:54', '2025-07-03 01:24:54', 10, 12, '03009844874'),
(16, NULL, 2, 2, 'Syed  Nadeem Shah', 'syedan@gmail.com', NULL, '$2y$10$GU.DnILDRahY4l6bJj.KHe8kgli0FpzvKmskqd6niDm86tK.BpfbS', NULL, '2025-07-03 01:26:16', '2025-07-03 01:26:16', 7, 12, '03135940725'),
(17, NULL, 2, NULL, 'Aizaz ali shah', 'aizazalishah@gmail.com', NULL, '$2y$10$BioQ3Hn0j3VEEohXx8pyxOrmXT5JLWY//RB0uyd7VGpdfNrQY6Xby', NULL, '2025-07-03 01:28:50', '2025-07-03 02:21:41', 11, 12, '03450735757'),
(18, NULL, 2, 3, 'Muhammad Israr', 'misrar@gmail.com', NULL, '$2y$10$hlZof4u436g6J3oNc6MOY.mYCN8UaOJd/pGS//lmsWpF/tmqcd/FS', NULL, '2025-07-03 01:32:15', '2025-07-03 01:32:15', 12, 12, '03450348038'),
(19, NULL, 2, 2, 'Arshad Ali', 'alladadkhail@gmail.com', NULL, '$2y$10$evnhPqCt0J89bnhtlfmddeIdRa7e8B6QmC9Z6lowHPBEmoMwj/4eC', NULL, '2025-07-03 01:39:36', '2025-07-03 02:26:50', 13, 12, '03075980262'),
(20, NULL, 2, 2, 'Mustafa Kamal', 'ghaladher@gmail.com', NULL, '$2y$10$7uXZ8w2b5OhOmpO4SRd.POSDX6armz2/Ym8TFDCoY15EALZfZKVXi', NULL, '2025-07-03 01:42:05', '2025-07-03 01:42:05', 14, 12, '03459656624'),
(21, NULL, 1, 1, 'Javed Khan', 'kandar@gmail.com', NULL, '$2y$10$gqJurY9nrplsAOVsE7uIj.tEdQZGBuazF3o3e5bYb/kMFd4Fsyeni', NULL, '2025-07-03 01:49:56', '2025-07-03 01:49:56', 15, 12, '03134253838'),
(22, NULL, 2, 2, 'shaid Khan', 'bagheiram@gmail.com', NULL, '$2y$10$xcqNj3bzR.8O3gdcfcS8ye8HQVd.sK338eomO3liqJq33gfQMiOVm', NULL, '2025-07-03 01:51:41', '2025-07-03 01:51:41', 16, 12, '03028333353'),
(23, NULL, 2, 2, 'saidbadshah', 'khazanadheri@gmail.com', NULL, '$2y$10$PT10r7qjSD5AquLackEBsOSJJU4tEw6oSyvonU0i6ARbsPG6A3Dl.', NULL, '2025-07-03 01:57:17', '2025-07-03 01:57:17', 17, 12, '03459344022'),
(24, NULL, 2, 2, 'Faisal Jamal Bacha', 'ferozpur@gmail.com', NULL, '$2y$10$OZy3URZ1.VhDlg2bXfjQn.jmlQE6J4GNNJsZEIChtaUUMXCVamVJm', NULL, '2025-07-03 02:01:33', '2025-07-03 02:01:33', 18, 12, '03009302420'),
(25, NULL, 2, 3, 'Muzaffar shah', 'shahbaig@gmail.com', NULL, '$2y$10$V9DcLETYGKHpIZgTP8VSEe0XVtMJJu2hMz7Pi08H/GRLDPvpIHqTG', NULL, '2025-07-03 02:03:32', '2025-07-03 02:03:32', 19, 12, '03459361827'),
(26, NULL, 2, 3, 'Ali rehman', 'naraino8@gmail.com', NULL, '$2y$10$glHS.Ij8K3DW0la3vuH/D.CAiIkL5UnOa9oUmpz7GqPOARV8SMrDC', NULL, '2025-07-03 02:05:49', '2025-07-03 02:05:49', 20, 12, '03149052209'),
(27, NULL, 2, 2, 'Ajmal khan', 'managa@gmail.com', NULL, '$2y$10$fkYuszP/L2FW9/CYuKzy7eObkkOZsehKDGzuySCQeqN/Yumm5U9WS', NULL, '2025-07-03 02:07:47', '2025-07-03 02:07:47', 21, 12, '03451196522'),
(28, NULL, 2, 2, 'chmatar derri', 'chmatarderri@gmail.com', NULL, '$2y$10$3Uo/ueeyfbooeIhArqBxtuI0OJNGR3OzcbDMQNLIfMH8lwFZB5Vnq', NULL, '2025-07-03 02:10:36', '2025-07-03 02:10:36', 22, 12, '03139473074'),
(29, NULL, 3, 5, 'Haryanah', 'haryanah@gmail.com', NULL, '$2y$10$s2eQiTZrQVbMKYuIO9Kp3.oDprL/eyHLaDfwgjiMQe/FxMpR9oKeK', NULL, '2025-07-03 02:14:49', '2025-07-03 02:14:49', 23, 12, '03459344022'),
(30, NULL, 2, 2, 'Mustafa Kamal', 'hotino9@gmail.com', NULL, '$2y$10$..99Wj/l7/yb238Osy8aq.FhIULehFRdINLxn9hVQRQkB9M0sHmhC', NULL, '2025-07-03 02:18:41', '2025-07-03 02:18:41', 24, 12, '03459656624');

-- --------------------------------------------------------

--
-- Table structure for table `villages`
--

CREATE TABLE `villages` (
  `village_id` bigint(20) UNSIGNED NOT NULL,
  `halqa_id` bigint(20) UNSIGNED DEFAULT NULL,
  `village_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tehsil_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `villages`
--

INSERT INTO `villages` (`village_id`, `halqa_id`, `village_name`, `tehsil_id`, `created_at`, `updated_at`) VALUES
(1, 1, 'raskai', 1, '2025-07-01 01:34:19', '2025-07-01 01:34:19'),
(2, 1, 'Koterpan', 1, '2025-07-01 01:35:15', '2025-07-01 01:35:15'),
(3, 1, 'Barabanda', 1, '2025-07-01 01:35:28', '2025-07-01 01:35:28'),
(4, 1, 'Kandar', 1, '2025-07-01 01:35:45', '2025-07-01 01:35:45'),
(5, 1, 'Risal Pur Cantt', 1, '2025-07-01 01:36:01', '2025-07-01 01:36:01'),
(6, 1, 'Behram Kalli Lower Swat', 1, '2025-07-01 01:36:16', '2025-07-01 01:36:16'),
(7, 2, 'Akhbar Abad', 2, '2025-07-01 01:36:39', '2025-07-01 01:36:39'),
(8, 1, 'Raksakar Nowshera', 1, '2025-07-01 01:36:49', '2025-07-01 01:36:49'),
(9, 2, 'Sheikh Yousaf', 2, '2025-07-01 01:37:10', '2025-07-01 01:37:10'),
(10, 2, 'Rak Sarkar', 2, '2025-07-01 01:37:43', '2025-07-01 01:37:43'),
(11, 3, 'Ahmad abad', 3, '2025-07-01 03:58:52', '2025-07-01 03:58:52'),
(12, 3, 'Rahmat abad', 3, '2025-07-01 03:59:10', '2025-07-01 03:59:10'),
(13, 3, 'Narai No 7', 3, '2025-07-01 03:59:57', '2025-07-01 03:59:57'),
(14, 4, 'Mayar', 2, '2025-07-01 04:03:15', '2025-07-01 04:03:15'),
(15, 4, 'Mohib Banda', 4, '2025-07-01 04:03:47', '2025-07-01 04:03:47'),
(16, 4, 'Hoti Par', 2, '2025-07-01 04:04:41', '2025-07-01 04:04:41'),
(17, 5, 'Naray', 3, '2025-07-01 04:10:47', '2025-07-01 04:10:47'),
(18, 5, 'Kot Junghra', 3, '2025-07-01 04:13:45', '2025-07-01 04:13:45'),
(19, 5, 'Fatih Abad', 3, '2025-07-01 04:14:22', '2025-07-01 04:14:22'),
(20, 5, 'Jhamrra', 3, '2025-07-01 04:14:52', '2025-07-01 04:14:52'),
(21, 6, 'Mardan', 2, '2025-07-03 00:57:28', '2025-07-03 00:57:28'),
(22, 7, 'Gujar Garhi', 2, '2025-07-03 01:07:18', '2025-07-03 01:07:18'),
(23, 7, 'Baghdada', 2, '2025-07-03 01:11:01', '2025-07-03 01:11:01'),
(24, 10, 'Jehangirabad', 3, '2025-07-03 02:33:50', '2025-07-03 02:33:50'),
(25, 10, 'Arabi Banda', 3, '2025-07-03 02:34:21', '2025-07-03 02:34:21'),
(26, 10, 'Arbai banda LIC', 3, '2025-07-03 02:35:14', '2025-07-03 02:35:14'),
(27, 10, 'Gujar Garhi LIC', 2, '2025-07-03 02:37:53', '2025-07-03 02:37:53'),
(28, 10, 'kodinaka', 2, '2025-07-03 02:38:52', '2025-07-03 02:38:52'),
(29, 10, 'dagai', 2, '2025-07-03 02:39:20', '2025-07-03 02:39:20'),
(30, 10, 'check mardan', 2, '2025-07-03 02:39:42', '2025-07-03 02:39:42'),
(31, 14, 'Khat', 2, '2025-07-03 02:48:04', '2025-07-03 02:48:04'),
(32, 14, 'Khao', 2, '2025-07-03 02:48:19', '2025-07-03 02:48:19'),
(33, 14, 'Behram Khan Kale', 2, '2025-07-03 02:48:33', '2025-07-03 02:48:33'),
(34, 14, 'Toro', 2, '2025-07-03 02:48:47', '2025-07-03 02:48:47'),
(35, 14, 'Ghala Dher', 2, '2025-07-03 02:49:07', '2025-07-03 02:49:07'),
(36, 10, 'Gujar Garhi T', 2, '2025-07-03 02:49:28', '2025-07-03 02:49:28'),
(37, 4, 'Muhib Banda', 4, '2025-07-03 02:51:23', '2025-07-03 02:51:23'),
(38, 13, 'Kozband', 2, '2025-07-03 02:56:51', '2025-07-03 02:56:51'),
(39, 13, 'Fathma', 2, '2025-07-03 02:57:05', '2025-07-03 02:57:05'),
(40, 13, 'Babeni', 2, '2025-07-03 02:57:21', '2025-07-03 02:57:21'),
(41, 13, 'Taos Banda', 2, '2025-07-03 02:57:32', '2025-07-03 02:57:32'),
(42, 13, 'Alladad Khael', 2, '2025-07-03 02:57:45', '2025-07-03 02:57:45'),
(43, 6, 'Akbar Abad', 2, '2025-07-03 03:00:24', '2025-07-03 03:00:24'),
(44, 6, 'Mardan No 9', 2, '2025-07-03 03:01:09', '2025-07-03 03:01:09'),
(45, 6, 'Cantt Mardan', 2, '2025-07-03 03:01:21', '2025-07-03 03:01:21'),
(46, 9, 'Banda Chail', 1, '2025-07-03 03:02:46', '2025-07-03 03:02:46'),
(47, 9, 'Kalanjer', 1, '2025-07-03 03:03:00', '2025-07-03 03:03:00'),
(48, 9, 'Spin Kani', 1, '2025-07-03 03:03:19', '2025-07-03 03:03:19'),
(49, 9, 'Mulla Kalli', 1, '2025-07-03 03:03:47', '2025-07-03 03:03:47'),
(50, 9, 'Kheshgi Payan', 1, '2025-07-03 03:04:40', '2025-07-03 03:04:40'),
(51, 9, 'Kheshgi Bala', 1, '2025-07-03 03:04:57', '2025-07-03 03:04:57'),
(52, 16, 'Korgh', 2, '2025-07-03 03:08:05', '2025-07-03 03:08:05'),
(53, 16, 'Roria', 2, '2025-07-03 03:08:47', '2025-07-03 03:08:47'),
(54, 16, 'mardan village', 2, '2025-07-03 03:09:27', '2025-07-03 03:09:27'),
(55, 16, 'Bagheiram', 2, '2025-07-03 03:10:38', '2025-07-03 03:10:38'),
(56, 12, 'Afzal abad', 3, '2025-07-04 00:24:33', '2025-07-04 00:24:33'),
(57, 12, 'Chail', 3, '2025-07-04 00:26:43', '2025-07-04 00:26:43'),
(58, 11, 'char banda', 2, '2025-07-04 02:16:13', '2025-07-04 02:16:13'),
(59, 11, 'ghori banda', 2, '2025-07-04 02:20:19', '2025-07-04 02:20:19'),
(60, 17, 'Khwaja Rashaka', 2, '2025-07-04 04:43:34', '2025-07-04 04:43:34'),
(61, 17, 'Khanjar', 2, '2025-07-04 04:44:01', '2025-07-04 04:44:01'),
(62, 17, 'Khazana Deheri', 2, '2025-07-04 04:44:21', '2025-07-04 04:44:21'),
(63, 15, 'Pir saqab', 1, '2025-07-09 03:16:54', '2025-07-09 03:16:54'),
(64, 15, 'Risalpur Scheme', 1, '2025-07-09 03:17:33', '2025-07-09 03:17:33'),
(65, 15, 'Kandar Scheme', 1, '2025-07-09 03:18:04', '2025-07-09 03:18:04'),
(66, 15, 'Old Mayar', 2, '2025-07-09 03:18:47', '2025-07-09 03:18:47'),
(67, 15, 'New Mayar', 2, '2025-07-09 03:19:10', '2025-07-09 03:19:10');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `assign_roles`
--
ALTER TABLE `assign_roles`
  ADD PRIMARY KEY (`id`),
  ADD KEY `assign_roles_role_id_foreign` (`role_id`),
  ADD KEY `assign_roles_permission_id_foreign` (`permission_id`);

--
-- Indexes for table `canals`
--
ALTER TABLE `canals`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `canal_branch`
--
ALTER TABLE `canal_branch`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cropprices`
--
ALTER TABLE `cropprices`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `crops`
--
ALTER TABLE `crops`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cropsurveys`
--
ALTER TABLE `cropsurveys`
  ADD PRIMARY KEY (`crop_survey_id`);

--
-- Indexes for table `distributaries`
--
ALTER TABLE `distributaries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `districts`
--
ALTER TABLE `districts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `divisions`
--
ALTER TABLE `divisions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `divisions_divsion_name_unique` (`divsion_name`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `farmers`
--
ALTER TABLE `farmers`
  ADD PRIMARY KEY (`farmer_id`);

--
-- Indexes for table `halqa`
--
ALTER TABLE `halqa`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `irrigators`
--
ALTER TABLE `irrigators`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `minorcanals`
--
ALTER TABLE `minorcanals`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `outlets`
--
ALTER TABLE `outlets`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `patwari`
--
ALTER TABLE `patwari`
  ADD PRIMARY KEY (`patwari_id`),
  ADD UNIQUE KEY `patwari_patwari_cnic_unique` (`patwari_cnic`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `permissions_name_unique` (`name`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `price_revenues`
--
ALTER TABLE `price_revenues`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `review`
--
ALTER TABLE `review`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `roles_name_unique` (`name`);

--
-- Indexes for table `tehsils`
--
ALTER TABLE `tehsils`
  ADD PRIMARY KEY (`tehsil_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Indexes for table `villages`
--
ALTER TABLE `villages`
  ADD PRIMARY KEY (`village_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `assign_roles`
--
ALTER TABLE `assign_roles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `canals`
--
ALTER TABLE `canals`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `canal_branch`
--
ALTER TABLE `canal_branch`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `cropprices`
--
ALTER TABLE `cropprices`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `crops`
--
ALTER TABLE `crops`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `cropsurveys`
--
ALTER TABLE `cropsurveys`
  MODIFY `crop_survey_id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=167;

--
-- AUTO_INCREMENT for table `distributaries`
--
ALTER TABLE `distributaries`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `districts`
--
ALTER TABLE `districts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `divisions`
--
ALTER TABLE `divisions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `farmers`
--
ALTER TABLE `farmers`
  MODIFY `farmer_id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `halqa`
--
ALTER TABLE `halqa`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `irrigators`
--
ALTER TABLE `irrigators`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1181;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT for table `minorcanals`
--
ALTER TABLE `minorcanals`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `outlets`
--
ALTER TABLE `outlets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=378;

--
-- AUTO_INCREMENT for table `patwari`
--
ALTER TABLE `patwari`
  MODIFY `patwari_id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `price_revenues`
--
ALTER TABLE `price_revenues`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `review`
--
ALTER TABLE `review`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `tehsils`
--
ALTER TABLE `tehsils`
  MODIFY `tehsil_id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `villages`
--
ALTER TABLE `villages`
  MODIFY `village_id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=68;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `assign_roles`
--
ALTER TABLE `assign_roles`
  ADD CONSTRAINT `assign_roles_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `assign_roles_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
